zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ADC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_ADC.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for ADC
 *
 * CMSIS Peripheral Access Layer for ADC
 */

#if !defined(PERI_ADC_H_)
#define PERI_ADC_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */

/** ADC - Size of Registers Arrays */
#define ADC_THRHLR_COUNT                          4u
#define ADC_CDR1_COUNT                            8u
#define ADC_CDR2_COUNT                            24u
#define ADC_CDR3_COUNT                            32u
#define ADC_CWSELRPI_COUNT                        2u
#define ADC_CWSELRSI_COUNT                        3u
#define ADC_CWSELREI_COUNT                        4u

/** ADC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Main Configuration, offset: 0x0 */
  __I  uint32_t MSR;                               /**< Main Status, offset: 0x4 */
       uint8_t RESERVED_0[8];
  __IO uint32_t ISR;                               /**< Interrupt Status, offset: 0x10 */
  __IO uint32_t CEOCFR0;                           /**< Channel End Of Conversion Flag For Precision Inputs, offset: 0x14 */
  __IO uint32_t CEOCFR1;                           /**< Channel End Of Conversion Flag For Standard Inputs, offset: 0x18 */
  __IO uint32_t CEOCFR2;                           /**< Channel End Of Conversion Flag For External Inputs, offset: 0x1C, available only on: ADC_0, ADC_1 (missing on ADC_2) */
  __IO uint32_t IMR;                               /**< Interrupt Mask, offset: 0x20 */
  __IO uint32_t CIMR0;                             /**< EOC Interrupt Enable For Precision Inputs, offset: 0x24 */
  __IO uint32_t CIMR1;                             /**< EOC Interrupt Enable For Standard Inputs, offset: 0x28 */
  __IO uint32_t CIMR2;                             /**< EOC Interrupt Enable For External Inputs, offset: 0x2C, available only on: ADC_0, ADC_1 (missing on ADC_2) */
  __IO uint32_t WTISR;                             /**< Analog Watchdog Threshold Interrupt Status, offset: 0x30 */
  __IO uint32_t WTIMR;                             /**< Analog Watchdog Threshold Interrupt Enable, offset: 0x34 */
       uint8_t RESERVED_1[8];
  __IO uint32_t DMAE;                              /**< Direct Memory Access Configuration, offset: 0x40 */
  __IO uint32_t DMAR0;                             /**< DMA Request Enable For Precision Inputs, offset: 0x44 */
  __IO uint32_t DMAR1;                             /**< DMA Request Enable For Standard Inputs, offset: 0x48 */
  __IO uint32_t DMAR2;                             /**< DMA Request Enable For External Inputs, offset: 0x4C, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_2[16];
  __IO uint32_t THRHLR[ADC_THRHLR_COUNT];          /**< Analog Watchdog Threshold Values, array offset: 0x60, array step: 0x4 */
       uint8_t RESERVED_3[16];
  __IO uint32_t PSCR;                              /**< Presampling Control, offset: 0x80 */
  __IO uint32_t PSR0;                              /**< Presampling Enable For Precision Inputs, offset: 0x84 */
  __IO uint32_t PSR1;                              /**< Presampling Enable For Standard Inputs, offset: 0x88 */
  __IO uint32_t PSR2;                              /**< Presampling Enable For External Inputs, offset: 0x8C, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_4[4];
  __IO uint32_t CTR0;                              /**< Conversion Timing For Precision Inputs, offset: 0x94 */
  __IO uint32_t CTR1;                              /**< Conversion Timing For Standard Inputs, offset: 0x98 */
  __IO uint32_t CTR2;                              /**< Conversion Timing For External Inputs, offset: 0x9C, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_5[4];
  __IO uint32_t NCMR0;                             /**< Normal Conversion Enable For Precision Inputs, offset: 0xA4 */
  __IO uint32_t NCMR1;                             /**< Normal Conversion Enable For Standard Inputs, offset: 0xA8 */
  __IO uint32_t NCMR2;                             /**< Normal Conversion Enable For External Inputs, offset: 0xAC, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_6[4];
  __IO uint32_t JCMR0;                             /**< Injected Conversion Enable For Precision Inputs, offset: 0xB4 */
  __IO uint32_t JCMR1;                             /**< Injected Conversion Enable For Standard Inputs, offset: 0xB8 */
  __IO uint32_t JCMR2;                             /**< Injected Conversion Enable For External Inputs, offset: 0xBC, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_7[4];
  __IO uint32_t DSDR;                              /**< Delay Start Of Data Conversion, offset: 0xC4, available only on: ADC_0, ADC_1 (missing on ADC_2) */
  __IO uint32_t PDEDR;                             /**< Power Down Exit Delay, offset: 0xC8 */
       uint8_t RESERVED_8[52];
  __I  uint32_t PCDR[ADC_CDR1_COUNT];              /**< Precision Input n Conversion Data, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_9[96];
  __I  uint32_t ICDR[ADC_CDR2_COUNT];              /**< Standard Input n Conversion Data, array offset: 0x180, array step: 0x4 */
       uint8_t RESERVED_10[32];
  __I  uint32_t ECDR[ADC_CDR3_COUNT];              /**< External Input n Conversion Data, array offset: 0x200, array step: 0x4, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_11[48];
  __IO uint32_t CWSELRPI[ADC_CWSELRPI_COUNT];      /**< Channel Analog Watchdog Select For Precision Inputs, array offset: 0x2B0, array step: 0x4 */
       uint8_t RESERVED_12[8];
  __IO uint32_t CWSELRSI[ADC_CWSELRSI_COUNT];      /**< Channel Analog Watchdog Select For Standard Inputs, array offset: 0x2C0, array step: 0x4 */
       uint8_t RESERVED_13[4];
  __IO uint32_t CWSELREI[ADC_CWSELREI_COUNT];      /**< Channel Analog Watchdog Select For External inputs, array offset: 0x2D0, array step: 0x4, available only on: ADC_0, ADC_1 (missing on ADC_2) */
  __IO uint32_t CWENR0;                            /**< Channel Watchdog Enable For Precision Inputs, offset: 0x2E0 */
  __IO uint32_t CWENR1;                            /**< Channel Watchdog Enable For Standard Inputs, offset: 0x2E4 */
  __IO uint32_t CWENR2;                            /**< Channel Watchdog Enable For External Inputs, offset: 0x2E8, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_14[4];
  __IO uint32_t AWORR0;                            /**< Analog Watchdog Out Of Range For Precision Inputs, offset: 0x2F0 */
  __IO uint32_t AWORR1;                            /**< Analog Watchdog Out Of Range For Standard Inputs, offset: 0x2F4 */
  __IO uint32_t AWORR2;                            /**< Analog Watchdog Out Of Range For External Inputs, offset: 0x2F8, available only on: ADC_0, ADC_1 (missing on ADC_2) */
       uint8_t RESERVED_15[68];
  __IO uint32_t STCR1;                             /**< Self-Test Configuration 1, offset: 0x340 */
  __IO uint32_t STCR2;                             /**< Self-Test Configuration 2, offset: 0x344 */
  __IO uint32_t STCR3;                             /**< Self-Test Configuration 3, offset: 0x348 */
  __IO uint32_t STBRR;                             /**< Self-Test Baud Rate, offset: 0x34C */
  __IO uint32_t STSR1;                             /**< Self-Test Status 1, offset: 0x350 */
  __I  uint32_t STSR2;                             /**< Self-Test Status 2, offset: 0x354 */
  __I  uint32_t STSR3;                             /**< Self-Test Status 3, offset: 0x358 */
  __I  uint32_t STSR4;                             /**< Self-Test Status 4, offset: 0x35C */
       uint8_t RESERVED_16[16];
  __I  uint32_t STDR1;                             /**< Self-Test Conversion Data 1, offset: 0x370 */
       uint8_t RESERVED_17[12];
  __IO uint32_t STAW0R;                            /**< Self-Test Analog Watchdog S0, offset: 0x380 */
       uint8_t RESERVED_18[4];
  __IO uint32_t STAW1R;                            /**< Self-Test Analog Watchdog S1, offset: 0x388 */
  __IO uint32_t STAW2R;                            /**< Self-Test Analog Watchdog S2, offset: 0x38C */
       uint8_t RESERVED_19[4];
  __IO uint32_t STAW4R;                            /**< Self-Test Analog Watchdog C0, offset: 0x394 */
  __IO uint32_t STAW5R;                            /**< Self-Test Analog Watchdog C, offset: 0x398 */
  __IO uint32_t AMSIO;                             /**< Analog Miscellaneous In/Out register, offset: 0x39C */
  __IO uint32_t CALBISTREG;                        /**< Control And Calibration Status, offset: 0x3A0 */
       uint8_t RESERVED_20[4];
  __IO uint32_t OFSGNUSR;                          /**< Offset And Gain User, offset: 0x3A8 */
       uint8_t RESERVED_21[8];
  __IO uint32_t CAL2;                              /**< Calibration Value 2, offset: 0x3B4 */
} ADC_Type;

/* ----------------------------------------------------------------------------
   -- ADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Register_Masks ADC Register Masks
 * @{
 */

/*! @name MCR - Main Configuration */
/*! @{ */

