zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_MCR_PWDN_MASK                        (0x1U)
#define ADC_MCR_PWDN_SHIFT                       (0U)
/*! PWDN - Power Down
 *  0b0..ADC enters a functional state
 *  0b1..ADC enters Power Down state
 */
#define ADC_MCR_PWDN(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_PWDN_SHIFT)) & ADC_MCR_PWDN_MASK)

#define ADC_MCR_ADCLKSEL_MASK                    (0x6U)
#define ADC_MCR_ADCLKSEL_SHIFT                   (1U)
/*! ADCLKSEL - Conversion Clock (AD_clk) Frequency Selection
 *  0b00..Module clock frequency
 *  0b01..Module clock frequency / 2
 *  0b10..Module clock frequency / 4
 *  0b11..Module clock frequency / 8
 */
#define ADC_MCR_ADCLKSEL(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_MCR_ADCLKSEL_SHIFT)) & ADC_MCR_ADCLKSEL_MASK)

#define ADC_MCR_ACKO_MASK                        (0x20U)
#define ADC_MCR_ACKO_SHIFT                       (5U)
/*! ACKO - Auto Clock Off
 *  0b0..Clock always active
 *  0b1..Clock gated
 */
#define ADC_MCR_ACKO(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_ACKO_SHIFT)) & ADC_MCR_ACKO_MASK)

#define ADC_MCR_ABORT_MASK                       (0x40U)
#define ADC_MCR_ABORT_SHIFT                      (6U)
/*! ABORT - Abort Conversion
 *  0b0..Conversion continues
 *  0b0..Undefined
 *  0b1..Conversion aborted
 */
#define ADC_MCR_ABORT(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_MCR_ABORT_SHIFT)) & ADC_MCR_ABORT_MASK)

#define ADC_MCR_ABORTCHAIN_MASK                  (0x80U)
#define ADC_MCR_ABORTCHAIN_SHIFT                 (7U)
/*! ABORTCHAIN - Abort Chain
 *  0b0..Conversion continues
 *  0b0..Undefined
 *  0b1..Conversion aborted
 */
#define ADC_MCR_ABORTCHAIN(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_MCR_ABORTCHAIN_SHIFT)) & ADC_MCR_ABORTCHAIN_MASK)

#define ADC_MCR_AVGS_MASK                        (0x600U)
#define ADC_MCR_AVGS_SHIFT                       (9U)
/*! AVGS - Averaging Select
 *  0b00..4 conversions
 *  0b01..8 conversions
 *  0b10..16 conversions
 *  0b11..32 conversions
 */
#define ADC_MCR_AVGS(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_AVGS_SHIFT)) & ADC_MCR_AVGS_MASK)

#define ADC_MCR_AVGEN_MASK                       (0x800U)
#define ADC_MCR_AVGEN_SHIFT                      (11U)
/*! AVGEN - Averaging Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_MCR_AVGEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_MCR_AVGEN_SHIFT)) & ADC_MCR_AVGEN_MASK)

#define ADC_MCR_STCL_MASK                        (0x8000U)
#define ADC_MCR_STCL_SHIFT                       (15U)
/*! STCL - Self-Test Configuration Lock
 *  0b0..Registers are writeable
 *  0b1..Registers are read-only
 */
#define ADC_MCR_STCL(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_STCL_SHIFT)) & ADC_MCR_STCL_MASK)

#define ADC_MCR_BCTU_MODE_MASK                   (0x10000U)
#define ADC_MCR_BCTU_MODE_SHIFT                  (16U)
/*! BCTU_MODE - Body Cross Trigger Unit Mode Select
 *  0b0..Only BCTU can trigger conversion
 *  0b1..All trigger sources can trigger conversion
 */
#define ADC_MCR_BCTU_MODE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_MCR_BCTU_MODE_SHIFT)) & ADC_MCR_BCTU_MODE_MASK)

#define ADC_MCR_BCTUEN_MASK                      (0x20000U)
#define ADC_MCR_BCTUEN_SHIFT                     (17U)
/*! BCTUEN - Body Cross Trigger Unit Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_MCR_BCTUEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MCR_BCTUEN_SHIFT)) & ADC_MCR_BCTUEN_MASK)

#define ADC_MCR_JSTART_MASK                      (0x100000U)
#define ADC_MCR_JSTART_SHIFT                     (20U)
/*! JSTART - Injected Start
 *  0b0..Injected conversion can be started
 *  0b1..Starts an injected conversion
 */
#define ADC_MCR_JSTART(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MCR_JSTART_SHIFT)) & ADC_MCR_JSTART_MASK)

#define ADC_MCR_JEDGE_MASK                       (0x200000U)
#define ADC_MCR_JEDGE_SHIFT                      (21U)
/*! JEDGE - Injected Trigger Edge Selection
 *  0b0..Falling edge
 *  0b1..Rising edge
 */
#define ADC_MCR_JEDGE(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_MCR_JEDGE_SHIFT)) & ADC_MCR_JEDGE_MASK)

#define ADC_MCR_JTRGEN_MASK                      (0x400000U)
#define ADC_MCR_JTRGEN_SHIFT                     (22U)
/*! JTRGEN - Injection Trigger Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_MCR_JTRGEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MCR_JTRGEN_SHIFT)) & ADC_MCR_JTRGEN_MASK)

#define ADC_MCR_NSTART_MASK                      (0x1000000U)
#define ADC_MCR_NSTART_SHIFT                     (24U)
/*! NSTART - Start Normal Conversion
 *  0b0..No effect
 *  0b1..Starts conversion
 */
#define ADC_MCR_NSTART(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MCR_NSTART_SHIFT)) & ADC_MCR_NSTART_MASK)

#define ADC_MCR_XSTRTEN_MASK                     (0x2000000U)
#define ADC_MCR_XSTRTEN_SHIFT                    (25U)
/*! XSTRTEN - Auxiliary External Start Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_MCR_XSTRTEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_MCR_XSTRTEN_SHIFT)) & ADC_MCR_XSTRTEN_MASK)

#define ADC_MCR_EDGE_MASK                        (0x4000000U)
#define ADC_MCR_EDGE_SHIFT                       (26U)
/*! EDGE - External Trigger Edge Selection
 *  0b0..Falling edge
 *  0b1..Rising edge
 */
#define ADC_MCR_EDGE(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_EDGE_SHIFT)) & ADC_MCR_EDGE_MASK)

#define ADC_MCR_TRGEN_MASK                       (0x8000000U)
#define ADC_MCR_TRGEN_SHIFT                      (27U)
/*! TRGEN - External Trigger Enable
 *  0b0..Normal trigger input does not start a conversion
 *  0b1..Normal trigger input starts a conversion
 */
#define ADC_MCR_TRGEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_MCR_TRGEN_SHIFT)) & ADC_MCR_TRGEN_MASK)

#define ADC_MCR_MODE_MASK                        (0x20000000U)
#define ADC_MCR_MODE_SHIFT                       (29U)
/*! MODE - Normal Conversion Mode
 *  0b0..Single conversion
 *  0b1..Continuous conversion
 */
#define ADC_MCR_MODE(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MCR_MODE_SHIFT)) & ADC_MCR_MODE_MASK)

