zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_MCR_WLSIDE_MASK                      (0x40000000U)
#define ADC_MCR_WLSIDE_SHIFT                     (30U)
/*! WLSIDE - Write Left-Aligned
 *  0b0..Right aligned
 *  0b1..Left-aligned
 */
#define ADC_MCR_WLSIDE(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MCR_WLSIDE_SHIFT)) & ADC_MCR_WLSIDE_MASK)

#define ADC_MCR_OWREN_MASK                       (0x80000000U)
#define ADC_MCR_OWREN_SHIFT                      (31U)
/*! OWREN - Overwrite Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_MCR_OWREN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_MCR_OWREN_SHIFT)) & ADC_MCR_OWREN_MASK)
/*! @} */

/*! @name MSR - Main Status */
/*! @{ */

#define ADC_MSR_ADCSTATUS_MASK                   (0x7U)
#define ADC_MSR_ADCSTATUS_SHIFT                  (0U)
/*! ADCSTATUS - ADC State
 *  0b000..Idle
 *  0b001..Power Down
 *  0b010..Wait
 *  0b011..Calibrate
 *  0b100..Convert
 *  0b110..Done
 */
#define ADC_MSR_ADCSTATUS(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_MSR_ADCSTATUS_SHIFT)) & ADC_MSR_ADCSTATUS_MASK)

#define ADC_MSR_ACKO_MASK                        (0x20U)
#define ADC_MSR_ACKO_SHIFT                       (5U)
/*! ACKO - Auto Clock-Off On
 *  0b0..Inactive
 *  0b1..Active
 */
#define ADC_MSR_ACKO(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_MSR_ACKO_SHIFT)) & ADC_MSR_ACKO_MASK)

#define ADC_MSR_CHADDR_MASK                      (0xFE00U)
#define ADC_MSR_CHADDR_SHIFT                     (9U)
/*! CHADDR - Input Under Measure
 *  0b0000000-0b0111111..Input number
 */
#define ADC_MSR_CHADDR(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MSR_CHADDR_SHIFT)) & ADC_MSR_CHADDR_MASK)

#define ADC_MSR_BCTUSTART_MASK                   (0x10000U)
#define ADC_MSR_BCTUSTART_SHIFT                  (16U)
/*! BCTUSTART - BCTU Conversion Started
 *  0b0..Conversion was not triggered by BCTU
 *  0b1..Ongoing conversion was triggered by BCTU
 */
#define ADC_MSR_BCTUSTART(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_MSR_BCTUSTART_SHIFT)) & ADC_MSR_BCTUSTART_MASK)

#define ADC_MSR_SELF_TEST_S_MASK                 (0x40000U)
#define ADC_MSR_SELF_TEST_S_SHIFT                (18U)
/*! SELF_TEST_S
 *  0b0..Not self-test
 *  0b1..Self-test
 */
#define ADC_MSR_SELF_TEST_S(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_MSR_SELF_TEST_S_SHIFT)) & ADC_MSR_SELF_TEST_S_MASK)

#define ADC_MSR_JSTART_MASK                      (0x100000U)
#define ADC_MSR_JSTART_SHIFT                     (20U)
/*! JSTART - Injected Conversion Started
 *  0b0..Not an injected conversion
 *  0b1..Injected conversion
 */
#define ADC_MSR_JSTART(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MSR_JSTART_SHIFT)) & ADC_MSR_JSTART_MASK)

#define ADC_MSR_JABORT_MASK                      (0x800000U)
#define ADC_MSR_JABORT_SHIFT                     (23U)
/*! JABORT - Injected Conversion Aborted
 *  0b0..Not aborted
 *  0b1..Aborted
 */
#define ADC_MSR_JABORT(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MSR_JABORT_SHIFT)) & ADC_MSR_JABORT_MASK)

#define ADC_MSR_NSTART_MASK                      (0x1000000U)
#define ADC_MSR_NSTART_SHIFT                     (24U)
/*! NSTART - Normal Conversion Started
 *  0b0..Not in progress
 *  0b1..In progress
 */
#define ADC_MSR_NSTART(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_MSR_NSTART_SHIFT)) & ADC_MSR_NSTART_MASK)

#define ADC_MSR_CALIBRTD_MASK                    (0x80000000U)
#define ADC_MSR_CALIBRTD_SHIFT                   (31U)
/*! CALIBRTD - Calibration Status
 *  0b0..Uncalibrated or calibration unsuccessful
 *  0b1..Calibrated
 */
#define ADC_MSR_CALIBRTD(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_MSR_CALIBRTD_SHIFT)) & ADC_MSR_CALIBRTD_MASK)
/*! @} */

/*! @name ISR - Interrupt Status */
/*! @{ */

#define ADC_ISR_ECH_MASK                         (0x1U)
#define ADC_ISR_ECH_SHIFT                        (0U)
/*! ECH - End Of Chain Conversion
 *  0b0..Indicates no ECH interrupt generated
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Indicates an ECH interrupt has been generated
 */
#define ADC_ISR_ECH(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ISR_ECH_SHIFT)) & ADC_ISR_ECH_MASK)

#define ADC_ISR_EOC_MASK                         (0x2U)
#define ADC_ISR_EOC_SHIFT                        (1U)
/*! EOC - End Of Conversion
 *  0b0..No EOC interrupt generated
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Interrupt generated
 */
#define ADC_ISR_EOC(x)                           (((uint32_t)(((uint32_t)(x)) << ADC_ISR_EOC_SHIFT)) & ADC_ISR_EOC_MASK)

#define ADC_ISR_JECH_MASK                        (0x4U)
#define ADC_ISR_JECH_SHIFT                       (2U)
/*! JECH - End Of Injected Chain Conversion
 *  0b0..No JECH interrupt generated
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..JECH interrupt generated
 */
#define ADC_ISR_JECH(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_ISR_JECH_SHIFT)) & ADC_ISR_JECH_MASK)

#define ADC_ISR_JEOC_MASK                        (0x8U)
#define ADC_ISR_JEOC_SHIFT                       (3U)
/*! JEOC - End Of Injected Conversion
 *  0b0..No JEOC interrupt generated
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..JEOC interrupt generated
 */
#define ADC_ISR_JEOC(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_ISR_JEOC_SHIFT)) & ADC_ISR_JEOC_MASK)

#define ADC_ISR_EOBCTU_MASK                      (0x10U)
#define ADC_ISR_EOBCTU_SHIFT                     (4U)
/*! EOBCTU - End Of BCTU Conversion
 *  0b0..No EOBCTU interrupt generated
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..EOBCTU interrupt generated
 */
#define ADC_ISR_EOBCTU(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ISR_EOBCTU_SHIFT)) & ADC_ISR_EOBCTU_MASK)
/*! @} */

/*! @name CEOCFR0 - Channel End Of Conversion Flag For Precision Inputs */
/*! @{ */

#define ADC_CEOCFR0_PIEOCF0_MASK                 (0x1U)
#define ADC_CEOCFR0_PIEOCF0_SHIFT                (0U)
/*! PIEOCF0 - Precision Input End Of Conversion Flag 0
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF0_SHIFT)) & ADC_CEOCFR0_PIEOCF0_MASK)

#define ADC_CEOCFR0_PIEOCF1_MASK                 (0x2U)
#define ADC_CEOCFR0_PIEOCF1_SHIFT                (1U)
/*! PIEOCF1 - Precision Input End Of Conversion Flag 1
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF1_SHIFT)) & ADC_CEOCFR0_PIEOCF1_MASK)

#define ADC_CEOCFR0_PIEOCF2_MASK                 (0x4U)
#define ADC_CEOCFR0_PIEOCF2_SHIFT                (2U)
/*! PIEOCF2 - Precision Input End Of Conversion Flag 2
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF2_SHIFT)) & ADC_CEOCFR0_PIEOCF2_MASK)

#define ADC_CEOCFR0_PIEOCF3_MASK                 (0x8U)
#define ADC_CEOCFR0_PIEOCF3_SHIFT                (3U)
/*! PIEOCF3 - Precision Input End Of Conversion Flag 3
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF3_SHIFT)) & ADC_CEOCFR0_PIEOCF3_MASK)

#define ADC_CEOCFR0_PIEOCF4_MASK                 (0x10U)
#define ADC_CEOCFR0_PIEOCF4_SHIFT                (4U)
/*! PIEOCF4 - Precision Input End Of Conversion Flag 4
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF4_SHIFT)) & ADC_CEOCFR0_PIEOCF4_MASK)

#define ADC_CEOCFR0_PIEOCF5_MASK                 (0x20U)
#define ADC_CEOCFR0_PIEOCF5_SHIFT                (5U)
/*! PIEOCF5 - Precision Input End Of Conversion Flag 5
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF5_SHIFT)) & ADC_CEOCFR0_PIEOCF5_MASK)

#define ADC_CEOCFR0_PIEOCF6_MASK                 (0x40U)
#define ADC_CEOCFR0_PIEOCF6_SHIFT                (6U)
/*! PIEOCF6 - Precision Input End Of Conversion Flag 6
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF6_SHIFT)) & ADC_CEOCFR0_PIEOCF6_MASK)

#define ADC_CEOCFR0_PIEOCF7_MASK                 (0x80U)
#define ADC_CEOCFR0_PIEOCF7_SHIFT                (7U)
/*! PIEOCF7 - Precision Input End Of Conversion Flag 7
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR0_PIEOCF7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR0_PIEOCF7_SHIFT)) & ADC_CEOCFR0_PIEOCF7_MASK)
/*! @} */

/*! @name CEOCFR1 - Channel End Of Conversion Flag For Standard Inputs */
/*! @{ */

#define ADC_CEOCFR1_SIEOCF0_MASK                 (0x1U)
#define ADC_CEOCFR1_SIEOCF0_SHIFT                (0U)
/*! SIEOCF0 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF0_SHIFT)) & ADC_CEOCFR1_SIEOCF0_MASK)

#define ADC_CEOCFR1_SIEOCF1_MASK                 (0x2U)
#define ADC_CEOCFR1_SIEOCF1_SHIFT                (1U)
/*! SIEOCF1 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF1_SHIFT)) & ADC_CEOCFR1_SIEOCF1_MASK)

#define ADC_CEOCFR1_SIEOCF2_MASK                 (0x4U)
#define ADC_CEOCFR1_SIEOCF2_SHIFT                (2U)
/*! SIEOCF2 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF2_SHIFT)) & ADC_CEOCFR1_SIEOCF2_MASK)

#define ADC_CEOCFR1_SIEOCF3_MASK                 (0x8U)
#define ADC_CEOCFR1_SIEOCF3_SHIFT                (3U)
/*! SIEOCF3 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF3_SHIFT)) & ADC_CEOCFR1_SIEOCF3_MASK)

#define ADC_CEOCFR1_SIEOCF4_MASK                 (0x10U)
#define ADC_CEOCFR1_SIEOCF4_SHIFT                (4U)
/*! SIEOCF4 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF4_SHIFT)) & ADC_CEOCFR1_SIEOCF4_MASK)

#define ADC_CEOCFR1_SIEOCF5_MASK                 (0x20U)
#define ADC_CEOCFR1_SIEOCF5_SHIFT                (5U)
/*! SIEOCF5 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF5_SHIFT)) & ADC_CEOCFR1_SIEOCF5_MASK)

#define ADC_CEOCFR1_SIEOCF6_MASK                 (0x40U)
#define ADC_CEOCFR1_SIEOCF6_SHIFT                (6U)
/*! SIEOCF6 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF6_SHIFT)) & ADC_CEOCFR1_SIEOCF6_MASK)

#define ADC_CEOCFR1_SIEOCF7_MASK                 (0x80U)
#define ADC_CEOCFR1_SIEOCF7_SHIFT                (7U)
/*! SIEOCF7 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF7_SHIFT)) & ADC_CEOCFR1_SIEOCF7_MASK)

#define ADC_CEOCFR1_SIEOCF8_MASK                 (0x100U)
#define ADC_CEOCFR1_SIEOCF8_SHIFT                (8U)
/*! SIEOCF8 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF8_SHIFT)) & ADC_CEOCFR1_SIEOCF8_MASK)

#define ADC_CEOCFR1_SIEOCF9_MASK                 (0x200U)
#define ADC_CEOCFR1_SIEOCF9_SHIFT                (9U)
/*! SIEOCF9 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF9_SHIFT)) & ADC_CEOCFR1_SIEOCF9_MASK)

#define ADC_CEOCFR1_SIEOCF10_MASK                (0x400U)
#define ADC_CEOCFR1_SIEOCF10_SHIFT               (10U)
/*! SIEOCF10 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF10_SHIFT)) & ADC_CEOCFR1_SIEOCF10_MASK)

