zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CEOCFR1_SIEOCF11_MASK                (0x800U)
#define ADC_CEOCFR1_SIEOCF11_SHIFT               (11U)
/*! SIEOCF11 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF11_SHIFT)) & ADC_CEOCFR1_SIEOCF11_MASK)

#define ADC_CEOCFR1_SIEOCF12_MASK                (0x1000U)
#define ADC_CEOCFR1_SIEOCF12_SHIFT               (12U)
/*! SIEOCF12 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF12_SHIFT)) & ADC_CEOCFR1_SIEOCF12_MASK)

#define ADC_CEOCFR1_SIEOCF13_MASK                (0x2000U)
#define ADC_CEOCFR1_SIEOCF13_SHIFT               (13U)
/*! SIEOCF13 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF13_SHIFT)) & ADC_CEOCFR1_SIEOCF13_MASK)

#define ADC_CEOCFR1_SIEOCF14_MASK                (0x4000U)
#define ADC_CEOCFR1_SIEOCF14_SHIFT               (14U)
/*! SIEOCF14 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF14_SHIFT)) & ADC_CEOCFR1_SIEOCF14_MASK)

#define ADC_CEOCFR1_SIEOCF15_MASK                (0x8000U)
#define ADC_CEOCFR1_SIEOCF15_SHIFT               (15U)
/*! SIEOCF15 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF15_SHIFT)) & ADC_CEOCFR1_SIEOCF15_MASK)

#define ADC_CEOCFR1_SIEOCF16_MASK                (0x10000U)
#define ADC_CEOCFR1_SIEOCF16_SHIFT               (16U)
/*! SIEOCF16 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF16_SHIFT)) & ADC_CEOCFR1_SIEOCF16_MASK)

#define ADC_CEOCFR1_SIEOCF17_MASK                (0x20000U)
#define ADC_CEOCFR1_SIEOCF17_SHIFT               (17U)
/*! SIEOCF17 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF17_SHIFT)) & ADC_CEOCFR1_SIEOCF17_MASK)

#define ADC_CEOCFR1_SIEOCF18_MASK                (0x40000U)
#define ADC_CEOCFR1_SIEOCF18_SHIFT               (18U)
/*! SIEOCF18 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF18_SHIFT)) & ADC_CEOCFR1_SIEOCF18_MASK)

#define ADC_CEOCFR1_SIEOCF19_MASK                (0x80000U)
#define ADC_CEOCFR1_SIEOCF19_SHIFT               (19U)
/*! SIEOCF19 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF19_SHIFT)) & ADC_CEOCFR1_SIEOCF19_MASK)

#define ADC_CEOCFR1_SIEOCF20_MASK                (0x100000U)
#define ADC_CEOCFR1_SIEOCF20_SHIFT               (20U)
/*! SIEOCF20 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF20_SHIFT)) & ADC_CEOCFR1_SIEOCF20_MASK)

#define ADC_CEOCFR1_SIEOCF21_MASK                (0x200000U)
#define ADC_CEOCFR1_SIEOCF21_SHIFT               (21U)
/*! SIEOCF21 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF21_SHIFT)) & ADC_CEOCFR1_SIEOCF21_MASK)

#define ADC_CEOCFR1_SIEOCF22_MASK                (0x400000U)
#define ADC_CEOCFR1_SIEOCF22_SHIFT               (22U)
/*! SIEOCF22 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF22_SHIFT)) & ADC_CEOCFR1_SIEOCF22_MASK)

#define ADC_CEOCFR1_SIEOCF23_MASK                (0x800000U)
#define ADC_CEOCFR1_SIEOCF23_SHIFT               (23U)
/*! SIEOCF23 - Standard Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR1_SIEOCF23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR1_SIEOCF23_SHIFT)) & ADC_CEOCFR1_SIEOCF23_MASK)
/*! @} */

/*! @name CEOCFR2 - Channel End Of Conversion Flag For External Inputs */
/*! @{ */

#define ADC_CEOCFR2_EIEOCF0_MASK                 (0x1U)
#define ADC_CEOCFR2_EIEOCF0_SHIFT                (0U)
/*! EIEOCF0 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF0_SHIFT)) & ADC_CEOCFR2_EIEOCF0_MASK)

#define ADC_CEOCFR2_EIEOCF1_MASK                 (0x2U)
#define ADC_CEOCFR2_EIEOCF1_SHIFT                (1U)
/*! EIEOCF1 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF1_SHIFT)) & ADC_CEOCFR2_EIEOCF1_MASK)

#define ADC_CEOCFR2_EIEOCF2_MASK                 (0x4U)
#define ADC_CEOCFR2_EIEOCF2_SHIFT                (2U)
/*! EIEOCF2 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF2_SHIFT)) & ADC_CEOCFR2_EIEOCF2_MASK)

#define ADC_CEOCFR2_EIEOCF3_MASK                 (0x8U)
#define ADC_CEOCFR2_EIEOCF3_SHIFT                (3U)
/*! EIEOCF3 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF3_SHIFT)) & ADC_CEOCFR2_EIEOCF3_MASK)

