zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CEOCFR2_EIEOCF4_MASK                 (0x10U)
#define ADC_CEOCFR2_EIEOCF4_SHIFT                (4U)
/*! EIEOCF4 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF4_SHIFT)) & ADC_CEOCFR2_EIEOCF4_MASK)

#define ADC_CEOCFR2_EIEOCF5_MASK                 (0x20U)
#define ADC_CEOCFR2_EIEOCF5_SHIFT                (5U)
/*! EIEOCF5 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF5_SHIFT)) & ADC_CEOCFR2_EIEOCF5_MASK)

#define ADC_CEOCFR2_EIEOCF6_MASK                 (0x40U)
#define ADC_CEOCFR2_EIEOCF6_SHIFT                (6U)
/*! EIEOCF6 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF6_SHIFT)) & ADC_CEOCFR2_EIEOCF6_MASK)

#define ADC_CEOCFR2_EIEOCF7_MASK                 (0x80U)
#define ADC_CEOCFR2_EIEOCF7_SHIFT                (7U)
/*! EIEOCF7 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF7_SHIFT)) & ADC_CEOCFR2_EIEOCF7_MASK)

#define ADC_CEOCFR2_EIEOCF8_MASK                 (0x100U)
#define ADC_CEOCFR2_EIEOCF8_SHIFT                (8U)
/*! EIEOCF8 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF8_SHIFT)) & ADC_CEOCFR2_EIEOCF8_MASK)

#define ADC_CEOCFR2_EIEOCF9_MASK                 (0x200U)
#define ADC_CEOCFR2_EIEOCF9_SHIFT                (9U)
/*! EIEOCF9 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF9_SHIFT)) & ADC_CEOCFR2_EIEOCF9_MASK)

#define ADC_CEOCFR2_EIEOCF10_MASK                (0x400U)
#define ADC_CEOCFR2_EIEOCF10_SHIFT               (10U)
/*! EIEOCF10 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF10_SHIFT)) & ADC_CEOCFR2_EIEOCF10_MASK)

#define ADC_CEOCFR2_EIEOCF11_MASK                (0x800U)
#define ADC_CEOCFR2_EIEOCF11_SHIFT               (11U)
/*! EIEOCF11 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF11_SHIFT)) & ADC_CEOCFR2_EIEOCF11_MASK)

#define ADC_CEOCFR2_EIEOCF12_MASK                (0x1000U)
#define ADC_CEOCFR2_EIEOCF12_SHIFT               (12U)
/*! EIEOCF12 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF12_SHIFT)) & ADC_CEOCFR2_EIEOCF12_MASK)

#define ADC_CEOCFR2_EIEOCF13_MASK                (0x2000U)
#define ADC_CEOCFR2_EIEOCF13_SHIFT               (13U)
/*! EIEOCF13 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF13_SHIFT)) & ADC_CEOCFR2_EIEOCF13_MASK)

#define ADC_CEOCFR2_EIEOCF14_MASK                (0x4000U)
#define ADC_CEOCFR2_EIEOCF14_SHIFT               (14U)
/*! EIEOCF14 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF14_SHIFT)) & ADC_CEOCFR2_EIEOCF14_MASK)

#define ADC_CEOCFR2_EIEOCF15_MASK                (0x8000U)
#define ADC_CEOCFR2_EIEOCF15_SHIFT               (15U)
/*! EIEOCF15 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF15_SHIFT)) & ADC_CEOCFR2_EIEOCF15_MASK)

#define ADC_CEOCFR2_EIEOCF16_MASK                (0x10000U)
#define ADC_CEOCFR2_EIEOCF16_SHIFT               (16U)
/*! EIEOCF16 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF16_SHIFT)) & ADC_CEOCFR2_EIEOCF16_MASK)

#define ADC_CEOCFR2_EIEOCF17_MASK                (0x20000U)
#define ADC_CEOCFR2_EIEOCF17_SHIFT               (17U)
/*! EIEOCF17 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF17_SHIFT)) & ADC_CEOCFR2_EIEOCF17_MASK)

#define ADC_CEOCFR2_EIEOCF18_MASK                (0x40000U)
#define ADC_CEOCFR2_EIEOCF18_SHIFT               (18U)
/*! EIEOCF18 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF18_SHIFT)) & ADC_CEOCFR2_EIEOCF18_MASK)

