zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CEOCFR2_EIEOCF19_MASK                (0x80000U)
#define ADC_CEOCFR2_EIEOCF19_SHIFT               (19U)
/*! EIEOCF19 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF19_SHIFT)) & ADC_CEOCFR2_EIEOCF19_MASK)

#define ADC_CEOCFR2_EIEOCF20_MASK                (0x100000U)
#define ADC_CEOCFR2_EIEOCF20_SHIFT               (20U)
/*! EIEOCF20 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF20_SHIFT)) & ADC_CEOCFR2_EIEOCF20_MASK)

#define ADC_CEOCFR2_EIEOCF21_MASK                (0x200000U)
#define ADC_CEOCFR2_EIEOCF21_SHIFT               (21U)
/*! EIEOCF21 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF21_SHIFT)) & ADC_CEOCFR2_EIEOCF21_MASK)

#define ADC_CEOCFR2_EIEOCF22_MASK                (0x400000U)
#define ADC_CEOCFR2_EIEOCF22_SHIFT               (22U)
/*! EIEOCF22 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF22_SHIFT)) & ADC_CEOCFR2_EIEOCF22_MASK)

#define ADC_CEOCFR2_EIEOCF23_MASK                (0x800000U)
#define ADC_CEOCFR2_EIEOCF23_SHIFT               (23U)
/*! EIEOCF23 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF23_SHIFT)) & ADC_CEOCFR2_EIEOCF23_MASK)

#define ADC_CEOCFR2_EIEOCF24_MASK                (0x1000000U)
#define ADC_CEOCFR2_EIEOCF24_SHIFT               (24U)
/*! EIEOCF24 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF24(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF24_SHIFT)) & ADC_CEOCFR2_EIEOCF24_MASK)

#define ADC_CEOCFR2_EIEOCF25_MASK                (0x2000000U)
#define ADC_CEOCFR2_EIEOCF25_SHIFT               (25U)
/*! EIEOCF25 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF25(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF25_SHIFT)) & ADC_CEOCFR2_EIEOCF25_MASK)

#define ADC_CEOCFR2_EIEOCF26_MASK                (0x4000000U)
#define ADC_CEOCFR2_EIEOCF26_SHIFT               (26U)
/*! EIEOCF26 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF26(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF26_SHIFT)) & ADC_CEOCFR2_EIEOCF26_MASK)

#define ADC_CEOCFR2_EIEOCF27_MASK                (0x8000000U)
#define ADC_CEOCFR2_EIEOCF27_SHIFT               (27U)
/*! EIEOCF27 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF27(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF27_SHIFT)) & ADC_CEOCFR2_EIEOCF27_MASK)

#define ADC_CEOCFR2_EIEOCF28_MASK                (0x10000000U)
#define ADC_CEOCFR2_EIEOCF28_SHIFT               (28U)
/*! EIEOCF28 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF28(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF28_SHIFT)) & ADC_CEOCFR2_EIEOCF28_MASK)

#define ADC_CEOCFR2_EIEOCF29_MASK                (0x20000000U)
#define ADC_CEOCFR2_EIEOCF29_SHIFT               (29U)
/*! EIEOCF29 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF29(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF29_SHIFT)) & ADC_CEOCFR2_EIEOCF29_MASK)

#define ADC_CEOCFR2_EIEOCF30_MASK                (0x40000000U)
#define ADC_CEOCFR2_EIEOCF30_SHIFT               (30U)
/*! EIEOCF30 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF30(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF30_SHIFT)) & ADC_CEOCFR2_EIEOCF30_MASK)

#define ADC_CEOCFR2_EIEOCF31_MASK                (0x80000000U)
#define ADC_CEOCFR2_EIEOCF31_SHIFT               (31U)
/*! EIEOCF31 - External Input End Of Conversion Flag
 *  0b0..Conversion not complete
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion complete
 */
#define ADC_CEOCFR2_EIEOCF31(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CEOCFR2_EIEOCF31_SHIFT)) & ADC_CEOCFR2_EIEOCF31_MASK)
/*! @} */

/*! @name IMR - Interrupt Mask */
/*! @{ */

#define ADC_IMR_MSKECH_MASK                      (0x1U)
#define ADC_IMR_MSKECH_SHIFT                     (0U)
/*! MSKECH - ECH Interrupt Flag Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_IMR_MSKECH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_IMR_MSKECH_SHIFT)) & ADC_IMR_MSKECH_MASK)

#define ADC_IMR_MSKEOC_MASK                      (0x2U)
#define ADC_IMR_MSKEOC_SHIFT                     (1U)
/*! MSKEOC - EOC Interrupt Flag Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_IMR_MSKEOC(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_IMR_MSKEOC_SHIFT)) & ADC_IMR_MSKEOC_MASK)

