zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_IMR_MSKJECH_MASK                     (0x4U)
#define ADC_IMR_MSKJECH_SHIFT                    (2U)
/*! MSKJECH - JECH Interrupt Flag Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_IMR_MSKJECH(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_IMR_MSKJECH_SHIFT)) & ADC_IMR_MSKJECH_MASK)

#define ADC_IMR_MSKJEOC_MASK                     (0x8U)
#define ADC_IMR_MSKJEOC_SHIFT                    (3U)
/*! MSKJEOC - JEOC Interrupt Flag Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_IMR_MSKJEOC(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_IMR_MSKJEOC_SHIFT)) & ADC_IMR_MSKJEOC_MASK)

#define ADC_IMR_MSKEOBCTU_MASK                   (0x10U)
#define ADC_IMR_MSKEOBCTU_SHIFT                  (4U)
/*! MSKEOBCTU - EOBCTU Interrupt Flag Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_IMR_MSKEOBCTU(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_IMR_MSKEOBCTU_SHIFT)) & ADC_IMR_MSKEOBCTU_MASK)
/*! @} */

/*! @name CIMR0 - EOC Interrupt Enable For Precision Inputs */
/*! @{ */

#define ADC_CIMR0_PIEOCIEN0_MASK                 (0x1U)
#define ADC_CIMR0_PIEOCIEN0_SHIFT                (0U)
/*! PIEOCIEN0 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN0_SHIFT)) & ADC_CIMR0_PIEOCIEN0_MASK)

#define ADC_CIMR0_PIEOCIEN1_MASK                 (0x2U)
#define ADC_CIMR0_PIEOCIEN1_SHIFT                (1U)
/*! PIEOCIEN1 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN1_SHIFT)) & ADC_CIMR0_PIEOCIEN1_MASK)

#define ADC_CIMR0_PIEOCIEN2_MASK                 (0x4U)
#define ADC_CIMR0_PIEOCIEN2_SHIFT                (2U)
/*! PIEOCIEN2 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN2_SHIFT)) & ADC_CIMR0_PIEOCIEN2_MASK)

#define ADC_CIMR0_PIEOCIEN3_MASK                 (0x8U)
#define ADC_CIMR0_PIEOCIEN3_SHIFT                (3U)
/*! PIEOCIEN3 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN3_SHIFT)) & ADC_CIMR0_PIEOCIEN3_MASK)

#define ADC_CIMR0_PIEOCIEN4_MASK                 (0x10U)
#define ADC_CIMR0_PIEOCIEN4_SHIFT                (4U)
/*! PIEOCIEN4 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN4_SHIFT)) & ADC_CIMR0_PIEOCIEN4_MASK)

#define ADC_CIMR0_PIEOCIEN5_MASK                 (0x20U)
#define ADC_CIMR0_PIEOCIEN5_SHIFT                (5U)
/*! PIEOCIEN5 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN5_SHIFT)) & ADC_CIMR0_PIEOCIEN5_MASK)

#define ADC_CIMR0_PIEOCIEN6_MASK                 (0x40U)
#define ADC_CIMR0_PIEOCIEN6_SHIFT                (6U)
/*! PIEOCIEN6 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN6_SHIFT)) & ADC_CIMR0_PIEOCIEN6_MASK)

#define ADC_CIMR0_PIEOCIEN7_MASK                 (0x80U)
#define ADC_CIMR0_PIEOCIEN7_SHIFT                (7U)
/*! PIEOCIEN7 - Precision Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR0_PIEOCIEN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR0_PIEOCIEN7_SHIFT)) & ADC_CIMR0_PIEOCIEN7_MASK)
/*! @} */

/*! @name CIMR1 - EOC Interrupt Enable For Standard Inputs */
/*! @{ */

#define ADC_CIMR1_SIEOCIEN0_MASK                 (0x1U)
#define ADC_CIMR1_SIEOCIEN0_SHIFT                (0U)
/*! SIEOCIEN0 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN0_SHIFT)) & ADC_CIMR1_SIEOCIEN0_MASK)

#define ADC_CIMR1_SIEOCIEN1_MASK                 (0x2U)
#define ADC_CIMR1_SIEOCIEN1_SHIFT                (1U)
/*! SIEOCIEN1 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN1_SHIFT)) & ADC_CIMR1_SIEOCIEN1_MASK)

#define ADC_CIMR1_SIEOCIEN2_MASK                 (0x4U)
#define ADC_CIMR1_SIEOCIEN2_SHIFT                (2U)
/*! SIEOCIEN2 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN2_SHIFT)) & ADC_CIMR1_SIEOCIEN2_MASK)

#define ADC_CIMR1_SIEOCIEN3_MASK                 (0x8U)
#define ADC_CIMR1_SIEOCIEN3_SHIFT                (3U)
/*! SIEOCIEN3 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN3_SHIFT)) & ADC_CIMR1_SIEOCIEN3_MASK)

#define ADC_CIMR1_SIEOCIEN4_MASK                 (0x10U)
#define ADC_CIMR1_SIEOCIEN4_SHIFT                (4U)
/*! SIEOCIEN4 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN4_SHIFT)) & ADC_CIMR1_SIEOCIEN4_MASK)

