zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CIMR1_SIEOCIEN5_MASK                 (0x20U)
#define ADC_CIMR1_SIEOCIEN5_SHIFT                (5U)
/*! SIEOCIEN5 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN5_SHIFT)) & ADC_CIMR1_SIEOCIEN5_MASK)

#define ADC_CIMR1_SIEOCIEN6_MASK                 (0x40U)
#define ADC_CIMR1_SIEOCIEN6_SHIFT                (6U)
/*! SIEOCIEN6 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN6_SHIFT)) & ADC_CIMR1_SIEOCIEN6_MASK)

#define ADC_CIMR1_SIEOCIEN7_MASK                 (0x80U)
#define ADC_CIMR1_SIEOCIEN7_SHIFT                (7U)
/*! SIEOCIEN7 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN7_SHIFT)) & ADC_CIMR1_SIEOCIEN7_MASK)

#define ADC_CIMR1_SIEOCIEN8_MASK                 (0x100U)
#define ADC_CIMR1_SIEOCIEN8_SHIFT                (8U)
/*! SIEOCIEN8 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN8_SHIFT)) & ADC_CIMR1_SIEOCIEN8_MASK)

#define ADC_CIMR1_SIEOCIEN9_MASK                 (0x200U)
#define ADC_CIMR1_SIEOCIEN9_SHIFT                (9U)
/*! SIEOCIEN9 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN9_SHIFT)) & ADC_CIMR1_SIEOCIEN9_MASK)

#define ADC_CIMR1_SIEOCIEN10_MASK                (0x400U)
#define ADC_CIMR1_SIEOCIEN10_SHIFT               (10U)
/*! SIEOCIEN10 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN10_SHIFT)) & ADC_CIMR1_SIEOCIEN10_MASK)

#define ADC_CIMR1_SIEOCIEN11_MASK                (0x800U)
#define ADC_CIMR1_SIEOCIEN11_SHIFT               (11U)
/*! SIEOCIEN11 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN11_SHIFT)) & ADC_CIMR1_SIEOCIEN11_MASK)

#define ADC_CIMR1_SIEOCIEN12_MASK                (0x1000U)
#define ADC_CIMR1_SIEOCIEN12_SHIFT               (12U)
/*! SIEOCIEN12 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN12_SHIFT)) & ADC_CIMR1_SIEOCIEN12_MASK)

#define ADC_CIMR1_SIEOCIEN13_MASK                (0x2000U)
#define ADC_CIMR1_SIEOCIEN13_SHIFT               (13U)
/*! SIEOCIEN13 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN13_SHIFT)) & ADC_CIMR1_SIEOCIEN13_MASK)

#define ADC_CIMR1_SIEOCIEN14_MASK                (0x4000U)
#define ADC_CIMR1_SIEOCIEN14_SHIFT               (14U)
/*! SIEOCIEN14 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN14_SHIFT)) & ADC_CIMR1_SIEOCIEN14_MASK)

#define ADC_CIMR1_SIEOCIEN15_MASK                (0x8000U)
#define ADC_CIMR1_SIEOCIEN15_SHIFT               (15U)
/*! SIEOCIEN15 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN15_SHIFT)) & ADC_CIMR1_SIEOCIEN15_MASK)

#define ADC_CIMR1_SIEOCIEN16_MASK                (0x10000U)
#define ADC_CIMR1_SIEOCIEN16_SHIFT               (16U)
/*! SIEOCIEN16 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN16_SHIFT)) & ADC_CIMR1_SIEOCIEN16_MASK)

#define ADC_CIMR1_SIEOCIEN17_MASK                (0x20000U)
#define ADC_CIMR1_SIEOCIEN17_SHIFT               (17U)
/*! SIEOCIEN17 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN17_SHIFT)) & ADC_CIMR1_SIEOCIEN17_MASK)

#define ADC_CIMR1_SIEOCIEN18_MASK                (0x40000U)
#define ADC_CIMR1_SIEOCIEN18_SHIFT               (18U)
/*! SIEOCIEN18 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN18_SHIFT)) & ADC_CIMR1_SIEOCIEN18_MASK)

#define ADC_CIMR1_SIEOCIEN19_MASK                (0x80000U)
#define ADC_CIMR1_SIEOCIEN19_SHIFT               (19U)
/*! SIEOCIEN19 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN19_SHIFT)) & ADC_CIMR1_SIEOCIEN19_MASK)

#define ADC_CIMR1_SIEOCIEN20_MASK                (0x100000U)
#define ADC_CIMR1_SIEOCIEN20_SHIFT               (20U)
/*! SIEOCIEN20 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN20_SHIFT)) & ADC_CIMR1_SIEOCIEN20_MASK)

#define ADC_CIMR1_SIEOCIEN21_MASK                (0x200000U)
#define ADC_CIMR1_SIEOCIEN21_SHIFT               (21U)
/*! SIEOCIEN21 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN21_SHIFT)) & ADC_CIMR1_SIEOCIEN21_MASK)

#define ADC_CIMR1_SIEOCIEN22_MASK                (0x400000U)
#define ADC_CIMR1_SIEOCIEN22_SHIFT               (22U)
/*! SIEOCIEN22 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN22_SHIFT)) & ADC_CIMR1_SIEOCIEN22_MASK)

#define ADC_CIMR1_SIEOCIEN23_MASK                (0x800000U)
#define ADC_CIMR1_SIEOCIEN23_SHIFT               (23U)
/*! SIEOCIEN23 - Standard Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR1_SIEOCIEN23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR1_SIEOCIEN23_SHIFT)) & ADC_CIMR1_SIEOCIEN23_MASK)
/*! @} */

/*! @name CIMR2 - EOC Interrupt Enable For External Inputs */
/*! @{ */

#define ADC_CIMR2_EIEOCIEN0_MASK                 (0x1U)
#define ADC_CIMR2_EIEOCIEN0_SHIFT                (0U)
/*! EIEOCIEN0 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN0_SHIFT)) & ADC_CIMR2_EIEOCIEN0_MASK)

#define ADC_CIMR2_EIEOCIEN1_MASK                 (0x2U)
#define ADC_CIMR2_EIEOCIEN1_SHIFT                (1U)
/*! EIEOCIEN1 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN1_SHIFT)) & ADC_CIMR2_EIEOCIEN1_MASK)

