zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CIMR2_EIEOCIEN2_MASK                 (0x4U)
#define ADC_CIMR2_EIEOCIEN2_SHIFT                (2U)
/*! EIEOCIEN2 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN2_SHIFT)) & ADC_CIMR2_EIEOCIEN2_MASK)

#define ADC_CIMR2_EIEOCIEN3_MASK                 (0x8U)
#define ADC_CIMR2_EIEOCIEN3_SHIFT                (3U)
/*! EIEOCIEN3 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN3_SHIFT)) & ADC_CIMR2_EIEOCIEN3_MASK)

#define ADC_CIMR2_EIEOCIEN4_MASK                 (0x10U)
#define ADC_CIMR2_EIEOCIEN4_SHIFT                (4U)
/*! EIEOCIEN4 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN4_SHIFT)) & ADC_CIMR2_EIEOCIEN4_MASK)

#define ADC_CIMR2_EIEOCIEN5_MASK                 (0x20U)
#define ADC_CIMR2_EIEOCIEN5_SHIFT                (5U)
/*! EIEOCIEN5 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN5_SHIFT)) & ADC_CIMR2_EIEOCIEN5_MASK)

#define ADC_CIMR2_EIEOCIEN6_MASK                 (0x40U)
#define ADC_CIMR2_EIEOCIEN6_SHIFT                (6U)
/*! EIEOCIEN6 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN6_SHIFT)) & ADC_CIMR2_EIEOCIEN6_MASK)

#define ADC_CIMR2_EIEOCIEN7_MASK                 (0x80U)
#define ADC_CIMR2_EIEOCIEN7_SHIFT                (7U)
/*! EIEOCIEN7 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN7_SHIFT)) & ADC_CIMR2_EIEOCIEN7_MASK)

#define ADC_CIMR2_EIEOCIEN8_MASK                 (0x100U)
#define ADC_CIMR2_EIEOCIEN8_SHIFT                (8U)
/*! EIEOCIEN8 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN8_SHIFT)) & ADC_CIMR2_EIEOCIEN8_MASK)

#define ADC_CIMR2_EIEOCIEN9_MASK                 (0x200U)
#define ADC_CIMR2_EIEOCIEN9_SHIFT                (9U)
/*! EIEOCIEN9 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN9_SHIFT)) & ADC_CIMR2_EIEOCIEN9_MASK)

#define ADC_CIMR2_EIEOCIEN10_MASK                (0x400U)
#define ADC_CIMR2_EIEOCIEN10_SHIFT               (10U)
/*! EIEOCIEN10 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN10_SHIFT)) & ADC_CIMR2_EIEOCIEN10_MASK)

#define ADC_CIMR2_EIEOCIEN11_MASK                (0x800U)
#define ADC_CIMR2_EIEOCIEN11_SHIFT               (11U)
/*! EIEOCIEN11 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN11_SHIFT)) & ADC_CIMR2_EIEOCIEN11_MASK)

#define ADC_CIMR2_EIEOCIEN12_MASK                (0x1000U)
#define ADC_CIMR2_EIEOCIEN12_SHIFT               (12U)
/*! EIEOCIEN12 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN12_SHIFT)) & ADC_CIMR2_EIEOCIEN12_MASK)

#define ADC_CIMR2_EIEOCIEN13_MASK                (0x2000U)
#define ADC_CIMR2_EIEOCIEN13_SHIFT               (13U)
/*! EIEOCIEN13 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN13_SHIFT)) & ADC_CIMR2_EIEOCIEN13_MASK)

#define ADC_CIMR2_EIEOCIEN14_MASK                (0x4000U)
#define ADC_CIMR2_EIEOCIEN14_SHIFT               (14U)
/*! EIEOCIEN14 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN14_SHIFT)) & ADC_CIMR2_EIEOCIEN14_MASK)

#define ADC_CIMR2_EIEOCIEN15_MASK                (0x8000U)
#define ADC_CIMR2_EIEOCIEN15_SHIFT               (15U)
/*! EIEOCIEN15 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN15_SHIFT)) & ADC_CIMR2_EIEOCIEN15_MASK)

#define ADC_CIMR2_EIEOCIEN16_MASK                (0x10000U)
#define ADC_CIMR2_EIEOCIEN16_SHIFT               (16U)
/*! EIEOCIEN16 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN16_SHIFT)) & ADC_CIMR2_EIEOCIEN16_MASK)

#define ADC_CIMR2_EIEOCIEN17_MASK                (0x20000U)
#define ADC_CIMR2_EIEOCIEN17_SHIFT               (17U)
/*! EIEOCIEN17 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN17_SHIFT)) & ADC_CIMR2_EIEOCIEN17_MASK)

#define ADC_CIMR2_EIEOCIEN18_MASK                (0x40000U)
#define ADC_CIMR2_EIEOCIEN18_SHIFT               (18U)
/*! EIEOCIEN18 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN18_SHIFT)) & ADC_CIMR2_EIEOCIEN18_MASK)

#define ADC_CIMR2_EIEOCIEN19_MASK                (0x80000U)
#define ADC_CIMR2_EIEOCIEN19_SHIFT               (19U)
/*! EIEOCIEN19 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN19_SHIFT)) & ADC_CIMR2_EIEOCIEN19_MASK)

#define ADC_CIMR2_EIEOCIEN20_MASK                (0x100000U)
#define ADC_CIMR2_EIEOCIEN20_SHIFT               (20U)
/*! EIEOCIEN20 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN20_SHIFT)) & ADC_CIMR2_EIEOCIEN20_MASK)

#define ADC_CIMR2_EIEOCIEN21_MASK                (0x200000U)
#define ADC_CIMR2_EIEOCIEN21_SHIFT               (21U)
/*! EIEOCIEN21 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN21_SHIFT)) & ADC_CIMR2_EIEOCIEN21_MASK)

#define ADC_CIMR2_EIEOCIEN22_MASK                (0x400000U)
#define ADC_CIMR2_EIEOCIEN22_SHIFT               (22U)
/*! EIEOCIEN22 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN22_SHIFT)) & ADC_CIMR2_EIEOCIEN22_MASK)

#define ADC_CIMR2_EIEOCIEN23_MASK                (0x800000U)
#define ADC_CIMR2_EIEOCIEN23_SHIFT               (23U)
/*! EIEOCIEN23 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN23_SHIFT)) & ADC_CIMR2_EIEOCIEN23_MASK)

#define ADC_CIMR2_EIEOCIEN24_MASK                (0x1000000U)
#define ADC_CIMR2_EIEOCIEN24_SHIFT               (24U)
/*! EIEOCIEN24 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN24(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN24_SHIFT)) & ADC_CIMR2_EIEOCIEN24_MASK)

#define ADC_CIMR2_EIEOCIEN25_MASK                (0x2000000U)
#define ADC_CIMR2_EIEOCIEN25_SHIFT               (25U)
/*! EIEOCIEN25 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN25(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN25_SHIFT)) & ADC_CIMR2_EIEOCIEN25_MASK)

#define ADC_CIMR2_EIEOCIEN26_MASK                (0x4000000U)
#define ADC_CIMR2_EIEOCIEN26_SHIFT               (26U)
/*! EIEOCIEN26 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN26(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN26_SHIFT)) & ADC_CIMR2_EIEOCIEN26_MASK)

