zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CIMR2_EIEOCIEN27_MASK                (0x8000000U)
#define ADC_CIMR2_EIEOCIEN27_SHIFT               (27U)
/*! EIEOCIEN27 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN27(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN27_SHIFT)) & ADC_CIMR2_EIEOCIEN27_MASK)

#define ADC_CIMR2_EIEOCIEN28_MASK                (0x10000000U)
#define ADC_CIMR2_EIEOCIEN28_SHIFT               (28U)
/*! EIEOCIEN28 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN28(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN28_SHIFT)) & ADC_CIMR2_EIEOCIEN28_MASK)

#define ADC_CIMR2_EIEOCIEN29_MASK                (0x20000000U)
#define ADC_CIMR2_EIEOCIEN29_SHIFT               (29U)
/*! EIEOCIEN29 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN29(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN29_SHIFT)) & ADC_CIMR2_EIEOCIEN29_MASK)

#define ADC_CIMR2_EIEOCIEN30_MASK                (0x40000000U)
#define ADC_CIMR2_EIEOCIEN30_SHIFT               (30U)
/*! EIEOCIEN30 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN30(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN30_SHIFT)) & ADC_CIMR2_EIEOCIEN30_MASK)

#define ADC_CIMR2_EIEOCIEN31_MASK                (0x80000000U)
#define ADC_CIMR2_EIEOCIEN31_SHIFT               (31U)
/*! EIEOCIEN31 - External Input EOC Interrupt Enable
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_CIMR2_EIEOCIEN31(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CIMR2_EIEOCIEN31_SHIFT)) & ADC_CIMR2_EIEOCIEN31_MASK)
/*! @} */

/*! @name WTISR - Analog Watchdog Threshold Interrupt Status */
/*! @{ */

#define ADC_WTISR_LAWIF1_MASK                    (0x1U)
#define ADC_WTISR_LAWIF1_SHIFT                   (0U)
/*! LAWIF1 - Low Analog Watchdog Interrupt Flag 1
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF1_SHIFT)) & ADC_WTISR_LAWIF1_MASK)

#define ADC_WTISR_HAWIF1_MASK                    (0x2U)
#define ADC_WTISR_HAWIF1_SHIFT                   (1U)
/*! HAWIF1 - High Analog Watchdog Interrupt Flag 1
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF1_SHIFT)) & ADC_WTISR_HAWIF1_MASK)

#define ADC_WTISR_LAWIF2_MASK                    (0x4U)
#define ADC_WTISR_LAWIF2_SHIFT                   (2U)
/*! LAWIF2 - Low Analog Watchdog Interrupt Flag 2
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF2_SHIFT)) & ADC_WTISR_LAWIF2_MASK)

#define ADC_WTISR_HAWIF2_MASK                    (0x8U)
#define ADC_WTISR_HAWIF2_SHIFT                   (3U)
/*! HAWIF2 - High Analog Watchdog Interrupt Flag 2
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF2_SHIFT)) & ADC_WTISR_HAWIF2_MASK)

#define ADC_WTISR_LAWIF3_MASK                    (0x10U)
#define ADC_WTISR_LAWIF3_SHIFT                   (4U)
/*! LAWIF3 - Low Analog Watchdog Interrupt Flag 3
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF3(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF3_SHIFT)) & ADC_WTISR_LAWIF3_MASK)

#define ADC_WTISR_HAWIF3_MASK                    (0x20U)
#define ADC_WTISR_HAWIF3_SHIFT                   (5U)
/*! HAWIF3 - High Analog Watchdog Interrupt Flag 3
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF3(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF3_SHIFT)) & ADC_WTISR_HAWIF3_MASK)

#define ADC_WTISR_LAWIF4_MASK                    (0x40U)
#define ADC_WTISR_LAWIF4_SHIFT                   (6U)
/*! LAWIF4 - Low Analog Watchdog Interrupt Flag 4
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF4(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF4_SHIFT)) & ADC_WTISR_LAWIF4_MASK)

#define ADC_WTISR_HAWIF4_MASK                    (0x80U)
#define ADC_WTISR_HAWIF4_SHIFT                   (7U)
/*! HAWIF4 - High Analog Watchdog Interrupt Flag 4
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF4(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF4_SHIFT)) & ADC_WTISR_HAWIF4_MASK)

#define ADC_WTISR_LAWIF5_MASK                    (0x100U)
#define ADC_WTISR_LAWIF5_SHIFT                   (8U)
/*! LAWIF5 - Low Analog Watchdog Interrupt Flag 5
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF5(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF5_SHIFT)) & ADC_WTISR_LAWIF5_MASK)

