zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_WTISR_HAWIF5_MASK                    (0x200U)
#define ADC_WTISR_HAWIF5_SHIFT                   (9U)
/*! HAWIF5 - High Analog Watchdog Interrupt Flag 5
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF5(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF5_SHIFT)) & ADC_WTISR_HAWIF5_MASK)

#define ADC_WTISR_LAWIF6_MASK                    (0x400U)
#define ADC_WTISR_LAWIF6_SHIFT                   (10U)
/*! LAWIF6 - Low Analog Watchdog Interrupt Flag 6
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF6(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF6_SHIFT)) & ADC_WTISR_LAWIF6_MASK)

#define ADC_WTISR_HAWIF6_MASK                    (0x800U)
#define ADC_WTISR_HAWIF6_SHIFT                   (11U)
/*! HAWIF6 - High Analog Watchdog Interrupt Flag 6
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF6(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF6_SHIFT)) & ADC_WTISR_HAWIF6_MASK)

#define ADC_WTISR_LAWIF7_MASK                    (0x1000U)
#define ADC_WTISR_LAWIF7_SHIFT                   (12U)
/*! LAWIF7 - Low Analog Watchdog Interrupt Flag 7
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF7(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF7_SHIFT)) & ADC_WTISR_LAWIF7_MASK)

#define ADC_WTISR_HAWIF7_MASK                    (0x2000U)
#define ADC_WTISR_HAWIF7_SHIFT                   (13U)
/*! HAWIF7 - High Analog Watchdog Interrupt Flag 7
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF7(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF7_SHIFT)) & ADC_WTISR_HAWIF7_MASK)

#define ADC_WTISR_LAWIF8_MASK                    (0x4000U)
#define ADC_WTISR_LAWIF8_SHIFT                   (14U)
/*! LAWIF8 - Low Analog Watchdog Interrupt Flag 8
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF8(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF8_SHIFT)) & ADC_WTISR_LAWIF8_MASK)

#define ADC_WTISR_HAWIF8_MASK                    (0x8000U)
#define ADC_WTISR_HAWIF8_SHIFT                   (15U)
/*! HAWIF8 - High Analog Watchdog Interrupt Flag 8
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF8(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF8_SHIFT)) & ADC_WTISR_HAWIF8_MASK)

#define ADC_WTISR_LAWIF9_MASK                    (0x10000U)
#define ADC_WTISR_LAWIF9_SHIFT                   (16U)
/*! LAWIF9 - Low Analog Watchdog Interrupt Flag 9
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF9(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF9_SHIFT)) & ADC_WTISR_LAWIF9_MASK)

#define ADC_WTISR_HAWIF9_MASK                    (0x20000U)
#define ADC_WTISR_HAWIF9_SHIFT                   (17U)
/*! HAWIF9 - High Analog Watchdog Interrupt Flag 9
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF9(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF9_SHIFT)) & ADC_WTISR_HAWIF9_MASK)

#define ADC_WTISR_LAWIF10_MASK                   (0x40000U)
#define ADC_WTISR_LAWIF10_SHIFT                  (18U)
/*! LAWIF10 - Low Analog Watchdog Interrupt Flag 10
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF10(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF10_SHIFT)) & ADC_WTISR_LAWIF10_MASK)

#define ADC_WTISR_HAWIF10_MASK                   (0x80000U)
#define ADC_WTISR_HAWIF10_SHIFT                  (19U)
/*! HAWIF10 - High Analog Watchdog Interrupt Flag 10
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF10(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF10_SHIFT)) & ADC_WTISR_HAWIF10_MASK)

#define ADC_WTISR_LAWIF11_MASK                   (0x100000U)
#define ADC_WTISR_LAWIF11_SHIFT                  (20U)
/*! LAWIF11 - Low Analog Watchdog Interrupt Flag 11
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF11(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF11_SHIFT)) & ADC_WTISR_LAWIF11_MASK)

#define ADC_WTISR_HAWIF11_MASK                   (0x200000U)
#define ADC_WTISR_HAWIF11_SHIFT                  (21U)
/*! HAWIF11 - High Analog Watchdog Interrupt Flag 11
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF11(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF11_SHIFT)) & ADC_WTISR_HAWIF11_MASK)

#define ADC_WTISR_LAWIF12_MASK                   (0x400000U)
#define ADC_WTISR_LAWIF12_SHIFT                  (22U)
/*! LAWIF12 - Low Analog Watchdog Interrupt Flag 12
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF12(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF12_SHIFT)) & ADC_WTISR_LAWIF12_MASK)

#define ADC_WTISR_HAWIF12_MASK                   (0x800000U)
#define ADC_WTISR_HAWIF12_SHIFT                  (23U)
/*! HAWIF12 - High Analog Watchdog Interrupt Flag 12
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF12(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF12_SHIFT)) & ADC_WTISR_HAWIF12_MASK)

#define ADC_WTISR_LAWIF13_MASK                   (0x1000000U)
#define ADC_WTISR_LAWIF13_SHIFT                  (24U)
/*! LAWIF13 - Low Analog Watchdog Interrupt Flag 13
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF13(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF13_SHIFT)) & ADC_WTISR_LAWIF13_MASK)

#define ADC_WTISR_HAWIF13_MASK                   (0x2000000U)
#define ADC_WTISR_HAWIF13_SHIFT                  (25U)
/*! HAWIF13 - High Analog Watchdog Interrupt Flag 13
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF13(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF13_SHIFT)) & ADC_WTISR_HAWIF13_MASK)

#define ADC_WTISR_LAWIF14_MASK                   (0x4000000U)
#define ADC_WTISR_LAWIF14_SHIFT                  (26U)
/*! LAWIF14 - Low Analog Watchdog Interrupt Flag 14
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF14(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF14_SHIFT)) & ADC_WTISR_LAWIF14_MASK)

#define ADC_WTISR_HAWIF14_MASK                   (0x8000000U)
#define ADC_WTISR_HAWIF14_SHIFT                  (27U)
/*! HAWIF14 - High Analog Watchdog Interrupt Flag 14
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF14(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF14_SHIFT)) & ADC_WTISR_HAWIF14_MASK)

#define ADC_WTISR_LAWIF15_MASK                   (0x10000000U)
#define ADC_WTISR_LAWIF15_SHIFT                  (28U)
/*! LAWIF15 - Low Analog Watchdog Interrupt Flag 15
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF15(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF15_SHIFT)) & ADC_WTISR_LAWIF15_MASK)

#define ADC_WTISR_HAWIF15_MASK                   (0x20000000U)
#define ADC_WTISR_HAWIF15_SHIFT                  (29U)
/*! HAWIF15 - High Analog Watchdog Interrupt Flag 15
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF15(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF15_SHIFT)) & ADC_WTISR_HAWIF15_MASK)

#define ADC_WTISR_LAWIF16_MASK                   (0x40000000U)
#define ADC_WTISR_LAWIF16_SHIFT                  (30U)
/*! LAWIF16 - Low Analog Watchdog Interrupt Flag 16
 *  0b0..Conversion result is greater than the specified low threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is lower than the specified low threshold
 */
#define ADC_WTISR_LAWIF16(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_LAWIF16_SHIFT)) & ADC_WTISR_LAWIF16_MASK)

