zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_WTISR_HAWIF16_MASK                   (0x80000000U)
#define ADC_WTISR_HAWIF16_SHIFT                  (31U)
/*! HAWIF16 - High Analog Watchdog Interrupt Flag 16
 *  0b0..Conversion result is lower than the specified high threshold
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion result is higher than the specified high threshold
 */
#define ADC_WTISR_HAWIF16(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_WTISR_HAWIF16_SHIFT)) & ADC_WTISR_HAWIF16_MASK)
/*! @} */

/*! @name WTIMR - Analog Watchdog Threshold Interrupt Enable */
/*! @{ */

#define ADC_WTIMR_LAWIFEN1_MASK                  (0x1U)
#define ADC_WTIMR_LAWIFEN1_SHIFT                 (0U)
/*! LAWIFEN1 - Low Analog Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_LAWIFEN1(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_LAWIFEN1_SHIFT)) & ADC_WTIMR_LAWIFEN1_MASK)

#define ADC_WTIMR_HDWIFEN1_MASK                  (0x2U)
#define ADC_WTIMR_HDWIFEN1_SHIFT                 (1U)
/*! HDWIFEN1 - High Data Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_HDWIFEN1(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_HDWIFEN1_SHIFT)) & ADC_WTIMR_HDWIFEN1_MASK)

#define ADC_WTIMR_LAWIFEN2_MASK                  (0x4U)
#define ADC_WTIMR_LAWIFEN2_SHIFT                 (2U)
/*! LAWIFEN2 - Low Analog Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_LAWIFEN2(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_LAWIFEN2_SHIFT)) & ADC_WTIMR_LAWIFEN2_MASK)

#define ADC_WTIMR_HDWIFEN2_MASK                  (0x8U)
#define ADC_WTIMR_HDWIFEN2_SHIFT                 (3U)
/*! HDWIFEN2 - High Data Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_HDWIFEN2(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_HDWIFEN2_SHIFT)) & ADC_WTIMR_HDWIFEN2_MASK)

#define ADC_WTIMR_LAWIFEN3_MASK                  (0x10U)
#define ADC_WTIMR_LAWIFEN3_SHIFT                 (4U)
/*! LAWIFEN3 - Low Analog Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_LAWIFEN3(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_LAWIFEN3_SHIFT)) & ADC_WTIMR_LAWIFEN3_MASK)

#define ADC_WTIMR_HDWIFEN3_MASK                  (0x20U)
#define ADC_WTIMR_HDWIFEN3_SHIFT                 (5U)
/*! HDWIFEN3 - High Data Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_HDWIFEN3(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_HDWIFEN3_SHIFT)) & ADC_WTIMR_HDWIFEN3_MASK)

#define ADC_WTIMR_LAWIFEN4_MASK                  (0x40U)
#define ADC_WTIMR_LAWIFEN4_SHIFT                 (6U)
/*! LAWIFEN4 - Low Analog Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_LAWIFEN4(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_LAWIFEN4_SHIFT)) & ADC_WTIMR_LAWIFEN4_MASK)

#define ADC_WTIMR_HDWIFEN4_MASK                  (0x80U)
#define ADC_WTIMR_HDWIFEN4_SHIFT                 (7U)
/*! HDWIFEN4 - High Data Watchdog Interrupt Flag Enable n
 *  0b0..Interrupt is not flagged
 *  0b1..Interrupt is flagged
 */
#define ADC_WTIMR_HDWIFEN4(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_WTIMR_HDWIFEN4_SHIFT)) & ADC_WTIMR_HDWIFEN4_MASK)
/*! @} */

/*! @name DMAE - Direct Memory Access Configuration */
/*! @{ */

#define ADC_DMAE_DMAEN_MASK                      (0x1U)
#define ADC_DMAE_DMAEN_SHIFT                     (0U)
/*! DMAEN - DMA Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_DMAE_DMAEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_DMAE_DMAEN_SHIFT)) & ADC_DMAE_DMAEN_MASK)

#define ADC_DMAE_DCLR_MASK                       (0x2U)
#define ADC_DMAE_DCLR_SHIFT                      (1U)
/*! DCLR - DMA Clear Request
 *  0b0..DMA controller acknowledges the request
 *  0b1..Conversion data register is read
 */
#define ADC_DMAE_DCLR(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_DMAE_DCLR_SHIFT)) & ADC_DMAE_DCLR_MASK)
/*! @} */

/*! @name DMAR0 - DMA Request Enable For Precision Inputs */
/*! @{ */

#define ADC_DMAR0_PIDMAREN0_MASK                 (0x1U)
#define ADC_DMAR0_PIDMAREN0_SHIFT                (0U)
/*! PIDMAREN0 - Precision Input DMA Request Enable 0
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN0_SHIFT)) & ADC_DMAR0_PIDMAREN0_MASK)

#define ADC_DMAR0_PIDMAREN1_MASK                 (0x2U)
#define ADC_DMAR0_PIDMAREN1_SHIFT                (1U)
/*! PIDMAREN1 - Precision Input DMA Request Enable 1
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN1_SHIFT)) & ADC_DMAR0_PIDMAREN1_MASK)

#define ADC_DMAR0_PIDMAREN2_MASK                 (0x4U)
#define ADC_DMAR0_PIDMAREN2_SHIFT                (2U)
/*! PIDMAREN2 - Precision Input DMA Request Enable 2
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN2_SHIFT)) & ADC_DMAR0_PIDMAREN2_MASK)

#define ADC_DMAR0_PIDMAREN3_MASK                 (0x8U)
#define ADC_DMAR0_PIDMAREN3_SHIFT                (3U)
/*! PIDMAREN3 - Precision Input DMA Request Enable 3
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN3_SHIFT)) & ADC_DMAR0_PIDMAREN3_MASK)

#define ADC_DMAR0_PIDMAREN4_MASK                 (0x10U)
#define ADC_DMAR0_PIDMAREN4_SHIFT                (4U)
/*! PIDMAREN4 - Precision Input DMA Request Enable 4
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN4_SHIFT)) & ADC_DMAR0_PIDMAREN4_MASK)

#define ADC_DMAR0_PIDMAREN5_MASK                 (0x20U)
#define ADC_DMAR0_PIDMAREN5_SHIFT                (5U)
/*! PIDMAREN5 - Precision Input DMA Request Enable 5
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN5_SHIFT)) & ADC_DMAR0_PIDMAREN5_MASK)

#define ADC_DMAR0_PIDMAREN6_MASK                 (0x40U)
#define ADC_DMAR0_PIDMAREN6_SHIFT                (6U)
/*! PIDMAREN6 - Precision Input DMA Request Enable 6
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN6_SHIFT)) & ADC_DMAR0_PIDMAREN6_MASK)

#define ADC_DMAR0_PIDMAREN7_MASK                 (0x80U)
#define ADC_DMAR0_PIDMAREN7_SHIFT                (7U)
/*! PIDMAREN7 - Precision Input DMA Request Enable 7
 *  0b0..Not triggered
 *  0b1..Triggered
 */
#define ADC_DMAR0_PIDMAREN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR0_PIDMAREN7_SHIFT)) & ADC_DMAR0_PIDMAREN7_MASK)
/*! @} */

