zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*! @name DMAR1 - DMA Request Enable For Standard Inputs */
/*! @{ */

#define ADC_DMAR1_SIDMAREN0_MASK                 (0x1U)
#define ADC_DMAR1_SIDMAREN0_SHIFT                (0U)
/*! SIDMAREN0 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN0_SHIFT)) & ADC_DMAR1_SIDMAREN0_MASK)

#define ADC_DMAR1_SIDMAREN1_MASK                 (0x2U)
#define ADC_DMAR1_SIDMAREN1_SHIFT                (1U)
/*! SIDMAREN1 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN1_SHIFT)) & ADC_DMAR1_SIDMAREN1_MASK)

#define ADC_DMAR1_SIDMAREN2_MASK                 (0x4U)
#define ADC_DMAR1_SIDMAREN2_SHIFT                (2U)
/*! SIDMAREN2 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN2_SHIFT)) & ADC_DMAR1_SIDMAREN2_MASK)

#define ADC_DMAR1_SIDMAREN3_MASK                 (0x8U)
#define ADC_DMAR1_SIDMAREN3_SHIFT                (3U)
/*! SIDMAREN3 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN3_SHIFT)) & ADC_DMAR1_SIDMAREN3_MASK)

#define ADC_DMAR1_SIDMAREN4_MASK                 (0x10U)
#define ADC_DMAR1_SIDMAREN4_SHIFT                (4U)
/*! SIDMAREN4 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN4_SHIFT)) & ADC_DMAR1_SIDMAREN4_MASK)

#define ADC_DMAR1_SIDMAREN5_MASK                 (0x20U)
#define ADC_DMAR1_SIDMAREN5_SHIFT                (5U)
/*! SIDMAREN5 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN5_SHIFT)) & ADC_DMAR1_SIDMAREN5_MASK)

#define ADC_DMAR1_SIDMAREN6_MASK                 (0x40U)
#define ADC_DMAR1_SIDMAREN6_SHIFT                (6U)
/*! SIDMAREN6 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN6_SHIFT)) & ADC_DMAR1_SIDMAREN6_MASK)

#define ADC_DMAR1_SIDMAREN7_MASK                 (0x80U)
#define ADC_DMAR1_SIDMAREN7_SHIFT                (7U)
/*! SIDMAREN7 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN7_SHIFT)) & ADC_DMAR1_SIDMAREN7_MASK)

#define ADC_DMAR1_SIDMAREN8_MASK                 (0x100U)
#define ADC_DMAR1_SIDMAREN8_SHIFT                (8U)
/*! SIDMAREN8 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN8_SHIFT)) & ADC_DMAR1_SIDMAREN8_MASK)

#define ADC_DMAR1_SIDMAREN9_MASK                 (0x200U)
#define ADC_DMAR1_SIDMAREN9_SHIFT                (9U)
/*! SIDMAREN9 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN9_SHIFT)) & ADC_DMAR1_SIDMAREN9_MASK)

#define ADC_DMAR1_SIDMAREN10_MASK                (0x400U)
#define ADC_DMAR1_SIDMAREN10_SHIFT               (10U)
/*! SIDMAREN10 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN10_SHIFT)) & ADC_DMAR1_SIDMAREN10_MASK)

#define ADC_DMAR1_SIDMAREN11_MASK                (0x800U)
#define ADC_DMAR1_SIDMAREN11_SHIFT               (11U)
/*! SIDMAREN11 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN11_SHIFT)) & ADC_DMAR1_SIDMAREN11_MASK)

#define ADC_DMAR1_SIDMAREN12_MASK                (0x1000U)
#define ADC_DMAR1_SIDMAREN12_SHIFT               (12U)
/*! SIDMAREN12 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN12_SHIFT)) & ADC_DMAR1_SIDMAREN12_MASK)

#define ADC_DMAR1_SIDMAREN13_MASK                (0x2000U)
#define ADC_DMAR1_SIDMAREN13_SHIFT               (13U)
/*! SIDMAREN13 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN13_SHIFT)) & ADC_DMAR1_SIDMAREN13_MASK)

#define ADC_DMAR1_SIDMAREN14_MASK                (0x4000U)
#define ADC_DMAR1_SIDMAREN14_SHIFT               (14U)
/*! SIDMAREN14 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN14_SHIFT)) & ADC_DMAR1_SIDMAREN14_MASK)

#define ADC_DMAR1_SIDMAREN15_MASK                (0x8000U)
#define ADC_DMAR1_SIDMAREN15_SHIFT               (15U)
/*! SIDMAREN15 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN15_SHIFT)) & ADC_DMAR1_SIDMAREN15_MASK)

#define ADC_DMAR1_SIDMAREN16_MASK                (0x10000U)
#define ADC_DMAR1_SIDMAREN16_SHIFT               (16U)
/*! SIDMAREN16 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN16_SHIFT)) & ADC_DMAR1_SIDMAREN16_MASK)

#define ADC_DMAR1_SIDMAREN17_MASK                (0x20000U)
#define ADC_DMAR1_SIDMAREN17_SHIFT               (17U)
/*! SIDMAREN17 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN17_SHIFT)) & ADC_DMAR1_SIDMAREN17_MASK)

#define ADC_DMAR1_SIDMAREN18_MASK                (0x40000U)
#define ADC_DMAR1_SIDMAREN18_SHIFT               (18U)
/*! SIDMAREN18 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN18_SHIFT)) & ADC_DMAR1_SIDMAREN18_MASK)

#define ADC_DMAR1_SIDMAREN19_MASK                (0x80000U)
#define ADC_DMAR1_SIDMAREN19_SHIFT               (19U)
/*! SIDMAREN19 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN19_SHIFT)) & ADC_DMAR1_SIDMAREN19_MASK)

