zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_DMAR1_SIDMAREN20_MASK                (0x100000U)
#define ADC_DMAR1_SIDMAREN20_SHIFT               (20U)
/*! SIDMAREN20 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN20_SHIFT)) & ADC_DMAR1_SIDMAREN20_MASK)

#define ADC_DMAR1_SIDMAREN21_MASK                (0x200000U)
#define ADC_DMAR1_SIDMAREN21_SHIFT               (21U)
/*! SIDMAREN21 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN21_SHIFT)) & ADC_DMAR1_SIDMAREN21_MASK)

#define ADC_DMAR1_SIDMAREN22_MASK                (0x400000U)
#define ADC_DMAR1_SIDMAREN22_SHIFT               (22U)
/*! SIDMAREN22 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN22_SHIFT)) & ADC_DMAR1_SIDMAREN22_MASK)

#define ADC_DMAR1_SIDMAREN23_MASK                (0x800000U)
#define ADC_DMAR1_SIDMAREN23_SHIFT               (23U)
/*! SIDMAREN23 - Standard Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA is request triggered
 */
#define ADC_DMAR1_SIDMAREN23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR1_SIDMAREN23_SHIFT)) & ADC_DMAR1_SIDMAREN23_MASK)
/*! @} */

/*! @name DMAR2 - DMA Request Enable For External Inputs */
/*! @{ */

#define ADC_DMAR2_EIDMAREN0_MASK                 (0x1U)
#define ADC_DMAR2_EIDMAREN0_SHIFT                (0U)
/*! EIDMAREN0 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN0_SHIFT)) & ADC_DMAR2_EIDMAREN0_MASK)

#define ADC_DMAR2_EIDMAREN1_MASK                 (0x2U)
#define ADC_DMAR2_EIDMAREN1_SHIFT                (1U)
/*! EIDMAREN1 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN1_SHIFT)) & ADC_DMAR2_EIDMAREN1_MASK)

#define ADC_DMAR2_EIDMAREN2_MASK                 (0x4U)
#define ADC_DMAR2_EIDMAREN2_SHIFT                (2U)
/*! EIDMAREN2 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN2_SHIFT)) & ADC_DMAR2_EIDMAREN2_MASK)

#define ADC_DMAR2_EIDMAREN3_MASK                 (0x8U)
#define ADC_DMAR2_EIDMAREN3_SHIFT                (3U)
/*! EIDMAREN3 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN3_SHIFT)) & ADC_DMAR2_EIDMAREN3_MASK)

#define ADC_DMAR2_EIDMAREN4_MASK                 (0x10U)
#define ADC_DMAR2_EIDMAREN4_SHIFT                (4U)
/*! EIDMAREN4 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN4_SHIFT)) & ADC_DMAR2_EIDMAREN4_MASK)

#define ADC_DMAR2_EIDMAREN5_MASK                 (0x20U)
#define ADC_DMAR2_EIDMAREN5_SHIFT                (5U)
/*! EIDMAREN5 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN5_SHIFT)) & ADC_DMAR2_EIDMAREN5_MASK)

#define ADC_DMAR2_EIDMAREN6_MASK                 (0x40U)
#define ADC_DMAR2_EIDMAREN6_SHIFT                (6U)
/*! EIDMAREN6 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN6_SHIFT)) & ADC_DMAR2_EIDMAREN6_MASK)

#define ADC_DMAR2_EIDMAREN7_MASK                 (0x80U)
#define ADC_DMAR2_EIDMAREN7_SHIFT                (7U)
/*! EIDMAREN7 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN7_SHIFT)) & ADC_DMAR2_EIDMAREN7_MASK)

#define ADC_DMAR2_EIDMAREN8_MASK                 (0x100U)
#define ADC_DMAR2_EIDMAREN8_SHIFT                (8U)
/*! EIDMAREN8 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN8_SHIFT)) & ADC_DMAR2_EIDMAREN8_MASK)

#define ADC_DMAR2_EIDMAREN9_MASK                 (0x200U)
#define ADC_DMAR2_EIDMAREN9_SHIFT                (9U)
/*! EIDMAREN9 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN9_SHIFT)) & ADC_DMAR2_EIDMAREN9_MASK)

#define ADC_DMAR2_EIDMAREN10_MASK                (0x400U)
#define ADC_DMAR2_EIDMAREN10_SHIFT               (10U)
/*! EIDMAREN10 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN10_SHIFT)) & ADC_DMAR2_EIDMAREN10_MASK)

#define ADC_DMAR2_EIDMAREN11_MASK                (0x800U)
#define ADC_DMAR2_EIDMAREN11_SHIFT               (11U)
/*! EIDMAREN11 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN11_SHIFT)) & ADC_DMAR2_EIDMAREN11_MASK)

#define ADC_DMAR2_EIDMAREN12_MASK                (0x1000U)
#define ADC_DMAR2_EIDMAREN12_SHIFT               (12U)
/*! EIDMAREN12 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN12_SHIFT)) & ADC_DMAR2_EIDMAREN12_MASK)

