zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_DMAR2_EIDMAREN13_MASK                (0x2000U)
#define ADC_DMAR2_EIDMAREN13_SHIFT               (13U)
/*! EIDMAREN13 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN13_SHIFT)) & ADC_DMAR2_EIDMAREN13_MASK)

#define ADC_DMAR2_EIDMAREN14_MASK                (0x4000U)
#define ADC_DMAR2_EIDMAREN14_SHIFT               (14U)
/*! EIDMAREN14 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN14_SHIFT)) & ADC_DMAR2_EIDMAREN14_MASK)

#define ADC_DMAR2_EIDMAREN15_MASK                (0x8000U)
#define ADC_DMAR2_EIDMAREN15_SHIFT               (15U)
/*! EIDMAREN15 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN15_SHIFT)) & ADC_DMAR2_EIDMAREN15_MASK)

#define ADC_DMAR2_EIDMAREN16_MASK                (0x10000U)
#define ADC_DMAR2_EIDMAREN16_SHIFT               (16U)
/*! EIDMAREN16 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN16_SHIFT)) & ADC_DMAR2_EIDMAREN16_MASK)

#define ADC_DMAR2_EIDMAREN17_MASK                (0x20000U)
#define ADC_DMAR2_EIDMAREN17_SHIFT               (17U)
/*! EIDMAREN17 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN17_SHIFT)) & ADC_DMAR2_EIDMAREN17_MASK)

#define ADC_DMAR2_EIDMAREN18_MASK                (0x40000U)
#define ADC_DMAR2_EIDMAREN18_SHIFT               (18U)
/*! EIDMAREN18 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN18_SHIFT)) & ADC_DMAR2_EIDMAREN18_MASK)

#define ADC_DMAR2_EIDMAREN19_MASK                (0x80000U)
#define ADC_DMAR2_EIDMAREN19_SHIFT               (19U)
/*! EIDMAREN19 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN19_SHIFT)) & ADC_DMAR2_EIDMAREN19_MASK)

#define ADC_DMAR2_EIDMAREN20_MASK                (0x100000U)
#define ADC_DMAR2_EIDMAREN20_SHIFT               (20U)
/*! EIDMAREN20 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN20_SHIFT)) & ADC_DMAR2_EIDMAREN20_MASK)

#define ADC_DMAR2_EIDMAREN21_MASK                (0x200000U)
#define ADC_DMAR2_EIDMAREN21_SHIFT               (21U)
/*! EIDMAREN21 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN21_SHIFT)) & ADC_DMAR2_EIDMAREN21_MASK)

#define ADC_DMAR2_EIDMAREN22_MASK                (0x400000U)
#define ADC_DMAR2_EIDMAREN22_SHIFT               (22U)
/*! EIDMAREN22 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN22_SHIFT)) & ADC_DMAR2_EIDMAREN22_MASK)

#define ADC_DMAR2_EIDMAREN23_MASK                (0x800000U)
#define ADC_DMAR2_EIDMAREN23_SHIFT               (23U)
/*! EIDMAREN23 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN23_SHIFT)) & ADC_DMAR2_EIDMAREN23_MASK)

#define ADC_DMAR2_EIDMAREN24_MASK                (0x1000000U)
#define ADC_DMAR2_EIDMAREN24_SHIFT               (24U)
/*! EIDMAREN24 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN24(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN24_SHIFT)) & ADC_DMAR2_EIDMAREN24_MASK)

#define ADC_DMAR2_EIDMAREN25_MASK                (0x2000000U)
#define ADC_DMAR2_EIDMAREN25_SHIFT               (25U)
/*! EIDMAREN25 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN25(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN25_SHIFT)) & ADC_DMAR2_EIDMAREN25_MASK)

#define ADC_DMAR2_EIDMAREN26_MASK                (0x4000000U)
#define ADC_DMAR2_EIDMAREN26_SHIFT               (26U)
/*! EIDMAREN26 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN26(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN26_SHIFT)) & ADC_DMAR2_EIDMAREN26_MASK)

#define ADC_DMAR2_EIDMAREN27_MASK                (0x8000000U)
#define ADC_DMAR2_EIDMAREN27_SHIFT               (27U)
/*! EIDMAREN27 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN27(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN27_SHIFT)) & ADC_DMAR2_EIDMAREN27_MASK)

#define ADC_DMAR2_EIDMAREN28_MASK                (0x10000000U)
#define ADC_DMAR2_EIDMAREN28_SHIFT               (28U)
/*! EIDMAREN28 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN28(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN28_SHIFT)) & ADC_DMAR2_EIDMAREN28_MASK)

#define ADC_DMAR2_EIDMAREN29_MASK                (0x20000000U)
#define ADC_DMAR2_EIDMAREN29_SHIFT               (29U)
/*! EIDMAREN29 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN29(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN29_SHIFT)) & ADC_DMAR2_EIDMAREN29_MASK)

#define ADC_DMAR2_EIDMAREN30_MASK                (0x40000000U)
#define ADC_DMAR2_EIDMAREN30_SHIFT               (30U)
/*! EIDMAREN30 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN30(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN30_SHIFT)) & ADC_DMAR2_EIDMAREN30_MASK)

