zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_DMAR2_EIDMAREN31_MASK                (0x80000000U)
#define ADC_DMAR2_EIDMAREN31_SHIFT               (31U)
/*! EIDMAREN31 - External Input DMA Request Enable n
 *  0b0..DMA request is not triggered
 *  0b1..DMA request is triggered
 */
#define ADC_DMAR2_EIDMAREN31(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_DMAR2_EIDMAREN31_SHIFT)) & ADC_DMAR2_EIDMAREN31_MASK)
/*! @} */

/*! @name THRHLR - Analog Watchdog Threshold Values */
/*! @{ */

#define ADC_THRHLR_THRL_MASK                     (0x7FFFU)
#define ADC_THRHLR_THRL_SHIFT                    (0U)
/*! THRL - Low Threshold Value */
#define ADC_THRHLR_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_THRHLR_THRL_SHIFT)) & ADC_THRHLR_THRL_MASK)

#define ADC_THRHLR_THRH_MASK                     (0x7FFF0000U)
#define ADC_THRHLR_THRH_SHIFT                    (16U)
/*! THRH - High Threshold Value */
#define ADC_THRHLR_THRH(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_THRHLR_THRH_SHIFT)) & ADC_THRHLR_THRH_MASK)
/*! @} */

/*! @name PSCR - Presampling Control */
/*! @{ */

#define ADC_PSCR_PRECONV_MASK                    (0x1U)
#define ADC_PSCR_PRECONV_SHIFT                   (0U)
/*! PRECONV - Convert Presampled Value
 *  0b0..No conversion after presampling
 *  0b1..Presampling is followed by conversion
 */
#define ADC_PSCR_PRECONV(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_PSCR_PRECONV_SHIFT)) & ADC_PSCR_PRECONV_MASK)

#define ADC_PSCR_PREVAL0_MASK                    (0x2U)
#define ADC_PSCR_PREVAL0_SHIFT                   (1U)
/*! PREVAL0 - Presampling Voltage Select For Precision Inputs
 *  0b0..VREFL
 *  0b1..VREFH
 */
#define ADC_PSCR_PREVAL0(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_PSCR_PREVAL0_SHIFT)) & ADC_PSCR_PREVAL0_MASK)

#define ADC_PSCR_PREVAL1_MASK                    (0x8U)
#define ADC_PSCR_PREVAL1_SHIFT                   (3U)
/*! PREVAL1 - Presampling Voltage Select For Standard Inputs
 *  0b0..VREFL
 *  0b1..VREFH
 */
#define ADC_PSCR_PREVAL1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_PSCR_PREVAL1_SHIFT)) & ADC_PSCR_PREVAL1_MASK)

#define ADC_PSCR_PREVAL2_MASK                    (0x20U)
#define ADC_PSCR_PREVAL2_SHIFT                   (5U)
/*! PREVAL2 - Presampling Voltage Select For External Inputs
 *  0b0..VREFL
 *  0b1..VREFH
 */
#define ADC_PSCR_PREVAL2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_PSCR_PREVAL2_SHIFT)) & ADC_PSCR_PREVAL2_MASK)
/*! @} */

/*! @name PSR0 - Presampling Enable For Precision Inputs */
/*! @{ */

#define ADC_PSR0_PRES0_MASK                      (0x1U)
#define ADC_PSR0_PRES0_SHIFT                     (0U)
/*! PRES0 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES0(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES0_SHIFT)) & ADC_PSR0_PRES0_MASK)

#define ADC_PSR0_PRES1_MASK                      (0x2U)
#define ADC_PSR0_PRES1_SHIFT                     (1U)
/*! PRES1 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES1(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES1_SHIFT)) & ADC_PSR0_PRES1_MASK)

#define ADC_PSR0_PRES2_MASK                      (0x4U)
#define ADC_PSR0_PRES2_SHIFT                     (2U)
/*! PRES2 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES2(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES2_SHIFT)) & ADC_PSR0_PRES2_MASK)

#define ADC_PSR0_PRES3_MASK                      (0x8U)
#define ADC_PSR0_PRES3_SHIFT                     (3U)
/*! PRES3 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES3(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES3_SHIFT)) & ADC_PSR0_PRES3_MASK)

#define ADC_PSR0_PRES4_MASK                      (0x10U)
#define ADC_PSR0_PRES4_SHIFT                     (4U)
/*! PRES4 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES4(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES4_SHIFT)) & ADC_PSR0_PRES4_MASK)

#define ADC_PSR0_PRES5_MASK                      (0x20U)
#define ADC_PSR0_PRES5_SHIFT                     (5U)
/*! PRES5 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES5(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES5_SHIFT)) & ADC_PSR0_PRES5_MASK)

#define ADC_PSR0_PRES6_MASK                      (0x40U)
#define ADC_PSR0_PRES6_SHIFT                     (6U)
/*! PRES6 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES6(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES6_SHIFT)) & ADC_PSR0_PRES6_MASK)

#define ADC_PSR0_PRES7_MASK                      (0x80U)
#define ADC_PSR0_PRES7_SHIFT                     (7U)
/*! PRES7 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR0_PRES7(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR0_PRES7_SHIFT)) & ADC_PSR0_PRES7_MASK)
/*! @} */

/*! @name PSR1 - Presampling Enable For Standard Inputs */
/*! @{ */

#define ADC_PSR1_PRES0_MASK                      (0x1U)
#define ADC_PSR1_PRES0_SHIFT                     (0U)
/*! PRES0 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES0(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES0_SHIFT)) & ADC_PSR1_PRES0_MASK)

#define ADC_PSR1_PRES1_MASK                      (0x2U)
#define ADC_PSR1_PRES1_SHIFT                     (1U)
/*! PRES1 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES1(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES1_SHIFT)) & ADC_PSR1_PRES1_MASK)

#define ADC_PSR1_PRES2_MASK                      (0x4U)
#define ADC_PSR1_PRES2_SHIFT                     (2U)
/*! PRES2 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES2(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES2_SHIFT)) & ADC_PSR1_PRES2_MASK)

#define ADC_PSR1_PRES3_MASK                      (0x8U)
#define ADC_PSR1_PRES3_SHIFT                     (3U)
/*! PRES3 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES3(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES3_SHIFT)) & ADC_PSR1_PRES3_MASK)

#define ADC_PSR1_PRES4_MASK                      (0x10U)
#define ADC_PSR1_PRES4_SHIFT                     (4U)
/*! PRES4 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES4(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES4_SHIFT)) & ADC_PSR1_PRES4_MASK)

#define ADC_PSR1_PRES5_MASK                      (0x20U)
#define ADC_PSR1_PRES5_SHIFT                     (5U)
/*! PRES5 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES5(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES5_SHIFT)) & ADC_PSR1_PRES5_MASK)

#define ADC_PSR1_PRES6_MASK                      (0x40U)
#define ADC_PSR1_PRES6_SHIFT                     (6U)
/*! PRES6 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES6(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES6_SHIFT)) & ADC_PSR1_PRES6_MASK)

#define ADC_PSR1_PRES7_MASK                      (0x80U)
#define ADC_PSR1_PRES7_SHIFT                     (7U)
/*! PRES7 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES7(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES7_SHIFT)) & ADC_PSR1_PRES7_MASK)

#define ADC_PSR1_PRES8_MASK                      (0x100U)
#define ADC_PSR1_PRES8_SHIFT                     (8U)
/*! PRES8 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES8(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES8_SHIFT)) & ADC_PSR1_PRES8_MASK)

