zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_PSR1_PRES9_MASK                      (0x200U)
#define ADC_PSR1_PRES9_SHIFT                     (9U)
/*! PRES9 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES9(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES9_SHIFT)) & ADC_PSR1_PRES9_MASK)

#define ADC_PSR1_PRES10_MASK                     (0x400U)
#define ADC_PSR1_PRES10_SHIFT                    (10U)
/*! PRES10 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES10(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES10_SHIFT)) & ADC_PSR1_PRES10_MASK)

#define ADC_PSR1_PRES11_MASK                     (0x800U)
#define ADC_PSR1_PRES11_SHIFT                    (11U)
/*! PRES11 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES11(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES11_SHIFT)) & ADC_PSR1_PRES11_MASK)

#define ADC_PSR1_PRES12_MASK                     (0x1000U)
#define ADC_PSR1_PRES12_SHIFT                    (12U)
/*! PRES12 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES12(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES12_SHIFT)) & ADC_PSR1_PRES12_MASK)

#define ADC_PSR1_PRES13_MASK                     (0x2000U)
#define ADC_PSR1_PRES13_SHIFT                    (13U)
/*! PRES13 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES13(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES13_SHIFT)) & ADC_PSR1_PRES13_MASK)

#define ADC_PSR1_PRES14_MASK                     (0x4000U)
#define ADC_PSR1_PRES14_SHIFT                    (14U)
/*! PRES14 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES14(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES14_SHIFT)) & ADC_PSR1_PRES14_MASK)

#define ADC_PSR1_PRES15_MASK                     (0x8000U)
#define ADC_PSR1_PRES15_SHIFT                    (15U)
/*! PRES15 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES15(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES15_SHIFT)) & ADC_PSR1_PRES15_MASK)

#define ADC_PSR1_PRES16_MASK                     (0x10000U)
#define ADC_PSR1_PRES16_SHIFT                    (16U)
/*! PRES16 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES16(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES16_SHIFT)) & ADC_PSR1_PRES16_MASK)

#define ADC_PSR1_PRES17_MASK                     (0x20000U)
#define ADC_PSR1_PRES17_SHIFT                    (17U)
/*! PRES17 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES17(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES17_SHIFT)) & ADC_PSR1_PRES17_MASK)

#define ADC_PSR1_PRES18_MASK                     (0x40000U)
#define ADC_PSR1_PRES18_SHIFT                    (18U)
/*! PRES18 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES18(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES18_SHIFT)) & ADC_PSR1_PRES18_MASK)

#define ADC_PSR1_PRES19_MASK                     (0x80000U)
#define ADC_PSR1_PRES19_SHIFT                    (19U)
/*! PRES19 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES19(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES19_SHIFT)) & ADC_PSR1_PRES19_MASK)

#define ADC_PSR1_PRES20_MASK                     (0x100000U)
#define ADC_PSR1_PRES20_SHIFT                    (20U)
/*! PRES20 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES20(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES20_SHIFT)) & ADC_PSR1_PRES20_MASK)

#define ADC_PSR1_PRES21_MASK                     (0x200000U)
#define ADC_PSR1_PRES21_SHIFT                    (21U)
/*! PRES21 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES21(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES21_SHIFT)) & ADC_PSR1_PRES21_MASK)

#define ADC_PSR1_PRES22_MASK                     (0x400000U)
#define ADC_PSR1_PRES22_SHIFT                    (22U)
/*! PRES22 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES22(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES22_SHIFT)) & ADC_PSR1_PRES22_MASK)

#define ADC_PSR1_PRES23_MASK                     (0x800000U)
#define ADC_PSR1_PRES23_SHIFT                    (23U)
/*! PRES23 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR1_PRES23(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR1_PRES23_SHIFT)) & ADC_PSR1_PRES23_MASK)
/*! @} */

/*! @name PSR2 - Presampling Enable For External Inputs */
/*! @{ */

#define ADC_PSR2_PRES0_MASK                      (0x1U)
#define ADC_PSR2_PRES0_SHIFT                     (0U)
/*! PRES0 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES0(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES0_SHIFT)) & ADC_PSR2_PRES0_MASK)

#define ADC_PSR2_PRES1_MASK                      (0x2U)
#define ADC_PSR2_PRES1_SHIFT                     (1U)
/*! PRES1 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES1(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES1_SHIFT)) & ADC_PSR2_PRES1_MASK)

#define ADC_PSR2_PRES2_MASK                      (0x4U)
#define ADC_PSR2_PRES2_SHIFT                     (2U)
/*! PRES2 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES2(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES2_SHIFT)) & ADC_PSR2_PRES2_MASK)

#define ADC_PSR2_PRES3_MASK                      (0x8U)
#define ADC_PSR2_PRES3_SHIFT                     (3U)
/*! PRES3 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES3(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES3_SHIFT)) & ADC_PSR2_PRES3_MASK)

#define ADC_PSR2_PRES4_MASK                      (0x10U)
#define ADC_PSR2_PRES4_SHIFT                     (4U)
/*! PRES4 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES4(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES4_SHIFT)) & ADC_PSR2_PRES4_MASK)

#define ADC_PSR2_PRES5_MASK                      (0x20U)
#define ADC_PSR2_PRES5_SHIFT                     (5U)
/*! PRES5 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES5(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES5_SHIFT)) & ADC_PSR2_PRES5_MASK)

