zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_PSR2_PRES6_MASK                      (0x40U)
#define ADC_PSR2_PRES6_SHIFT                     (6U)
/*! PRES6 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES6(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES6_SHIFT)) & ADC_PSR2_PRES6_MASK)

#define ADC_PSR2_PRES7_MASK                      (0x80U)
#define ADC_PSR2_PRES7_SHIFT                     (7U)
/*! PRES7 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES7(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES7_SHIFT)) & ADC_PSR2_PRES7_MASK)

#define ADC_PSR2_PRES8_MASK                      (0x100U)
#define ADC_PSR2_PRES8_SHIFT                     (8U)
/*! PRES8 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES8(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES8_SHIFT)) & ADC_PSR2_PRES8_MASK)

#define ADC_PSR2_PRES9_MASK                      (0x200U)
#define ADC_PSR2_PRES9_SHIFT                     (9U)
/*! PRES9 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES9(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES9_SHIFT)) & ADC_PSR2_PRES9_MASK)

#define ADC_PSR2_PRES10_MASK                     (0x400U)
#define ADC_PSR2_PRES10_SHIFT                    (10U)
/*! PRES10 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES10(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES10_SHIFT)) & ADC_PSR2_PRES10_MASK)

#define ADC_PSR2_PRES11_MASK                     (0x800U)
#define ADC_PSR2_PRES11_SHIFT                    (11U)
/*! PRES11 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES11(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES11_SHIFT)) & ADC_PSR2_PRES11_MASK)

#define ADC_PSR2_PRES12_MASK                     (0x1000U)
#define ADC_PSR2_PRES12_SHIFT                    (12U)
/*! PRES12 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES12(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES12_SHIFT)) & ADC_PSR2_PRES12_MASK)

#define ADC_PSR2_PRES13_MASK                     (0x2000U)
#define ADC_PSR2_PRES13_SHIFT                    (13U)
/*! PRES13 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES13(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES13_SHIFT)) & ADC_PSR2_PRES13_MASK)

#define ADC_PSR2_PRES14_MASK                     (0x4000U)
#define ADC_PSR2_PRES14_SHIFT                    (14U)
/*! PRES14 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES14(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES14_SHIFT)) & ADC_PSR2_PRES14_MASK)

#define ADC_PSR2_PRES15_MASK                     (0x8000U)
#define ADC_PSR2_PRES15_SHIFT                    (15U)
/*! PRES15 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES15(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES15_SHIFT)) & ADC_PSR2_PRES15_MASK)

#define ADC_PSR2_PRES16_MASK                     (0x10000U)
#define ADC_PSR2_PRES16_SHIFT                    (16U)
/*! PRES16 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES16(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES16_SHIFT)) & ADC_PSR2_PRES16_MASK)

#define ADC_PSR2_PRES17_MASK                     (0x20000U)
#define ADC_PSR2_PRES17_SHIFT                    (17U)
/*! PRES17 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES17(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES17_SHIFT)) & ADC_PSR2_PRES17_MASK)

#define ADC_PSR2_PRES18_MASK                     (0x40000U)
#define ADC_PSR2_PRES18_SHIFT                    (18U)
/*! PRES18 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES18(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES18_SHIFT)) & ADC_PSR2_PRES18_MASK)

#define ADC_PSR2_PRES19_MASK                     (0x80000U)
#define ADC_PSR2_PRES19_SHIFT                    (19U)
/*! PRES19 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES19(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES19_SHIFT)) & ADC_PSR2_PRES19_MASK)

#define ADC_PSR2_PRES20_MASK                     (0x100000U)
#define ADC_PSR2_PRES20_SHIFT                    (20U)
/*! PRES20 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES20(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES20_SHIFT)) & ADC_PSR2_PRES20_MASK)

#define ADC_PSR2_PRES21_MASK                     (0x200000U)
#define ADC_PSR2_PRES21_SHIFT                    (21U)
/*! PRES21 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES21(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES21_SHIFT)) & ADC_PSR2_PRES21_MASK)

#define ADC_PSR2_PRES22_MASK                     (0x400000U)
#define ADC_PSR2_PRES22_SHIFT                    (22U)
/*! PRES22 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES22(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES22_SHIFT)) & ADC_PSR2_PRES22_MASK)

#define ADC_PSR2_PRES23_MASK                     (0x800000U)
#define ADC_PSR2_PRES23_SHIFT                    (23U)
/*! PRES23 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES23(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES23_SHIFT)) & ADC_PSR2_PRES23_MASK)

#define ADC_PSR2_PRES24_MASK                     (0x1000000U)
#define ADC_PSR2_PRES24_SHIFT                    (24U)
/*! PRES24 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES24(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES24_SHIFT)) & ADC_PSR2_PRES24_MASK)

#define ADC_PSR2_PRES25_MASK                     (0x2000000U)
#define ADC_PSR2_PRES25_SHIFT                    (25U)
/*! PRES25 - Presampling Enable n
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_PSR2_PRES25(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PSR2_PRES25_SHIFT)) & ADC_PSR2_PRES25_MASK)

