zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_NCMR1_CH41_MASK                      (0x200U)
#define ADC_NCMR1_CH41_SHIFT                     (9U)
/*! CH41 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH41(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH41_SHIFT)) & ADC_NCMR1_CH41_MASK)

#define ADC_NCMR1_CH42_MASK                      (0x400U)
#define ADC_NCMR1_CH42_SHIFT                     (10U)
/*! CH42 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH42(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH42_SHIFT)) & ADC_NCMR1_CH42_MASK)

#define ADC_NCMR1_CH43_MASK                      (0x800U)
#define ADC_NCMR1_CH43_SHIFT                     (11U)
/*! CH43 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH43(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH43_SHIFT)) & ADC_NCMR1_CH43_MASK)

#define ADC_NCMR1_CH44_MASK                      (0x1000U)
#define ADC_NCMR1_CH44_SHIFT                     (12U)
/*! CH44 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH44(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH44_SHIFT)) & ADC_NCMR1_CH44_MASK)

#define ADC_NCMR1_CH45_MASK                      (0x2000U)
#define ADC_NCMR1_CH45_SHIFT                     (13U)
/*! CH45 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH45(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH45_SHIFT)) & ADC_NCMR1_CH45_MASK)

#define ADC_NCMR1_CH46_MASK                      (0x4000U)
#define ADC_NCMR1_CH46_SHIFT                     (14U)
/*! CH46 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH46(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH46_SHIFT)) & ADC_NCMR1_CH46_MASK)

#define ADC_NCMR1_CH47_MASK                      (0x8000U)
#define ADC_NCMR1_CH47_SHIFT                     (15U)
/*! CH47 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH47(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH47_SHIFT)) & ADC_NCMR1_CH47_MASK)

#define ADC_NCMR1_CH48_MASK                      (0x10000U)
#define ADC_NCMR1_CH48_SHIFT                     (16U)
/*! CH48 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH48(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH48_SHIFT)) & ADC_NCMR1_CH48_MASK)

#define ADC_NCMR1_CH49_MASK                      (0x20000U)
#define ADC_NCMR1_CH49_SHIFT                     (17U)
/*! CH49 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH49(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH49_SHIFT)) & ADC_NCMR1_CH49_MASK)

#define ADC_NCMR1_CH50_MASK                      (0x40000U)
#define ADC_NCMR1_CH50_SHIFT                     (18U)
/*! CH50 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH50(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH50_SHIFT)) & ADC_NCMR1_CH50_MASK)

#define ADC_NCMR1_CH51_MASK                      (0x80000U)
#define ADC_NCMR1_CH51_SHIFT                     (19U)
/*! CH51 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH51(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH51_SHIFT)) & ADC_NCMR1_CH51_MASK)

#define ADC_NCMR1_CH52_MASK                      (0x100000U)
#define ADC_NCMR1_CH52_SHIFT                     (20U)
/*! CH52 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH52(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH52_SHIFT)) & ADC_NCMR1_CH52_MASK)

#define ADC_NCMR1_CH53_MASK                      (0x200000U)
#define ADC_NCMR1_CH53_SHIFT                     (21U)
/*! CH53 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH53(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH53_SHIFT)) & ADC_NCMR1_CH53_MASK)

#define ADC_NCMR1_CH54_MASK                      (0x400000U)
#define ADC_NCMR1_CH54_SHIFT                     (22U)
/*! CH54 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH54(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH54_SHIFT)) & ADC_NCMR1_CH54_MASK)

#define ADC_NCMR1_CH55_MASK                      (0x800000U)
#define ADC_NCMR1_CH55_SHIFT                     (23U)
/*! CH55 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR1_CH55(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR1_CH55_SHIFT)) & ADC_NCMR1_CH55_MASK)
/*! @} */

/*! @name NCMR2 - Normal Conversion Enable For External Inputs */
/*! @{ */

#define ADC_NCMR2_CH64_MASK                      (0x1U)
#define ADC_NCMR2_CH64_SHIFT                     (0U)
/*! CH64 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH64(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH64_SHIFT)) & ADC_NCMR2_CH64_MASK)

#define ADC_NCMR2_CH65_MASK                      (0x2U)
#define ADC_NCMR2_CH65_SHIFT                     (1U)
/*! CH65 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH65(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH65_SHIFT)) & ADC_NCMR2_CH65_MASK)

#define ADC_NCMR2_CH66_MASK                      (0x4U)
#define ADC_NCMR2_CH66_SHIFT                     (2U)
/*! CH66 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH66(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH66_SHIFT)) & ADC_NCMR2_CH66_MASK)

