zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_NCMR2_CH67_MASK                      (0x8U)
#define ADC_NCMR2_CH67_SHIFT                     (3U)
/*! CH67 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH67(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH67_SHIFT)) & ADC_NCMR2_CH67_MASK)

#define ADC_NCMR2_CH68_MASK                      (0x10U)
#define ADC_NCMR2_CH68_SHIFT                     (4U)
/*! CH68 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH68(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH68_SHIFT)) & ADC_NCMR2_CH68_MASK)

#define ADC_NCMR2_CH69_MASK                      (0x20U)
#define ADC_NCMR2_CH69_SHIFT                     (5U)
/*! CH69 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH69(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH69_SHIFT)) & ADC_NCMR2_CH69_MASK)

#define ADC_NCMR2_CH70_MASK                      (0x40U)
#define ADC_NCMR2_CH70_SHIFT                     (6U)
/*! CH70 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH70(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH70_SHIFT)) & ADC_NCMR2_CH70_MASK)

#define ADC_NCMR2_CH71_MASK                      (0x80U)
#define ADC_NCMR2_CH71_SHIFT                     (7U)
/*! CH71 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH71(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH71_SHIFT)) & ADC_NCMR2_CH71_MASK)

#define ADC_NCMR2_CH72_MASK                      (0x100U)
#define ADC_NCMR2_CH72_SHIFT                     (8U)
/*! CH72 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH72(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH72_SHIFT)) & ADC_NCMR2_CH72_MASK)

#define ADC_NCMR2_CH73_MASK                      (0x200U)
#define ADC_NCMR2_CH73_SHIFT                     (9U)
/*! CH73 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH73(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH73_SHIFT)) & ADC_NCMR2_CH73_MASK)

#define ADC_NCMR2_CH74_MASK                      (0x400U)
#define ADC_NCMR2_CH74_SHIFT                     (10U)
/*! CH74 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH74(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH74_SHIFT)) & ADC_NCMR2_CH74_MASK)

#define ADC_NCMR2_CH75_MASK                      (0x800U)
#define ADC_NCMR2_CH75_SHIFT                     (11U)
/*! CH75 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH75(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH75_SHIFT)) & ADC_NCMR2_CH75_MASK)

#define ADC_NCMR2_CH76_MASK                      (0x1000U)
#define ADC_NCMR2_CH76_SHIFT                     (12U)
/*! CH76 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH76(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH76_SHIFT)) & ADC_NCMR2_CH76_MASK)

#define ADC_NCMR2_CH77_MASK                      (0x2000U)
#define ADC_NCMR2_CH77_SHIFT                     (13U)
/*! CH77 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH77(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH77_SHIFT)) & ADC_NCMR2_CH77_MASK)

#define ADC_NCMR2_CH78_MASK                      (0x4000U)
#define ADC_NCMR2_CH78_SHIFT                     (14U)
/*! CH78 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH78(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH78_SHIFT)) & ADC_NCMR2_CH78_MASK)

#define ADC_NCMR2_CH79_MASK                      (0x8000U)
#define ADC_NCMR2_CH79_SHIFT                     (15U)
/*! CH79 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH79(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH79_SHIFT)) & ADC_NCMR2_CH79_MASK)

#define ADC_NCMR2_CH80_MASK                      (0x10000U)
#define ADC_NCMR2_CH80_SHIFT                     (16U)
/*! CH80 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH80(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH80_SHIFT)) & ADC_NCMR2_CH80_MASK)

#define ADC_NCMR2_CH81_MASK                      (0x20000U)
#define ADC_NCMR2_CH81_SHIFT                     (17U)
/*! CH81 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH81(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH81_SHIFT)) & ADC_NCMR2_CH81_MASK)

#define ADC_NCMR2_CH82_MASK                      (0x40000U)
#define ADC_NCMR2_CH82_SHIFT                     (18U)
/*! CH82 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH82(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH82_SHIFT)) & ADC_NCMR2_CH82_MASK)

#define ADC_NCMR2_CH83_MASK                      (0x80000U)
#define ADC_NCMR2_CH83_SHIFT                     (19U)
/*! CH83 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH83(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH83_SHIFT)) & ADC_NCMR2_CH83_MASK)

#define ADC_NCMR2_CH84_MASK                      (0x100000U)
#define ADC_NCMR2_CH84_SHIFT                     (20U)
/*! CH84 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH84(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH84_SHIFT)) & ADC_NCMR2_CH84_MASK)

