zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_NCMR2_CH85_MASK                      (0x200000U)
#define ADC_NCMR2_CH85_SHIFT                     (21U)
/*! CH85 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH85(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH85_SHIFT)) & ADC_NCMR2_CH85_MASK)

#define ADC_NCMR2_CH86_MASK                      (0x400000U)
#define ADC_NCMR2_CH86_SHIFT                     (22U)
/*! CH86 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH86(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH86_SHIFT)) & ADC_NCMR2_CH86_MASK)

#define ADC_NCMR2_CH87_MASK                      (0x800000U)
#define ADC_NCMR2_CH87_SHIFT                     (23U)
/*! CH87 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH87(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH87_SHIFT)) & ADC_NCMR2_CH87_MASK)

#define ADC_NCMR2_CH88_MASK                      (0x1000000U)
#define ADC_NCMR2_CH88_SHIFT                     (24U)
/*! CH88 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH88(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH88_SHIFT)) & ADC_NCMR2_CH88_MASK)

#define ADC_NCMR2_CH89_MASK                      (0x2000000U)
#define ADC_NCMR2_CH89_SHIFT                     (25U)
/*! CH89 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH89(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH89_SHIFT)) & ADC_NCMR2_CH89_MASK)

#define ADC_NCMR2_CH90_MASK                      (0x4000000U)
#define ADC_NCMR2_CH90_SHIFT                     (26U)
/*! CH90 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH90(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH90_SHIFT)) & ADC_NCMR2_CH90_MASK)

#define ADC_NCMR2_CH91_MASK                      (0x8000000U)
#define ADC_NCMR2_CH91_SHIFT                     (27U)
/*! CH91 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH91(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH91_SHIFT)) & ADC_NCMR2_CH91_MASK)

#define ADC_NCMR2_CH92_MASK                      (0x10000000U)
#define ADC_NCMR2_CH92_SHIFT                     (28U)
/*! CH92 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH92(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH92_SHIFT)) & ADC_NCMR2_CH92_MASK)

#define ADC_NCMR2_CH93_MASK                      (0x20000000U)
#define ADC_NCMR2_CH93_SHIFT                     (29U)
/*! CH93 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH93(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH93_SHIFT)) & ADC_NCMR2_CH93_MASK)

#define ADC_NCMR2_CH94_MASK                      (0x40000000U)
#define ADC_NCMR2_CH94_SHIFT                     (30U)
/*! CH94 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH94(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH94_SHIFT)) & ADC_NCMR2_CH94_MASK)

#define ADC_NCMR2_CH95_MASK                      (0x80000000U)
#define ADC_NCMR2_CH95_SHIFT                     (31U)
/*! CH95 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_NCMR2_CH95(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_NCMR2_CH95_SHIFT)) & ADC_NCMR2_CH95_MASK)
/*! @} */

/*! @name JCMR0 - Injected Conversion Enable For Precision Inputs */
/*! @{ */

#define ADC_JCMR0_CH0_MASK                       (0x1U)
#define ADC_JCMR0_CH0_SHIFT                      (0U)
/*! CH0 - Precision Input To Be Converted
 *  0b0..Input 0 is not selected
 *  0b1..Input 0 is selected
 */
#define ADC_JCMR0_CH0(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH0_SHIFT)) & ADC_JCMR0_CH0_MASK)

#define ADC_JCMR0_CH1_MASK                       (0x2U)
#define ADC_JCMR0_CH1_SHIFT                      (1U)
/*! CH1 - Precision Input To Be Converted
 *  0b0..Input 1 is not selected
 *  0b1..Input 1 is selected
 */
#define ADC_JCMR0_CH1(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH1_SHIFT)) & ADC_JCMR0_CH1_MASK)

#define ADC_JCMR0_CH2_MASK                       (0x4U)
#define ADC_JCMR0_CH2_SHIFT                      (2U)
/*! CH2 - Precision Input To Be Converted
 *  0b0..Input 2 is not selected
 *  0b1..Input 2 is selected
 */
#define ADC_JCMR0_CH2(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH2_SHIFT)) & ADC_JCMR0_CH2_MASK)

#define ADC_JCMR0_CH3_MASK                       (0x8U)
#define ADC_JCMR0_CH3_SHIFT                      (3U)
/*! CH3 - Precision Input To Be Converted
 *  0b0..Input 3 is not selected
 *  0b1..Input 3 is selected
 */
#define ADC_JCMR0_CH3(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH3_SHIFT)) & ADC_JCMR0_CH3_MASK)

#define ADC_JCMR0_CH4_MASK                       (0x10U)
#define ADC_JCMR0_CH4_SHIFT                      (4U)
/*! CH4 - Precision Input To Be Converted
 *  0b0..Input 4 is not selected
 *  0b1..Input 4 is selected
 */
#define ADC_JCMR0_CH4(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH4_SHIFT)) & ADC_JCMR0_CH4_MASK)

#define ADC_JCMR0_CH5_MASK                       (0x20U)
#define ADC_JCMR0_CH5_SHIFT                      (5U)
/*! CH5 - Precision Input To Be Converted
 *  0b0..Input 5 is not selected
 *  0b1..Input 5 is selected
 */
#define ADC_JCMR0_CH5(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH5_SHIFT)) & ADC_JCMR0_CH5_MASK)

#define ADC_JCMR0_CH6_MASK                       (0x40U)
#define ADC_JCMR0_CH6_SHIFT                      (6U)
/*! CH6 - Precision Input To Be Converted
 *  0b0..Input 6 is not selected
 *  0b1..Input 6 is selected
 */
#define ADC_JCMR0_CH6(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH6_SHIFT)) & ADC_JCMR0_CH6_MASK)

#define ADC_JCMR0_CH7_MASK                       (0x80U)
#define ADC_JCMR0_CH7_SHIFT                      (7U)
/*! CH7 - Precision Input To Be Converted
 *  0b0..Input 7 is not selected
 *  0b1..Input 7 is selected
 */
#define ADC_JCMR0_CH7(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_JCMR0_CH7_SHIFT)) & ADC_JCMR0_CH7_MASK)
/*! @} */

/*! @name JCMR1 - Injected Conversion Enable For Standard Inputs */
/*! @{ */

#define ADC_JCMR1_CH32_MASK                      (0x1U)
#define ADC_JCMR1_CH32_SHIFT                     (0U)
/*! CH32 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH32(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH32_SHIFT)) & ADC_JCMR1_CH32_MASK)

#define ADC_JCMR1_CH33_MASK                      (0x2U)
#define ADC_JCMR1_CH33_SHIFT                     (1U)
/*! CH33 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH33(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH33_SHIFT)) & ADC_JCMR1_CH33_MASK)

#define ADC_JCMR1_CH34_MASK                      (0x4U)
#define ADC_JCMR1_CH34_SHIFT                     (2U)
/*! CH34 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH34(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH34_SHIFT)) & ADC_JCMR1_CH34_MASK)

