zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_JCMR1_CH35_MASK                      (0x8U)
#define ADC_JCMR1_CH35_SHIFT                     (3U)
/*! CH35 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH35(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH35_SHIFT)) & ADC_JCMR1_CH35_MASK)

#define ADC_JCMR1_CH36_MASK                      (0x10U)
#define ADC_JCMR1_CH36_SHIFT                     (4U)
/*! CH36 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH36(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH36_SHIFT)) & ADC_JCMR1_CH36_MASK)

#define ADC_JCMR1_CH37_MASK                      (0x20U)
#define ADC_JCMR1_CH37_SHIFT                     (5U)
/*! CH37 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH37(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH37_SHIFT)) & ADC_JCMR1_CH37_MASK)

#define ADC_JCMR1_CH38_MASK                      (0x40U)
#define ADC_JCMR1_CH38_SHIFT                     (6U)
/*! CH38 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH38(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH38_SHIFT)) & ADC_JCMR1_CH38_MASK)

#define ADC_JCMR1_CH39_MASK                      (0x80U)
#define ADC_JCMR1_CH39_SHIFT                     (7U)
/*! CH39 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH39(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH39_SHIFT)) & ADC_JCMR1_CH39_MASK)

#define ADC_JCMR1_CH40_MASK                      (0x100U)
#define ADC_JCMR1_CH40_SHIFT                     (8U)
/*! CH40 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH40(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH40_SHIFT)) & ADC_JCMR1_CH40_MASK)

#define ADC_JCMR1_CH41_MASK                      (0x200U)
#define ADC_JCMR1_CH41_SHIFT                     (9U)
/*! CH41 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH41(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH41_SHIFT)) & ADC_JCMR1_CH41_MASK)

#define ADC_JCMR1_CH42_MASK                      (0x400U)
#define ADC_JCMR1_CH42_SHIFT                     (10U)
/*! CH42 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH42(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH42_SHIFT)) & ADC_JCMR1_CH42_MASK)

#define ADC_JCMR1_CH43_MASK                      (0x800U)
#define ADC_JCMR1_CH43_SHIFT                     (11U)
/*! CH43 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH43(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH43_SHIFT)) & ADC_JCMR1_CH43_MASK)

#define ADC_JCMR1_CH44_MASK                      (0x1000U)
#define ADC_JCMR1_CH44_SHIFT                     (12U)
/*! CH44 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH44(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH44_SHIFT)) & ADC_JCMR1_CH44_MASK)

#define ADC_JCMR1_CH45_MASK                      (0x2000U)
#define ADC_JCMR1_CH45_SHIFT                     (13U)
/*! CH45 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH45(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH45_SHIFT)) & ADC_JCMR1_CH45_MASK)

#define ADC_JCMR1_CH46_MASK                      (0x4000U)
#define ADC_JCMR1_CH46_SHIFT                     (14U)
/*! CH46 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH46(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH46_SHIFT)) & ADC_JCMR1_CH46_MASK)

#define ADC_JCMR1_CH47_MASK                      (0x8000U)
#define ADC_JCMR1_CH47_SHIFT                     (15U)
/*! CH47 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH47(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH47_SHIFT)) & ADC_JCMR1_CH47_MASK)

#define ADC_JCMR1_CH48_MASK                      (0x10000U)
#define ADC_JCMR1_CH48_SHIFT                     (16U)
/*! CH48 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH48(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH48_SHIFT)) & ADC_JCMR1_CH48_MASK)

#define ADC_JCMR1_CH49_MASK                      (0x20000U)
#define ADC_JCMR1_CH49_SHIFT                     (17U)
/*! CH49 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH49(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH49_SHIFT)) & ADC_JCMR1_CH49_MASK)

#define ADC_JCMR1_CH50_MASK                      (0x40000U)
#define ADC_JCMR1_CH50_SHIFT                     (18U)
/*! CH50 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH50(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH50_SHIFT)) & ADC_JCMR1_CH50_MASK)

#define ADC_JCMR1_CH51_MASK                      (0x80000U)
#define ADC_JCMR1_CH51_SHIFT                     (19U)
/*! CH51 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH51(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH51_SHIFT)) & ADC_JCMR1_CH51_MASK)

#define ADC_JCMR1_CH52_MASK                      (0x100000U)
#define ADC_JCMR1_CH52_SHIFT                     (20U)
/*! CH52 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH52(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH52_SHIFT)) & ADC_JCMR1_CH52_MASK)

#define ADC_JCMR1_CH53_MASK                      (0x200000U)
#define ADC_JCMR1_CH53_SHIFT                     (21U)
/*! CH53 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH53(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH53_SHIFT)) & ADC_JCMR1_CH53_MASK)

#define ADC_JCMR1_CH54_MASK                      (0x400000U)
#define ADC_JCMR1_CH54_SHIFT                     (22U)
/*! CH54 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH54(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH54_SHIFT)) & ADC_JCMR1_CH54_MASK)

#define ADC_JCMR1_CH55_MASK                      (0x800000U)
#define ADC_JCMR1_CH55_SHIFT                     (23U)
/*! CH55 - Standard Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR1_CH55(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR1_CH55_SHIFT)) & ADC_JCMR1_CH55_MASK)
/*! @} */

/*! @name JCMR2 - Injected Conversion Enable For External Inputs */
/*! @{ */

