zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_JCMR2_CH82_MASK                      (0x40000U)
#define ADC_JCMR2_CH82_SHIFT                     (18U)
/*! CH82 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH82(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH82_SHIFT)) & ADC_JCMR2_CH82_MASK)

#define ADC_JCMR2_CH83_MASK                      (0x80000U)
#define ADC_JCMR2_CH83_SHIFT                     (19U)
/*! CH83 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH83(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH83_SHIFT)) & ADC_JCMR2_CH83_MASK)

#define ADC_JCMR2_CH84_MASK                      (0x100000U)
#define ADC_JCMR2_CH84_SHIFT                     (20U)
/*! CH84 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH84(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH84_SHIFT)) & ADC_JCMR2_CH84_MASK)

#define ADC_JCMR2_CH85_MASK                      (0x200000U)
#define ADC_JCMR2_CH85_SHIFT                     (21U)
/*! CH85 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH85(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH85_SHIFT)) & ADC_JCMR2_CH85_MASK)

#define ADC_JCMR2_CH86_MASK                      (0x400000U)
#define ADC_JCMR2_CH86_SHIFT                     (22U)
/*! CH86 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH86(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH86_SHIFT)) & ADC_JCMR2_CH86_MASK)

#define ADC_JCMR2_CH87_MASK                      (0x800000U)
#define ADC_JCMR2_CH87_SHIFT                     (23U)
/*! CH87 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH87(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH87_SHIFT)) & ADC_JCMR2_CH87_MASK)

#define ADC_JCMR2_CH88_MASK                      (0x1000000U)
#define ADC_JCMR2_CH88_SHIFT                     (24U)
/*! CH88 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH88(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH88_SHIFT)) & ADC_JCMR2_CH88_MASK)

#define ADC_JCMR2_CH89_MASK                      (0x2000000U)
#define ADC_JCMR2_CH89_SHIFT                     (25U)
/*! CH89 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH89(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH89_SHIFT)) & ADC_JCMR2_CH89_MASK)

#define ADC_JCMR2_CH90_MASK                      (0x4000000U)
#define ADC_JCMR2_CH90_SHIFT                     (26U)
/*! CH90 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH90(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH90_SHIFT)) & ADC_JCMR2_CH90_MASK)

#define ADC_JCMR2_CH91_MASK                      (0x8000000U)
#define ADC_JCMR2_CH91_SHIFT                     (27U)
/*! CH91 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH91(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH91_SHIFT)) & ADC_JCMR2_CH91_MASK)

#define ADC_JCMR2_CH92_MASK                      (0x10000000U)
#define ADC_JCMR2_CH92_SHIFT                     (28U)
/*! CH92 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH92(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH92_SHIFT)) & ADC_JCMR2_CH92_MASK)

#define ADC_JCMR2_CH93_MASK                      (0x20000000U)
#define ADC_JCMR2_CH93_SHIFT                     (29U)
/*! CH93 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH93(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH93_SHIFT)) & ADC_JCMR2_CH93_MASK)

#define ADC_JCMR2_CH94_MASK                      (0x40000000U)
#define ADC_JCMR2_CH94_SHIFT                     (30U)
/*! CH94 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH94(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH94_SHIFT)) & ADC_JCMR2_CH94_MASK)

#define ADC_JCMR2_CH95_MASK                      (0x80000000U)
#define ADC_JCMR2_CH95_SHIFT                     (31U)
/*! CH95 - External Input To Be Converted
 *  0b0..Input n is not selected
 *  0b1..Input n is selected
 */
#define ADC_JCMR2_CH95(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_JCMR2_CH95_SHIFT)) & ADC_JCMR2_CH95_MASK)
/*! @} */

/*! @name DSDR - Delay Start Of Data Conversion */
/*! @{ */

#define ADC_DSDR_DSD_MASK                        (0xFFFFU)
#define ADC_DSDR_DSD_SHIFT                       (0U)
/*! DSD - Delay */
#define ADC_DSDR_DSD(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_DSDR_DSD_SHIFT)) & ADC_DSDR_DSD_MASK)
/*! @} */

/*! @name PDEDR - Power Down Exit Delay */
/*! @{ */

#define ADC_PDEDR_PDED_MASK                      (0xFFU)
#define ADC_PDEDR_PDED_SHIFT                     (0U)
/*! PDED - Delay */
#define ADC_PDEDR_PDED(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PDEDR_PDED_SHIFT)) & ADC_PDEDR_PDED_MASK)
/*! @} */

/*! @name PCDR - Precision Input n Conversion Data */
/*! @{ */

#define ADC_PCDR_CDATA_MASK                      (0xFFFFU)
#define ADC_PCDR_CDATA_SHIFT                     (0U)
/*! CDATA - Conversion Data */
#define ADC_PCDR_CDATA(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PCDR_CDATA_SHIFT)) & ADC_PCDR_CDATA_MASK)

#define ADC_PCDR_RESULT_MASK                     (0x30000U)
#define ADC_PCDR_RESULT_SHIFT                    (16U)
/*! RESULT - Conversion Data Type
 *  0b00..Normal trigger
 *  0b01..Injected trigger
 *  0b10..BCTU trigger
 */
#define ADC_PCDR_RESULT(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_PCDR_RESULT_SHIFT)) & ADC_PCDR_RESULT_MASK)

#define ADC_PCDR_OVERW_MASK                      (0x40000U)
#define ADC_PCDR_OVERW_SHIFT                     (18U)
/*! OVERW - Overwrite Status Flag
 *  0b0..No unread data is overwritten
 *  0b1..Unread data is overwritten
 */
#define ADC_PCDR_OVERW(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PCDR_OVERW_SHIFT)) & ADC_PCDR_OVERW_MASK)

