zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_PCDR_VALID_MASK                      (0x80000U)
#define ADC_PCDR_VALID_SHIFT                     (19U)
/*! VALID - Conversion Data Available
 *  0b0..No unread conversion data
 *  0b1..Unread conversion data is available
 */
#define ADC_PCDR_VALID(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_PCDR_VALID_SHIFT)) & ADC_PCDR_VALID_MASK)
/*! @} */

/* The count of ADC_PCDR */
#define ADC_PCDR_COUNT                           (8U)

/*! @name ICDR - Standard Input n Conversion Data */
/*! @{ */

#define ADC_ICDR_CDATA_MASK                      (0xFFFFU)
#define ADC_ICDR_CDATA_SHIFT                     (0U)
/*! CDATA - Conversion Data */
#define ADC_ICDR_CDATA(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ICDR_CDATA_SHIFT)) & ADC_ICDR_CDATA_MASK)

#define ADC_ICDR_RESULT_MASK                     (0x30000U)
#define ADC_ICDR_RESULT_SHIFT                    (16U)
/*! RESULT - Conversion Data Type
 *  0b00..Normal trigger
 *  0b01..Injected trigger
 *  0b10..BCTU trigger
 */
#define ADC_ICDR_RESULT(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ICDR_RESULT_SHIFT)) & ADC_ICDR_RESULT_MASK)

#define ADC_ICDR_OVERW_MASK                      (0x40000U)
#define ADC_ICDR_OVERW_SHIFT                     (18U)
/*! OVERW - Overwrite Status Flag
 *  0b0..No unread data is overwritten
 *  0b1..Unread data is overwritten
 */
#define ADC_ICDR_OVERW(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ICDR_OVERW_SHIFT)) & ADC_ICDR_OVERW_MASK)

#define ADC_ICDR_VALID_MASK                      (0x80000U)
#define ADC_ICDR_VALID_SHIFT                     (19U)
/*! VALID - Conversion Data Available
 *  0b0..No unread conversion data
 *  0b1..Unread conversion data is available
 */
#define ADC_ICDR_VALID(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ICDR_VALID_SHIFT)) & ADC_ICDR_VALID_MASK)
/*! @} */

/* The count of ADC_ICDR */
#define ADC_ICDR_COUNT                           (24U)

/*! @name ECDR - External Input n Conversion Data */
/*! @{ */

#define ADC_ECDR_CDATA_MASK                      (0xFFFFU)
#define ADC_ECDR_CDATA_SHIFT                     (0U)
/*! CDATA - Conversion Data */
#define ADC_ECDR_CDATA(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ECDR_CDATA_SHIFT)) & ADC_ECDR_CDATA_MASK)

#define ADC_ECDR_RESULT_MASK                     (0x30000U)
#define ADC_ECDR_RESULT_SHIFT                    (16U)
/*! RESULT - Conversion Data Type
 *  0b00..Normal trigger
 *  0b01..Injected trigger
 *  0b10..BCTU trigger
 */
#define ADC_ECDR_RESULT(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ECDR_RESULT_SHIFT)) & ADC_ECDR_RESULT_MASK)

#define ADC_ECDR_OVERW_MASK                      (0x40000U)
#define ADC_ECDR_OVERW_SHIFT                     (18U)
/*! OVERW - Overwrite Status Flag
 *  0b0..No unread data is overwritten
 *  0b1..Unread data is overwritten
 */
#define ADC_ECDR_OVERW(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ECDR_OVERW_SHIFT)) & ADC_ECDR_OVERW_MASK)

#define ADC_ECDR_VALID_MASK                      (0x80000U)
#define ADC_ECDR_VALID_SHIFT                     (19U)
/*! VALID - Conversion Data Available
 *  0b0..No unread conversion data
 *  0b1..Unread conversion data is available
 */
#define ADC_ECDR_VALID(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ECDR_VALID_SHIFT)) & ADC_ECDR_VALID_MASK)
/*! @} */

/* The count of ADC_ECDR */
#define ADC_ECDR_COUNT                           (32U)

/*! @name CWSELRPI - Channel Analog Watchdog Select For Precision Inputs */
/*! @{ */

#define ADC_CWSELRPI_WSEL_SI0_0_MASK             (0x3U)
#define ADC_CWSELRPI_WSEL_SI0_0_SHIFT            (0U)
/*! WSEL_SI0_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_0_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_0_MASK)

#define ADC_CWSELRPI_WSEL_SI0_1_MASK             (0x30U)
#define ADC_CWSELRPI_WSEL_SI0_1_SHIFT            (4U)
/*! WSEL_SI0_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_1_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_1_MASK)

#define ADC_CWSELRPI_WSEL_SI0_2_MASK             (0x300U)
#define ADC_CWSELRPI_WSEL_SI0_2_SHIFT            (8U)
/*! WSEL_SI0_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_2_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_2_MASK)

#define ADC_CWSELRPI_WSEL_SI0_3_MASK             (0x3000U)
#define ADC_CWSELRPI_WSEL_SI0_3_SHIFT            (12U)
/*! WSEL_SI0_3 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_3(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_3_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_3_MASK)

#define ADC_CWSELRPI_WSEL_SI0_4_MASK             (0x30000U)
#define ADC_CWSELRPI_WSEL_SI0_4_SHIFT            (16U)
/*! WSEL_SI0_4 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_4(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_4_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_4_MASK)

#define ADC_CWSELRPI_WSEL_SI0_5_MASK             (0x300000U)
#define ADC_CWSELRPI_WSEL_SI0_5_SHIFT            (20U)
/*! WSEL_SI0_5 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_5(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_5_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_5_MASK)

#define ADC_CWSELRPI_WSEL_SI0_6_MASK             (0x3000000U)
#define ADC_CWSELRPI_WSEL_SI0_6_SHIFT            (24U)
/*! WSEL_SI0_6 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_6(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_6_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_6_MASK)

#define ADC_CWSELRPI_WSEL_SI0_7_MASK             (0x30000000U)
#define ADC_CWSELRPI_WSEL_SI0_7_SHIFT            (28U)
/*! WSEL_SI0_7 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRPI_WSEL_SI0_7(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRPI_WSEL_SI0_7_SHIFT)) & ADC_CWSELRPI_WSEL_SI0_7_MASK)
/*! @} */

