zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*! @name CWSELRSI - Channel Analog Watchdog Select For Standard Inputs */
/*! @{ */

#define ADC_CWSELRSI_WSEL_SI0_0_MASK             (0x3U)
#define ADC_CWSELRSI_WSEL_SI0_0_SHIFT            (0U)
/*! WSEL_SI0_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI0_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI0_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI0_0_MASK)

#define ADC_CWSELRSI_WSEL_SI0_1_MASK             (0x3U)
#define ADC_CWSELRSI_WSEL_SI0_1_SHIFT            (0U)
/*! WSEL_SI0_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI0_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI0_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI0_1_MASK)

#define ADC_CWSELRSI_WSEL_SI0_2_MASK             (0x3U)
#define ADC_CWSELRSI_WSEL_SI0_2_SHIFT            (0U)
/*! WSEL_SI0_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI0_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI0_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI0_2_MASK)

#define ADC_CWSELRSI_WSEL_SI1_0_MASK             (0x30U)
#define ADC_CWSELRSI_WSEL_SI1_0_SHIFT            (4U)
/*! WSEL_SI1_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI1_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI1_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI1_0_MASK)

#define ADC_CWSELRSI_WSEL_SI1_1_MASK             (0x30U)
#define ADC_CWSELRSI_WSEL_SI1_1_SHIFT            (4U)
/*! WSEL_SI1_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI1_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI1_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI1_1_MASK)

#define ADC_CWSELRSI_WSEL_SI1_2_MASK             (0x30U)
#define ADC_CWSELRSI_WSEL_SI1_2_SHIFT            (4U)
/*! WSEL_SI1_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI1_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI1_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI1_2_MASK)

#define ADC_CWSELRSI_WSEL_SI2_0_MASK             (0x300U)
#define ADC_CWSELRSI_WSEL_SI2_0_SHIFT            (8U)
/*! WSEL_SI2_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI2_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI2_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI2_0_MASK)

#define ADC_CWSELRSI_WSEL_SI2_1_MASK             (0x300U)
#define ADC_CWSELRSI_WSEL_SI2_1_SHIFT            (8U)
/*! WSEL_SI2_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI2_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI2_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI2_1_MASK)

#define ADC_CWSELRSI_WSEL_SI2_2_MASK             (0x300U)
#define ADC_CWSELRSI_WSEL_SI2_2_SHIFT            (8U)
/*! WSEL_SI2_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI2_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI2_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI2_2_MASK)

#define ADC_CWSELRSI_WSEL_SI3_0_MASK             (0x3000U)
#define ADC_CWSELRSI_WSEL_SI3_0_SHIFT            (12U)
/*! WSEL_SI3_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI3_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI3_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI3_0_MASK)

#define ADC_CWSELRSI_WSEL_SI3_1_MASK             (0x3000U)
#define ADC_CWSELRSI_WSEL_SI3_1_SHIFT            (12U)
/*! WSEL_SI3_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI3_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI3_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI3_1_MASK)

#define ADC_CWSELRSI_WSEL_SI3_2_MASK             (0x3000U)
#define ADC_CWSELRSI_WSEL_SI3_2_SHIFT            (12U)
/*! WSEL_SI3_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI3_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI3_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI3_2_MASK)

#define ADC_CWSELRSI_WSEL_SI4_0_MASK             (0x30000U)
#define ADC_CWSELRSI_WSEL_SI4_0_SHIFT            (16U)
/*! WSEL_SI4_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI4_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI4_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI4_0_MASK)

#define ADC_CWSELRSI_WSEL_SI4_1_MASK             (0x30000U)
#define ADC_CWSELRSI_WSEL_SI4_1_SHIFT            (16U)
/*! WSEL_SI4_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI4_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI4_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI4_1_MASK)

#define ADC_CWSELRSI_WSEL_SI4_2_MASK             (0x30000U)
#define ADC_CWSELRSI_WSEL_SI4_2_SHIFT            (16U)
/*! WSEL_SI4_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI4_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI4_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI4_2_MASK)

#define ADC_CWSELRSI_WSEL_SI5_0_MASK             (0x300000U)
#define ADC_CWSELRSI_WSEL_SI5_0_SHIFT            (20U)
/*! WSEL_SI5_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI5_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI5_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI5_0_MASK)

#define ADC_CWSELRSI_WSEL_SI5_1_MASK             (0x300000U)
#define ADC_CWSELRSI_WSEL_SI5_1_SHIFT            (20U)
/*! WSEL_SI5_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI5_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI5_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI5_1_MASK)

#define ADC_CWSELRSI_WSEL_SI5_2_MASK             (0x300000U)
#define ADC_CWSELRSI_WSEL_SI5_2_SHIFT            (20U)
/*! WSEL_SI5_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI5_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI5_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI5_2_MASK)

