zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CWSELRSI_WSEL_SI6_0_MASK             (0x3000000U)
#define ADC_CWSELRSI_WSEL_SI6_0_SHIFT            (24U)
/*! WSEL_SI6_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI6_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI6_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI6_0_MASK)

#define ADC_CWSELRSI_WSEL_SI6_1_MASK             (0x3000000U)
#define ADC_CWSELRSI_WSEL_SI6_1_SHIFT            (24U)
/*! WSEL_SI6_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI6_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI6_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI6_1_MASK)

#define ADC_CWSELRSI_WSEL_SI6_2_MASK             (0x3000000U)
#define ADC_CWSELRSI_WSEL_SI6_2_SHIFT            (24U)
/*! WSEL_SI6_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI6_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI6_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI6_2_MASK)

#define ADC_CWSELRSI_WSEL_SI7_0_MASK             (0x30000000U)
#define ADC_CWSELRSI_WSEL_SI7_0_SHIFT            (28U)
/*! WSEL_SI7_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI7_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI7_0_SHIFT)) & ADC_CWSELRSI_WSEL_SI7_0_MASK)

#define ADC_CWSELRSI_WSEL_SI7_1_MASK             (0x30000000U)
#define ADC_CWSELRSI_WSEL_SI7_1_SHIFT            (28U)
/*! WSEL_SI7_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI7_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI7_1_SHIFT)) & ADC_CWSELRSI_WSEL_SI7_1_MASK)

#define ADC_CWSELRSI_WSEL_SI7_2_MASK             (0x30000000U)
#define ADC_CWSELRSI_WSEL_SI7_2_SHIFT            (28U)
/*! WSEL_SI7_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELRSI_WSEL_SI7_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELRSI_WSEL_SI7_2_SHIFT)) & ADC_CWSELRSI_WSEL_SI7_2_MASK)
/*! @} */

/*! @name CWSELREI - Channel Analog Watchdog Select For External inputs */
/*! @{ */

#define ADC_CWSELREI_WSEL_SI0_0_MASK             (0x3U)
#define ADC_CWSELREI_WSEL_SI0_0_SHIFT            (0U)
/*! WSEL_SI0_0 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_0(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_0_SHIFT)) & ADC_CWSELREI_WSEL_SI0_0_MASK)

#define ADC_CWSELREI_WSEL_SI1_8_MASK             (0x3U)
#define ADC_CWSELREI_WSEL_SI1_8_SHIFT            (0U)
/*! WSEL_SI1_8 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_8(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_8_SHIFT)) & ADC_CWSELREI_WSEL_SI1_8_MASK)

#define ADC_CWSELREI_WSEL_SI2_16_MASK            (0x3U)
#define ADC_CWSELREI_WSEL_SI2_16_SHIFT           (0U)
/*! WSEL_SI2_16 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_16(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_16_SHIFT)) & ADC_CWSELREI_WSEL_SI2_16_MASK)

#define ADC_CWSELREI_WSEL_SI3_24_MASK            (0x3U)
#define ADC_CWSELREI_WSEL_SI3_24_SHIFT           (0U)
/*! WSEL_SI3_24 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_24(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_24_SHIFT)) & ADC_CWSELREI_WSEL_SI3_24_MASK)

#define ADC_CWSELREI_WSEL_SI0_1_MASK             (0x30U)
#define ADC_CWSELREI_WSEL_SI0_1_SHIFT            (4U)
/*! WSEL_SI0_1 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_1(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_1_SHIFT)) & ADC_CWSELREI_WSEL_SI0_1_MASK)

#define ADC_CWSELREI_WSEL_SI1_9_MASK             (0x30U)
#define ADC_CWSELREI_WSEL_SI1_9_SHIFT            (4U)
/*! WSEL_SI1_9 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_9(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_9_SHIFT)) & ADC_CWSELREI_WSEL_SI1_9_MASK)

#define ADC_CWSELREI_WSEL_SI2_17_MASK            (0x30U)
#define ADC_CWSELREI_WSEL_SI2_17_SHIFT           (4U)
/*! WSEL_SI2_17 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_17(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_17_SHIFT)) & ADC_CWSELREI_WSEL_SI2_17_MASK)

#define ADC_CWSELREI_WSEL_SI3_25_MASK            (0x30U)
#define ADC_CWSELREI_WSEL_SI3_25_SHIFT           (4U)
/*! WSEL_SI3_25 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_25(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_25_SHIFT)) & ADC_CWSELREI_WSEL_SI3_25_MASK)

