zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CWSELREI_WSEL_SI0_2_MASK             (0x300U)
#define ADC_CWSELREI_WSEL_SI0_2_SHIFT            (8U)
/*! WSEL_SI0_2 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_2(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_2_SHIFT)) & ADC_CWSELREI_WSEL_SI0_2_MASK)

#define ADC_CWSELREI_WSEL_SI1_10_MASK            (0x300U)
#define ADC_CWSELREI_WSEL_SI1_10_SHIFT           (8U)
/*! WSEL_SI1_10 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_10(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_10_SHIFT)) & ADC_CWSELREI_WSEL_SI1_10_MASK)

#define ADC_CWSELREI_WSEL_SI2_18_MASK            (0x300U)
#define ADC_CWSELREI_WSEL_SI2_18_SHIFT           (8U)
/*! WSEL_SI2_18 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_18(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_18_SHIFT)) & ADC_CWSELREI_WSEL_SI2_18_MASK)

#define ADC_CWSELREI_WSEL_SI3_26_MASK            (0x300U)
#define ADC_CWSELREI_WSEL_SI3_26_SHIFT           (8U)
/*! WSEL_SI3_26 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_26(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_26_SHIFT)) & ADC_CWSELREI_WSEL_SI3_26_MASK)

#define ADC_CWSELREI_WSEL_SI0_3_MASK             (0x3000U)
#define ADC_CWSELREI_WSEL_SI0_3_SHIFT            (12U)
/*! WSEL_SI0_3 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_3(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_3_SHIFT)) & ADC_CWSELREI_WSEL_SI0_3_MASK)

#define ADC_CWSELREI_WSEL_SI1_11_MASK            (0x3000U)
#define ADC_CWSELREI_WSEL_SI1_11_SHIFT           (12U)
/*! WSEL_SI1_11 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_11(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_11_SHIFT)) & ADC_CWSELREI_WSEL_SI1_11_MASK)

#define ADC_CWSELREI_WSEL_SI2_19_MASK            (0x3000U)
#define ADC_CWSELREI_WSEL_SI2_19_SHIFT           (12U)
/*! WSEL_SI2_19 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_19(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_19_SHIFT)) & ADC_CWSELREI_WSEL_SI2_19_MASK)

#define ADC_CWSELREI_WSEL_SI3_27_MASK            (0x3000U)
#define ADC_CWSELREI_WSEL_SI3_27_SHIFT           (12U)
/*! WSEL_SI3_27 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_27(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_27_SHIFT)) & ADC_CWSELREI_WSEL_SI3_27_MASK)

#define ADC_CWSELREI_WSEL_SI0_4_MASK             (0x30000U)
#define ADC_CWSELREI_WSEL_SI0_4_SHIFT            (16U)
/*! WSEL_SI0_4 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_4(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_4_SHIFT)) & ADC_CWSELREI_WSEL_SI0_4_MASK)

#define ADC_CWSELREI_WSEL_SI1_12_MASK            (0x30000U)
#define ADC_CWSELREI_WSEL_SI1_12_SHIFT           (16U)
/*! WSEL_SI1_12 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_12(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_12_SHIFT)) & ADC_CWSELREI_WSEL_SI1_12_MASK)

#define ADC_CWSELREI_WSEL_SI2_20_MASK            (0x30000U)
#define ADC_CWSELREI_WSEL_SI2_20_SHIFT           (16U)
/*! WSEL_SI2_20 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_20(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_20_SHIFT)) & ADC_CWSELREI_WSEL_SI2_20_MASK)

#define ADC_CWSELREI_WSEL_SI3_28_MASK            (0x30000U)
#define ADC_CWSELREI_WSEL_SI3_28_SHIFT           (16U)
/*! WSEL_SI3_28 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_28(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_28_SHIFT)) & ADC_CWSELREI_WSEL_SI3_28_MASK)

#define ADC_CWSELREI_WSEL_SI0_5_MASK             (0x300000U)
#define ADC_CWSELREI_WSEL_SI0_5_SHIFT            (20U)
/*! WSEL_SI0_5 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_5(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_5_SHIFT)) & ADC_CWSELREI_WSEL_SI0_5_MASK)

#define ADC_CWSELREI_WSEL_SI1_13_MASK            (0x300000U)
#define ADC_CWSELREI_WSEL_SI1_13_SHIFT           (20U)
/*! WSEL_SI1_13 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_13(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_13_SHIFT)) & ADC_CWSELREI_WSEL_SI1_13_MASK)

#define ADC_CWSELREI_WSEL_SI2_21_MASK            (0x300000U)
#define ADC_CWSELREI_WSEL_SI2_21_SHIFT           (20U)
/*! WSEL_SI2_21 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI2_21(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI2_21_SHIFT)) & ADC_CWSELREI_WSEL_SI2_21_MASK)

#define ADC_CWSELREI_WSEL_SI3_29_MASK            (0x300000U)
#define ADC_CWSELREI_WSEL_SI3_29_SHIFT           (20U)
/*! WSEL_SI3_29 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI3_29(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI3_29_SHIFT)) & ADC_CWSELREI_WSEL_SI3_29_MASK)

#define ADC_CWSELREI_WSEL_SI0_6_MASK             (0x3000000U)
#define ADC_CWSELREI_WSEL_SI0_6_SHIFT            (24U)
/*! WSEL_SI0_6 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI0_6(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI0_6_SHIFT)) & ADC_CWSELREI_WSEL_SI0_6_MASK)

#define ADC_CWSELREI_WSEL_SI1_14_MASK            (0x3000000U)
#define ADC_CWSELREI_WSEL_SI1_14_SHIFT           (24U)
/*! WSEL_SI1_14 - Analog Watchdog Selection
 *  0b00..Analog watchdog THRHLR0
 *  0b01..Analog watchdog THRHLR1
 *  0b10..Analog watchdog THRHLR2
 *  0b11..Analog watchdog THRHLR3
 */
#define ADC_CWSELREI_WSEL_SI1_14(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CWSELREI_WSEL_SI1_14_SHIFT)) & ADC_CWSELREI_WSEL_SI1_14_MASK)

