zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CWENR1_CWEN35_MASK                   (0x8U)
#define ADC_CWENR1_CWEN35_SHIFT                  (3U)
/*! CWEN35 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN35(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN35_SHIFT)) & ADC_CWENR1_CWEN35_MASK)

#define ADC_CWENR1_CWEN36_MASK                   (0x10U)
#define ADC_CWENR1_CWEN36_SHIFT                  (4U)
/*! CWEN36 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN36(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN36_SHIFT)) & ADC_CWENR1_CWEN36_MASK)

#define ADC_CWENR1_CWEN37_MASK                   (0x20U)
#define ADC_CWENR1_CWEN37_SHIFT                  (5U)
/*! CWEN37 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN37(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN37_SHIFT)) & ADC_CWENR1_CWEN37_MASK)

#define ADC_CWENR1_CWEN38_MASK                   (0x40U)
#define ADC_CWENR1_CWEN38_SHIFT                  (6U)
/*! CWEN38 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN38(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN38_SHIFT)) & ADC_CWENR1_CWEN38_MASK)

#define ADC_CWENR1_CWEN39_MASK                   (0x80U)
#define ADC_CWENR1_CWEN39_SHIFT                  (7U)
/*! CWEN39 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN39(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN39_SHIFT)) & ADC_CWENR1_CWEN39_MASK)

#define ADC_CWENR1_CWEN40_MASK                   (0x100U)
#define ADC_CWENR1_CWEN40_SHIFT                  (8U)
/*! CWEN40 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN40(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN40_SHIFT)) & ADC_CWENR1_CWEN40_MASK)

#define ADC_CWENR1_CWEN41_MASK                   (0x200U)
#define ADC_CWENR1_CWEN41_SHIFT                  (9U)
/*! CWEN41 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN41(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN41_SHIFT)) & ADC_CWENR1_CWEN41_MASK)

#define ADC_CWENR1_CWEN42_MASK                   (0x400U)
#define ADC_CWENR1_CWEN42_SHIFT                  (10U)
/*! CWEN42 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN42(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN42_SHIFT)) & ADC_CWENR1_CWEN42_MASK)

#define ADC_CWENR1_CWEN43_MASK                   (0x800U)
#define ADC_CWENR1_CWEN43_SHIFT                  (11U)
/*! CWEN43 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN43(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN43_SHIFT)) & ADC_CWENR1_CWEN43_MASK)

#define ADC_CWENR1_CWEN44_MASK                   (0x1000U)
#define ADC_CWENR1_CWEN44_SHIFT                  (12U)
/*! CWEN44 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN44(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN44_SHIFT)) & ADC_CWENR1_CWEN44_MASK)

#define ADC_CWENR1_CWEN45_MASK                   (0x2000U)
#define ADC_CWENR1_CWEN45_SHIFT                  (13U)
/*! CWEN45 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN45(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN45_SHIFT)) & ADC_CWENR1_CWEN45_MASK)

#define ADC_CWENR1_CWEN46_MASK                   (0x4000U)
#define ADC_CWENR1_CWEN46_SHIFT                  (14U)
/*! CWEN46 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN46(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN46_SHIFT)) & ADC_CWENR1_CWEN46_MASK)

#define ADC_CWENR1_CWEN47_MASK                   (0x8000U)
#define ADC_CWENR1_CWEN47_SHIFT                  (15U)
/*! CWEN47 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN47(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN47_SHIFT)) & ADC_CWENR1_CWEN47_MASK)

#define ADC_CWENR1_CWEN48_MASK                   (0x10000U)
#define ADC_CWENR1_CWEN48_SHIFT                  (16U)
/*! CWEN48 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN48(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN48_SHIFT)) & ADC_CWENR1_CWEN48_MASK)

#define ADC_CWENR1_CWEN49_MASK                   (0x20000U)
#define ADC_CWENR1_CWEN49_SHIFT                  (17U)
/*! CWEN49 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN49(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN49_SHIFT)) & ADC_CWENR1_CWEN49_MASK)

#define ADC_CWENR1_CWEN50_MASK                   (0x40000U)
#define ADC_CWENR1_CWEN50_SHIFT                  (18U)
/*! CWEN50 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN50(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN50_SHIFT)) & ADC_CWENR1_CWEN50_MASK)

#define ADC_CWENR1_CWEN51_MASK                   (0x80000U)
#define ADC_CWENR1_CWEN51_SHIFT                  (19U)
/*! CWEN51 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN51(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN51_SHIFT)) & ADC_CWENR1_CWEN51_MASK)

#define ADC_CWENR1_CWEN52_MASK                   (0x100000U)
#define ADC_CWENR1_CWEN52_SHIFT                  (20U)
/*! CWEN52 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN52(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN52_SHIFT)) & ADC_CWENR1_CWEN52_MASK)

#define ADC_CWENR1_CWEN53_MASK                   (0x200000U)
#define ADC_CWENR1_CWEN53_SHIFT                  (21U)
/*! CWEN53 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN53(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN53_SHIFT)) & ADC_CWENR1_CWEN53_MASK)

#define ADC_CWENR1_CWEN54_MASK                   (0x400000U)
#define ADC_CWENR1_CWEN54_SHIFT                  (22U)
/*! CWEN54 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN54(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN54_SHIFT)) & ADC_CWENR1_CWEN54_MASK)

#define ADC_CWENR1_CWEN55_MASK                   (0x800000U)
#define ADC_CWENR1_CWEN55_SHIFT                  (23U)
/*! CWEN55 - Channel Analog Watchdog Enable For Standard Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR1_CWEN55(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR1_CWEN55_SHIFT)) & ADC_CWENR1_CWEN55_MASK)
/*! @} */

/*! @name CWENR2 - Channel Watchdog Enable For External Inputs */
/*! @{ */

#define ADC_CWENR2_CWEN64_MASK                   (0x1U)
#define ADC_CWENR2_CWEN64_SHIFT                  (0U)
/*! CWEN64 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN64(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN64_SHIFT)) & ADC_CWENR2_CWEN64_MASK)

#define ADC_CWENR2_CWEN65_MASK                   (0x2U)
#define ADC_CWENR2_CWEN65_SHIFT                  (1U)
/*! CWEN65 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN65(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN65_SHIFT)) & ADC_CWENR2_CWEN65_MASK)

