zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CWENR2_CWEN66_MASK                   (0x4U)
#define ADC_CWENR2_CWEN66_SHIFT                  (2U)
/*! CWEN66 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN66(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN66_SHIFT)) & ADC_CWENR2_CWEN66_MASK)

#define ADC_CWENR2_CWEN67_MASK                   (0x8U)
#define ADC_CWENR2_CWEN67_SHIFT                  (3U)
/*! CWEN67 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN67(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN67_SHIFT)) & ADC_CWENR2_CWEN67_MASK)

#define ADC_CWENR2_CWEN68_MASK                   (0x10U)
#define ADC_CWENR2_CWEN68_SHIFT                  (4U)
/*! CWEN68 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN68(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN68_SHIFT)) & ADC_CWENR2_CWEN68_MASK)

#define ADC_CWENR2_CWEN69_MASK                   (0x20U)
#define ADC_CWENR2_CWEN69_SHIFT                  (5U)
/*! CWEN69 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN69(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN69_SHIFT)) & ADC_CWENR2_CWEN69_MASK)

#define ADC_CWENR2_CWEN70_MASK                   (0x40U)
#define ADC_CWENR2_CWEN70_SHIFT                  (6U)
/*! CWEN70 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN70(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN70_SHIFT)) & ADC_CWENR2_CWEN70_MASK)

#define ADC_CWENR2_CWEN71_MASK                   (0x80U)
#define ADC_CWENR2_CWEN71_SHIFT                  (7U)
/*! CWEN71 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN71(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN71_SHIFT)) & ADC_CWENR2_CWEN71_MASK)

#define ADC_CWENR2_CWEN72_MASK                   (0x100U)
#define ADC_CWENR2_CWEN72_SHIFT                  (8U)
/*! CWEN72 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN72(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN72_SHIFT)) & ADC_CWENR2_CWEN72_MASK)

#define ADC_CWENR2_CWEN73_MASK                   (0x200U)
#define ADC_CWENR2_CWEN73_SHIFT                  (9U)
/*! CWEN73 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN73(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN73_SHIFT)) & ADC_CWENR2_CWEN73_MASK)

#define ADC_CWENR2_CWEN74_MASK                   (0x400U)
#define ADC_CWENR2_CWEN74_SHIFT                  (10U)
/*! CWEN74 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN74(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN74_SHIFT)) & ADC_CWENR2_CWEN74_MASK)

#define ADC_CWENR2_CWEN75_MASK                   (0x800U)
#define ADC_CWENR2_CWEN75_SHIFT                  (11U)
/*! CWEN75 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN75(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN75_SHIFT)) & ADC_CWENR2_CWEN75_MASK)

#define ADC_CWENR2_CWEN76_MASK                   (0x1000U)
#define ADC_CWENR2_CWEN76_SHIFT                  (12U)
/*! CWEN76 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN76(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN76_SHIFT)) & ADC_CWENR2_CWEN76_MASK)

#define ADC_CWENR2_CWEN77_MASK                   (0x2000U)
#define ADC_CWENR2_CWEN77_SHIFT                  (13U)
/*! CWEN77 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN77(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN77_SHIFT)) & ADC_CWENR2_CWEN77_MASK)

#define ADC_CWENR2_CWEN78_MASK                   (0x4000U)
#define ADC_CWENR2_CWEN78_SHIFT                  (14U)
/*! CWEN78 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN78(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN78_SHIFT)) & ADC_CWENR2_CWEN78_MASK)

#define ADC_CWENR2_CWEN79_MASK                   (0x8000U)
#define ADC_CWENR2_CWEN79_SHIFT                  (15U)
/*! CWEN79 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN79(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN79_SHIFT)) & ADC_CWENR2_CWEN79_MASK)

#define ADC_CWENR2_CWEN80_MASK                   (0x10000U)
#define ADC_CWENR2_CWEN80_SHIFT                  (16U)
/*! CWEN80 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN80(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN80_SHIFT)) & ADC_CWENR2_CWEN80_MASK)

#define ADC_CWENR2_CWEN81_MASK                   (0x20000U)
#define ADC_CWENR2_CWEN81_SHIFT                  (17U)
/*! CWEN81 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN81(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN81_SHIFT)) & ADC_CWENR2_CWEN81_MASK)

#define ADC_CWENR2_CWEN82_MASK                   (0x40000U)
#define ADC_CWENR2_CWEN82_SHIFT                  (18U)
/*! CWEN82 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN82(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN82_SHIFT)) & ADC_CWENR2_CWEN82_MASK)

#define ADC_CWENR2_CWEN83_MASK                   (0x80000U)
#define ADC_CWENR2_CWEN83_SHIFT                  (19U)
/*! CWEN83 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN83(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN83_SHIFT)) & ADC_CWENR2_CWEN83_MASK)

#define ADC_CWENR2_CWEN84_MASK                   (0x100000U)
#define ADC_CWENR2_CWEN84_SHIFT                  (20U)
/*! CWEN84 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN84(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN84_SHIFT)) & ADC_CWENR2_CWEN84_MASK)

