zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_CWENR2_CWEN85_MASK                   (0x200000U)
#define ADC_CWENR2_CWEN85_SHIFT                  (21U)
/*! CWEN85 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN85(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN85_SHIFT)) & ADC_CWENR2_CWEN85_MASK)

#define ADC_CWENR2_CWEN86_MASK                   (0x400000U)
#define ADC_CWENR2_CWEN86_SHIFT                  (22U)
/*! CWEN86 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN86(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN86_SHIFT)) & ADC_CWENR2_CWEN86_MASK)

#define ADC_CWENR2_CWEN87_MASK                   (0x800000U)
#define ADC_CWENR2_CWEN87_SHIFT                  (23U)
/*! CWEN87 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN87(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN87_SHIFT)) & ADC_CWENR2_CWEN87_MASK)

#define ADC_CWENR2_CWEN88_MASK                   (0x1000000U)
#define ADC_CWENR2_CWEN88_SHIFT                  (24U)
/*! CWEN88 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN88(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN88_SHIFT)) & ADC_CWENR2_CWEN88_MASK)

#define ADC_CWENR2_CWEN89_MASK                   (0x2000000U)
#define ADC_CWENR2_CWEN89_SHIFT                  (25U)
/*! CWEN89 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN89(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN89_SHIFT)) & ADC_CWENR2_CWEN89_MASK)

#define ADC_CWENR2_CWEN90_MASK                   (0x4000000U)
#define ADC_CWENR2_CWEN90_SHIFT                  (26U)
/*! CWEN90 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN90(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN90_SHIFT)) & ADC_CWENR2_CWEN90_MASK)

#define ADC_CWENR2_CWEN91_MASK                   (0x8000000U)
#define ADC_CWENR2_CWEN91_SHIFT                  (27U)
/*! CWEN91 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN91(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN91_SHIFT)) & ADC_CWENR2_CWEN91_MASK)

#define ADC_CWENR2_CWEN92_MASK                   (0x10000000U)
#define ADC_CWENR2_CWEN92_SHIFT                  (28U)
/*! CWEN92 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN92(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN92_SHIFT)) & ADC_CWENR2_CWEN92_MASK)

#define ADC_CWENR2_CWEN93_MASK                   (0x20000000U)
#define ADC_CWENR2_CWEN93_SHIFT                  (29U)
/*! CWEN93 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN93(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN93_SHIFT)) & ADC_CWENR2_CWEN93_MASK)

#define ADC_CWENR2_CWEN94_MASK                   (0x40000000U)
#define ADC_CWENR2_CWEN94_SHIFT                  (30U)
/*! CWEN94 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN94(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN94_SHIFT)) & ADC_CWENR2_CWEN94_MASK)

#define ADC_CWENR2_CWEN95_MASK                   (0x80000000U)
#define ADC_CWENR2_CWEN95_SHIFT                  (31U)
/*! CWEN95 - Channel Analog Watchdog Enable For External Inputs
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CWENR2_CWEN95(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_CWENR2_CWEN95_SHIFT)) & ADC_CWENR2_CWEN95_MASK)
/*! @} */

/*! @name AWORR0 - Analog Watchdog Out Of Range For Precision Inputs */
/*! @{ */

#define ADC_AWORR0_AWOR_CH0_MASK                 (0x1U)
#define ADC_AWORR0_AWOR_CH0_SHIFT                (0U)
/*! AWOR_CH0 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH0_SHIFT)) & ADC_AWORR0_AWOR_CH0_MASK)

#define ADC_AWORR0_AWOR_CH1_MASK                 (0x2U)
#define ADC_AWORR0_AWOR_CH1_SHIFT                (1U)
/*! AWOR_CH1 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH1_SHIFT)) & ADC_AWORR0_AWOR_CH1_MASK)

#define ADC_AWORR0_AWOR_CH2_MASK                 (0x4U)
#define ADC_AWORR0_AWOR_CH2_SHIFT                (2U)
/*! AWOR_CH2 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH2_SHIFT)) & ADC_AWORR0_AWOR_CH2_MASK)

#define ADC_AWORR0_AWOR_CH3_MASK                 (0x8U)
#define ADC_AWORR0_AWOR_CH3_SHIFT                (3U)
/*! AWOR_CH3 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH3_SHIFT)) & ADC_AWORR0_AWOR_CH3_MASK)

#define ADC_AWORR0_AWOR_CH4_MASK                 (0x10U)
#define ADC_AWORR0_AWOR_CH4_SHIFT                (4U)
/*! AWOR_CH4 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH4_SHIFT)) & ADC_AWORR0_AWOR_CH4_MASK)

#define ADC_AWORR0_AWOR_CH5_MASK                 (0x20U)
#define ADC_AWORR0_AWOR_CH5_SHIFT                (5U)
/*! AWOR_CH5 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH5_SHIFT)) & ADC_AWORR0_AWOR_CH5_MASK)

#define ADC_AWORR0_AWOR_CH6_MASK                 (0x40U)
#define ADC_AWORR0_AWOR_CH6_SHIFT                (6U)
/*! AWOR_CH6 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH6_SHIFT)) & ADC_AWORR0_AWOR_CH6_MASK)

#define ADC_AWORR0_AWOR_CH7_MASK                 (0x80U)
#define ADC_AWORR0_AWOR_CH7_SHIFT                (7U)
/*! AWOR_CH7 - Analog Watchdog Out Of Range For Precision Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR0_AWOR_CH7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR0_AWOR_CH7_SHIFT)) & ADC_AWORR0_AWOR_CH7_MASK)
/*! @} */

