zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*! @name AWORR1 - Analog Watchdog Out Of Range For Standard Inputs */
/*! @{ */

#define ADC_AWORR1_AWOR_CH0_MASK                 (0x1U)
#define ADC_AWORR1_AWOR_CH0_SHIFT                (0U)
/*! AWOR_CH0 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH0_SHIFT)) & ADC_AWORR1_AWOR_CH0_MASK)

#define ADC_AWORR1_AWOR_CH1_MASK                 (0x2U)
#define ADC_AWORR1_AWOR_CH1_SHIFT                (1U)
/*! AWOR_CH1 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH1_SHIFT)) & ADC_AWORR1_AWOR_CH1_MASK)

#define ADC_AWORR1_AWOR_CH2_MASK                 (0x4U)
#define ADC_AWORR1_AWOR_CH2_SHIFT                (2U)
/*! AWOR_CH2 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH2_SHIFT)) & ADC_AWORR1_AWOR_CH2_MASK)

#define ADC_AWORR1_AWOR_CH3_MASK                 (0x8U)
#define ADC_AWORR1_AWOR_CH3_SHIFT                (3U)
/*! AWOR_CH3 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH3_SHIFT)) & ADC_AWORR1_AWOR_CH3_MASK)

#define ADC_AWORR1_AWOR_CH4_MASK                 (0x10U)
#define ADC_AWORR1_AWOR_CH4_SHIFT                (4U)
/*! AWOR_CH4 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH4_SHIFT)) & ADC_AWORR1_AWOR_CH4_MASK)

#define ADC_AWORR1_AWOR_CH5_MASK                 (0x20U)
#define ADC_AWORR1_AWOR_CH5_SHIFT                (5U)
/*! AWOR_CH5 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH5_SHIFT)) & ADC_AWORR1_AWOR_CH5_MASK)

#define ADC_AWORR1_AWOR_CH6_MASK                 (0x40U)
#define ADC_AWORR1_AWOR_CH6_SHIFT                (6U)
/*! AWOR_CH6 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH6_SHIFT)) & ADC_AWORR1_AWOR_CH6_MASK)

#define ADC_AWORR1_AWOR_CH7_MASK                 (0x80U)
#define ADC_AWORR1_AWOR_CH7_SHIFT                (7U)
/*! AWOR_CH7 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH7_SHIFT)) & ADC_AWORR1_AWOR_CH7_MASK)

#define ADC_AWORR1_AWOR_CH8_MASK                 (0x100U)
#define ADC_AWORR1_AWOR_CH8_SHIFT                (8U)
/*! AWOR_CH8 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH8_SHIFT)) & ADC_AWORR1_AWOR_CH8_MASK)

#define ADC_AWORR1_AWOR_CH9_MASK                 (0x200U)
#define ADC_AWORR1_AWOR_CH9_SHIFT                (9U)
/*! AWOR_CH9 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH9_SHIFT)) & ADC_AWORR1_AWOR_CH9_MASK)

#define ADC_AWORR1_AWOR_CH10_MASK                (0x400U)
#define ADC_AWORR1_AWOR_CH10_SHIFT               (10U)
/*! AWOR_CH10 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH10_SHIFT)) & ADC_AWORR1_AWOR_CH10_MASK)

#define ADC_AWORR1_AWOR_CH11_MASK                (0x800U)
#define ADC_AWORR1_AWOR_CH11_SHIFT               (11U)
/*! AWOR_CH11 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH11_SHIFT)) & ADC_AWORR1_AWOR_CH11_MASK)

#define ADC_AWORR1_AWOR_CH12_MASK                (0x1000U)
#define ADC_AWORR1_AWOR_CH12_SHIFT               (12U)
/*! AWOR_CH12 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH12_SHIFT)) & ADC_AWORR1_AWOR_CH12_MASK)

#define ADC_AWORR1_AWOR_CH13_MASK                (0x2000U)
#define ADC_AWORR1_AWOR_CH13_SHIFT               (13U)
/*! AWOR_CH13 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH13_SHIFT)) & ADC_AWORR1_AWOR_CH13_MASK)

#define ADC_AWORR1_AWOR_CH14_MASK                (0x4000U)
#define ADC_AWORR1_AWOR_CH14_SHIFT               (14U)
/*! AWOR_CH14 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH14_SHIFT)) & ADC_AWORR1_AWOR_CH14_MASK)

