zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_AWORR1_AWOR_CH15_MASK                (0x8000U)
#define ADC_AWORR1_AWOR_CH15_SHIFT               (15U)
/*! AWOR_CH15 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH15_SHIFT)) & ADC_AWORR1_AWOR_CH15_MASK)

#define ADC_AWORR1_AWOR_CH16_MASK                (0x10000U)
#define ADC_AWORR1_AWOR_CH16_SHIFT               (16U)
/*! AWOR_CH16 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH16_SHIFT)) & ADC_AWORR1_AWOR_CH16_MASK)

#define ADC_AWORR1_AWOR_CH17_MASK                (0x20000U)
#define ADC_AWORR1_AWOR_CH17_SHIFT               (17U)
/*! AWOR_CH17 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH17_SHIFT)) & ADC_AWORR1_AWOR_CH17_MASK)

#define ADC_AWORR1_AWOR_CH18_MASK                (0x40000U)
#define ADC_AWORR1_AWOR_CH18_SHIFT               (18U)
/*! AWOR_CH18 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH18_SHIFT)) & ADC_AWORR1_AWOR_CH18_MASK)

#define ADC_AWORR1_AWOR_CH19_MASK                (0x80000U)
#define ADC_AWORR1_AWOR_CH19_SHIFT               (19U)
/*! AWOR_CH19 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH19_SHIFT)) & ADC_AWORR1_AWOR_CH19_MASK)

#define ADC_AWORR1_AWOR_CH20_MASK                (0x100000U)
#define ADC_AWORR1_AWOR_CH20_SHIFT               (20U)
/*! AWOR_CH20 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH20_SHIFT)) & ADC_AWORR1_AWOR_CH20_MASK)

#define ADC_AWORR1_AWOR_CH21_MASK                (0x200000U)
#define ADC_AWORR1_AWOR_CH21_SHIFT               (21U)
/*! AWOR_CH21 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH21_SHIFT)) & ADC_AWORR1_AWOR_CH21_MASK)

#define ADC_AWORR1_AWOR_CH22_MASK                (0x400000U)
#define ADC_AWORR1_AWOR_CH22_SHIFT               (22U)
/*! AWOR_CH22 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH22_SHIFT)) & ADC_AWORR1_AWOR_CH22_MASK)

#define ADC_AWORR1_AWOR_CH23_MASK                (0x800000U)
#define ADC_AWORR1_AWOR_CH23_SHIFT               (23U)
/*! AWOR_CH23 - Analog Watchdog Out Of Range For Standard Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR1_AWOR_CH23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR1_AWOR_CH23_SHIFT)) & ADC_AWORR1_AWOR_CH23_MASK)
/*! @} */

/*! @name AWORR2 - Analog Watchdog Out Of Range For External Inputs */
/*! @{ */

#define ADC_AWORR2_AWOR_CH0_MASK                 (0x1U)
#define ADC_AWORR2_AWOR_CH0_SHIFT                (0U)
/*! AWOR_CH0 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH0_SHIFT)) & ADC_AWORR2_AWOR_CH0_MASK)

#define ADC_AWORR2_AWOR_CH1_MASK                 (0x2U)
#define ADC_AWORR2_AWOR_CH1_SHIFT                (1U)
/*! AWOR_CH1 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH1_SHIFT)) & ADC_AWORR2_AWOR_CH1_MASK)

#define ADC_AWORR2_AWOR_CH2_MASK                 (0x4U)
#define ADC_AWORR2_AWOR_CH2_SHIFT                (2U)
/*! AWOR_CH2 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH2_SHIFT)) & ADC_AWORR2_AWOR_CH2_MASK)

#define ADC_AWORR2_AWOR_CH3_MASK                 (0x8U)
#define ADC_AWORR2_AWOR_CH3_SHIFT                (3U)
/*! AWOR_CH3 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH3(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH3_SHIFT)) & ADC_AWORR2_AWOR_CH3_MASK)

#define ADC_AWORR2_AWOR_CH4_MASK                 (0x10U)
#define ADC_AWORR2_AWOR_CH4_SHIFT                (4U)
/*! AWOR_CH4 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH4(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH4_SHIFT)) & ADC_AWORR2_AWOR_CH4_MASK)

#define ADC_AWORR2_AWOR_CH5_MASK                 (0x20U)
#define ADC_AWORR2_AWOR_CH5_SHIFT                (5U)
/*! AWOR_CH5 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH5(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH5_SHIFT)) & ADC_AWORR2_AWOR_CH5_MASK)

#define ADC_AWORR2_AWOR_CH6_MASK                 (0x40U)
#define ADC_AWORR2_AWOR_CH6_SHIFT                (6U)
/*! AWOR_CH6 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH6(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH6_SHIFT)) & ADC_AWORR2_AWOR_CH6_MASK)

#define ADC_AWORR2_AWOR_CH7_MASK                 (0x80U)
#define ADC_AWORR2_AWOR_CH7_SHIFT                (7U)
/*! AWOR_CH7 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH7(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH7_SHIFT)) & ADC_AWORR2_AWOR_CH7_MASK)

#define ADC_AWORR2_AWOR_CH8_MASK                 (0x100U)
#define ADC_AWORR2_AWOR_CH8_SHIFT                (8U)
/*! AWOR_CH8 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH8(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH8_SHIFT)) & ADC_AWORR2_AWOR_CH8_MASK)

#define ADC_AWORR2_AWOR_CH9_MASK                 (0x200U)
#define ADC_AWORR2_AWOR_CH9_SHIFT                (9U)
/*! AWOR_CH9 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH9(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH9_SHIFT)) & ADC_AWORR2_AWOR_CH9_MASK)

