zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_AWORR2_AWOR_CH10_MASK                (0x400U)
#define ADC_AWORR2_AWOR_CH10_SHIFT               (10U)
/*! AWOR_CH10 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH10(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH10_SHIFT)) & ADC_AWORR2_AWOR_CH10_MASK)

#define ADC_AWORR2_AWOR_CH11_MASK                (0x800U)
#define ADC_AWORR2_AWOR_CH11_SHIFT               (11U)
/*! AWOR_CH11 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH11(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH11_SHIFT)) & ADC_AWORR2_AWOR_CH11_MASK)

#define ADC_AWORR2_AWOR_CH12_MASK                (0x1000U)
#define ADC_AWORR2_AWOR_CH12_SHIFT               (12U)
/*! AWOR_CH12 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH12(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH12_SHIFT)) & ADC_AWORR2_AWOR_CH12_MASK)

#define ADC_AWORR2_AWOR_CH13_MASK                (0x2000U)
#define ADC_AWORR2_AWOR_CH13_SHIFT               (13U)
/*! AWOR_CH13 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH13(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH13_SHIFT)) & ADC_AWORR2_AWOR_CH13_MASK)

#define ADC_AWORR2_AWOR_CH14_MASK                (0x4000U)
#define ADC_AWORR2_AWOR_CH14_SHIFT               (14U)
/*! AWOR_CH14 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH14(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH14_SHIFT)) & ADC_AWORR2_AWOR_CH14_MASK)

#define ADC_AWORR2_AWOR_CH15_MASK                (0x8000U)
#define ADC_AWORR2_AWOR_CH15_SHIFT               (15U)
/*! AWOR_CH15 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH15(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH15_SHIFT)) & ADC_AWORR2_AWOR_CH15_MASK)

#define ADC_AWORR2_AWOR_CH16_MASK                (0x10000U)
#define ADC_AWORR2_AWOR_CH16_SHIFT               (16U)
/*! AWOR_CH16 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH16(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH16_SHIFT)) & ADC_AWORR2_AWOR_CH16_MASK)

#define ADC_AWORR2_AWOR_CH17_MASK                (0x20000U)
#define ADC_AWORR2_AWOR_CH17_SHIFT               (17U)
/*! AWOR_CH17 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH17(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH17_SHIFT)) & ADC_AWORR2_AWOR_CH17_MASK)

#define ADC_AWORR2_AWOR_CH18_MASK                (0x40000U)
#define ADC_AWORR2_AWOR_CH18_SHIFT               (18U)
/*! AWOR_CH18 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH18(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH18_SHIFT)) & ADC_AWORR2_AWOR_CH18_MASK)

#define ADC_AWORR2_AWOR_CH19_MASK                (0x80000U)
#define ADC_AWORR2_AWOR_CH19_SHIFT               (19U)
/*! AWOR_CH19 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH19(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH19_SHIFT)) & ADC_AWORR2_AWOR_CH19_MASK)

#define ADC_AWORR2_AWOR_CH20_MASK                (0x100000U)
#define ADC_AWORR2_AWOR_CH20_SHIFT               (20U)
/*! AWOR_CH20 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH20(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH20_SHIFT)) & ADC_AWORR2_AWOR_CH20_MASK)

#define ADC_AWORR2_AWOR_CH21_MASK                (0x200000U)
#define ADC_AWORR2_AWOR_CH21_SHIFT               (21U)
/*! AWOR_CH21 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH21(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH21_SHIFT)) & ADC_AWORR2_AWOR_CH21_MASK)

#define ADC_AWORR2_AWOR_CH22_MASK                (0x400000U)
#define ADC_AWORR2_AWOR_CH22_SHIFT               (22U)
/*! AWOR_CH22 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH22(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH22_SHIFT)) & ADC_AWORR2_AWOR_CH22_MASK)

#define ADC_AWORR2_AWOR_CH23_MASK                (0x800000U)
#define ADC_AWORR2_AWOR_CH23_SHIFT               (23U)
/*! AWOR_CH23 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH23(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH23_SHIFT)) & ADC_AWORR2_AWOR_CH23_MASK)

#define ADC_AWORR2_AWOR_CH24_MASK                (0x1000000U)
#define ADC_AWORR2_AWOR_CH24_SHIFT               (24U)
/*! AWOR_CH24 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH24(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH24_SHIFT)) & ADC_AWORR2_AWOR_CH24_MASK)

#define ADC_AWORR2_AWOR_CH25_MASK                (0x2000000U)
#define ADC_AWORR2_AWOR_CH25_SHIFT               (25U)
/*! AWOR_CH25 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH25(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH25_SHIFT)) & ADC_AWORR2_AWOR_CH25_MASK)

#define ADC_AWORR2_AWOR_CH26_MASK                (0x4000000U)
#define ADC_AWORR2_AWOR_CH26_SHIFT               (26U)
/*! AWOR_CH26 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH26(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH26_SHIFT)) & ADC_AWORR2_AWOR_CH26_MASK)

#define ADC_AWORR2_AWOR_CH27_MASK                (0x8000000U)
#define ADC_AWORR2_AWOR_CH27_SHIFT               (27U)
/*! AWOR_CH27 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH27(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH27_SHIFT)) & ADC_AWORR2_AWOR_CH27_MASK)

#define ADC_AWORR2_AWOR_CH28_MASK                (0x10000000U)
#define ADC_AWORR2_AWOR_CH28_SHIFT               (28U)
/*! AWOR_CH28 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH28(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH28_SHIFT)) & ADC_AWORR2_AWOR_CH28_MASK)

