zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_AWORR2_AWOR_CH29_MASK                (0x20000000U)
#define ADC_AWORR2_AWOR_CH29_SHIFT               (29U)
/*! AWOR_CH29 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH29(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH29_SHIFT)) & ADC_AWORR2_AWOR_CH29_MASK)

#define ADC_AWORR2_AWOR_CH30_MASK                (0x40000000U)
#define ADC_AWORR2_AWOR_CH30_SHIFT               (30U)
/*! AWOR_CH30 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH30(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH30_SHIFT)) & ADC_AWORR2_AWOR_CH30_MASK)

#define ADC_AWORR2_AWOR_CH31_MASK                (0x80000000U)
#define ADC_AWORR2_AWOR_CH31_SHIFT               (31U)
/*! AWOR_CH31 - Analog Watchdog Out Of Range For External Inputs
 *  0b0..Conversion is within limits
 *  0b0..No effect
 *  0b1..Clears flag
 *  0b1..Conversion is not within limits
 */
#define ADC_AWORR2_AWOR_CH31(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_AWORR2_AWOR_CH31_SHIFT)) & ADC_AWORR2_AWOR_CH31_MASK)
/*! @} */

/*! @name STCR1 - Self-Test Configuration 1 */
/*! @{ */

#define ADC_STCR1_INPSAMP_S_MASK                 (0xFF00U)
#define ADC_STCR1_INPSAMP_S_SHIFT                (8U)
/*! INPSAMP_S - Input Sampling Time Algorithm S */
#define ADC_STCR1_INPSAMP_S(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR1_INPSAMP_S_SHIFT)) & ADC_STCR1_INPSAMP_S_MASK)

#define ADC_STCR1_INPSAMP_C_MASK                 (0xFF000000U)
#define ADC_STCR1_INPSAMP_C_SHIFT                (24U)
/*! INPSAMP_C - Input Sampling Time Algorithm C */
#define ADC_STCR1_INPSAMP_C(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR1_INPSAMP_C_SHIFT)) & ADC_STCR1_INPSAMP_C_MASK)
/*! @} */

/*! @name STCR2 - Self-Test Configuration 2 */
/*! @{ */

#define ADC_STCR2_FMA_S_MASK                     (0x1U)
#define ADC_STCR2_FMA_S_SHIFT                    (0U)
/*! FMA_S - Fault Mapping Algorithm S
 *  0b0..Noncritical fault line
 *  0b1..Critical fault line
 */
#define ADC_STCR2_FMA_S(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_FMA_S_SHIFT)) & ADC_STCR2_FMA_S_MASK)

#define ADC_STCR2_FMA_C_MASK                     (0x4U)
#define ADC_STCR2_FMA_C_SHIFT                    (2U)
/*! FMA_C - Fault Mapping Algorithm C
 *  0b0..Noncritical fault line
 *  0b1..Critical fault line
 */
#define ADC_STCR2_FMA_C(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_FMA_C_SHIFT)) & ADC_STCR2_FMA_C_MASK)

#define ADC_STCR2_FMA_WDTERR_MASK                (0x8U)
#define ADC_STCR2_FMA_WDTERR_SHIFT               (3U)
/*! FMA_WDTERR - Fault Mapping Self-Test Watchdog Timer Error
 *  0b0..Noncritical fault line
 *  0b1..Critical fault line
 */
#define ADC_STCR2_FMA_WDTERR(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_FMA_WDTERR_SHIFT)) & ADC_STCR2_FMA_WDTERR_MASK)

#define ADC_STCR2_FMA_WDSERR_MASK                (0x10U)
#define ADC_STCR2_FMA_WDSERR_SHIFT               (4U)
/*! FMA_WDSERR - Fault Mapping Self-Test Watchdog Sequence Error
 *  0b0..Noncritical fault line
 *  0b1..Critical fault line
 */
#define ADC_STCR2_FMA_WDSERR(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_FMA_WDSERR_SHIFT)) & ADC_STCR2_FMA_WDSERR_MASK)

#define ADC_STCR2_EN_MASK                        (0x80U)
#define ADC_STCR2_EN_SHIFT                       (7U)
/*! EN - Self-Test Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STCR2_EN(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_EN_SHIFT)) & ADC_STCR2_EN_MASK)

#define ADC_STCR2_MSKERR_S0_MASK                 (0x800U)
#define ADC_STCR2_MSKERR_S0_SHIFT                (11U)
/*! MSKERR_S0 - Mask Error Interrupt Algorithm S0
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKERR_S0(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKERR_S0_SHIFT)) & ADC_STCR2_MSKERR_S0_MASK)

#define ADC_STCR2_MSKERR_S1_MASK                 (0x1000U)
#define ADC_STCR2_MSKERR_S1_SHIFT                (12U)
/*! MSKERR_S1 - Mask Error Interrupt Algorithm S1
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKERR_S1(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKERR_S1_SHIFT)) & ADC_STCR2_MSKERR_S1_MASK)

#define ADC_STCR2_MSKERR_S2_MASK                 (0x2000U)
#define ADC_STCR2_MSKERR_S2_SHIFT                (13U)
/*! MSKERR_S2 - Mask Error Interrupt Algorithm S2
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKERR_S2(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKERR_S2_SHIFT)) & ADC_STCR2_MSKERR_S2_MASK)

#define ADC_STCR2_MSKERR_C_MASK                  (0x8000U)
#define ADC_STCR2_MSKERR_C_SHIFT                 (15U)
/*! MSKERR_C - Mask Error Interrupt Algorithm C
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKERR_C(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKERR_C_SHIFT)) & ADC_STCR2_MSKERR_C_MASK)

#define ADC_STCR2_MSKWDG_EOA_S_MASK              (0x10000U)
#define ADC_STCR2_MSKWDG_EOA_S_SHIFT             (16U)
/*! MSKWDG_EOA_S - Mask Error Interrupt End Of Algorithm S
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKWDG_EOA_S(x)                (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKWDG_EOA_S_SHIFT)) & ADC_STCR2_MSKWDG_EOA_S_MASK)

#define ADC_STCR2_MSKWDG_EOA_C_MASK              (0x40000U)
#define ADC_STCR2_MSKWDG_EOA_C_SHIFT             (18U)
/*! MSKWDG_EOA_C - Mask Error Interrupt End Of Algorithm C
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKWDG_EOA_C(x)                (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKWDG_EOA_C_SHIFT)) & ADC_STCR2_MSKWDG_EOA_C_MASK)

#define ADC_STCR2_MSKST_EOC_MASK                 (0x800000U)
#define ADC_STCR2_MSKST_EOC_SHIFT                (23U)
/*! MSKST_EOC - Mask Interrupt Self-Test End Of Conversion
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKST_EOC(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKST_EOC_SHIFT)) & ADC_STCR2_MSKST_EOC_MASK)

#define ADC_STCR2_MSKWDTERR_MASK                 (0x2000000U)
#define ADC_STCR2_MSKWDTERR_SHIFT                (25U)
/*! MSKWDTERR - Mask Interrupt Self-Test Watchdog Timer Error
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKWDTERR(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKWDTERR_SHIFT)) & ADC_STCR2_MSKWDTERR_MASK)

#define ADC_STCR2_SERR_MASK                      (0x4000000U)
#define ADC_STCR2_SERR_SHIFT                     (26U)
/*! SERR - Self-Test Error Injection
 *  0b0..Error can be injected
 *  0b0..No effect
 *  0b1..Error is being injected
 *  0b1..Injects a self-test error
 */
#define ADC_STCR2_SERR(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_SERR_SHIFT)) & ADC_STCR2_SERR_MASK)

