zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
#define ADC_STCR2_MSKWDSERR_MASK                 (0x8000000U)
#define ADC_STCR2_MSKWDSERR_SHIFT                (27U)
/*! MSKWDSERR - Mask Interrupt Self-Test Watchdog Sequence Error
 *  0b0..No interrupt is generated
 *  0b1..Interrupt is generated
 */
#define ADC_STCR2_MSKWDSERR(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STCR2_MSKWDSERR_SHIFT)) & ADC_STCR2_MSKWDSERR_MASK)
/*! @} */

/*! @name STCR3 - Self-Test Configuration 3 */
/*! @{ */

#define ADC_STCR3_MSTEP_MASK                     (0x1FU)
#define ADC_STCR3_MSTEP_SHIFT                    (0U)
/*! MSTEP - Algorithm Step */
#define ADC_STCR3_MSTEP(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STCR3_MSTEP_SHIFT)) & ADC_STCR3_MSTEP_MASK)

#define ADC_STCR3_ALG_MASK                       (0x300U)
#define ADC_STCR3_ALG_SHIFT                      (8U)
/*! ALG - Algorithm Selection */
#define ADC_STCR3_ALG(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_STCR3_ALG_SHIFT)) & ADC_STCR3_ALG_MASK)
/*! @} */

/*! @name STBRR - Self-Test Baud Rate */
/*! @{ */

#define ADC_STBRR_BR_MASK                        (0xFFU)
#define ADC_STBRR_BR_SHIFT                       (0U)
/*! BR - Baud Rate
 *  0b00000000..A step of the selected self-test algorithm is executed every time after the set of selected inputs has been converted.
 *  0b11111111..A step of the selected self-test algorithm is executed after the set of selected inputs has been converted 256 times.
 */
#define ADC_STBRR_BR(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_STBRR_BR_SHIFT)) & ADC_STBRR_BR_MASK)

#define ADC_STBRR_WDT_MASK                       (0x70000U)
#define ADC_STBRR_WDT_SHIFT                      (16U)
/*! WDT - Self-Test Watchdog Timer
 *  0b000..8192 conversion clock cycles (~0.1 ms at 80 MHz)
 *  0b001..39,936 conversion clock cycles (~0.5 ms at 80 MHz)
 *  0b010..79,872 conversion clock cycles (~1 ms at 80 MHz)
 *  0b011..159,744 conversion clock cycles (~2 ms at 80 MHz)
 *  0b100..400,384 conversion clock cycles (~5 ms at 80 MHz)
 *  0b101..799,744 conversion clock cycles (~10 ms at 80 MHz)
 *  0b110..‭1,599,488‬ conversion clock cycles (~20 ms at 80 MHz)
 *  0b111..‭3,999,744‬‬ conversion clock cycles (~50 ms at 80 MHz)
 */
#define ADC_STBRR_WDT(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_STBRR_WDT_SHIFT)) & ADC_STBRR_WDT_MASK)
/*! @} */

/*! @name STSR1 - Self-Test Status 1 */
/*! @{ */

#define ADC_STSR1_STEP_C_MASK                    (0x3E0U)
#define ADC_STSR1_STEP_C_SHIFT                   (5U)
/*! STEP_C - Step Of Algorithm C */
#define ADC_STSR1_STEP_C(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_STEP_C_SHIFT)) & ADC_STSR1_STEP_C_MASK)

#define ADC_STSR1_ERR_S0_MASK                    (0x800U)
#define ADC_STSR1_ERR_S0_SHIFT                   (11U)
/*! ERR_S0 - Error Algorithm S Step 0
 *  0b0..No effect
 *  0b0..No error
 *  0b1..Clears flag
 *  0b1..Error
 */
#define ADC_STSR1_ERR_S0(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_ERR_S0_SHIFT)) & ADC_STSR1_ERR_S0_MASK)

#define ADC_STSR1_ERR_S1_MASK                    (0x1000U)
#define ADC_STSR1_ERR_S1_SHIFT                   (12U)
/*! ERR_S1 - Error Algorithm S Step 1
 *  0b0..No effect
 *  0b0..No error
 *  0b1..Clears flag
 *  0b1..Error
 */
#define ADC_STSR1_ERR_S1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_ERR_S1_SHIFT)) & ADC_STSR1_ERR_S1_MASK)

#define ADC_STSR1_ERR_S2_MASK                    (0x2000U)
#define ADC_STSR1_ERR_S2_SHIFT                   (13U)
/*! ERR_S2 - Error Algorithm S Step 2
 *  0b0..No effect
 *  0b0..No error
 *  0b1..Clears flag
 *  0b1..Error
 */
#define ADC_STSR1_ERR_S2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_ERR_S2_SHIFT)) & ADC_STSR1_ERR_S2_MASK)

#define ADC_STSR1_ERR_C_MASK                     (0x8000U)
#define ADC_STSR1_ERR_C_SHIFT                    (15U)
/*! ERR_C - Error Algorithm C
 *  0b0..No effect
 *  0b0..No error
 *  0b1..Clears flag
 *  0b1..Error
 */
#define ADC_STSR1_ERR_C(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_ERR_C_SHIFT)) & ADC_STSR1_ERR_C_MASK)

#define ADC_STSR1_WDG_EOA_S_MASK                 (0x10000U)
#define ADC_STSR1_WDG_EOA_S_SHIFT                (16U)
/*! WDG_EOA_S - Self-Test Watchdog End Of Algorithm S
 *  0b0..No effect
 *  0b0..Not complete
 *  0b1..Clears flag
 *  0b1..Complete
 */
#define ADC_STSR1_WDG_EOA_S(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_WDG_EOA_S_SHIFT)) & ADC_STSR1_WDG_EOA_S_MASK)

#define ADC_STSR1_WDG_EOA_C_MASK                 (0x40000U)
#define ADC_STSR1_WDG_EOA_C_SHIFT                (18U)
/*! WDG_EOA_C - Self-Test Watchdog End Of Algorithm C
 *  0b0..No effect
 *  0b0..Not complete
 *  0b1..Clears flag
 *  0b1..Complete
 */
#define ADC_STSR1_WDG_EOA_C(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_WDG_EOA_C_SHIFT)) & ADC_STSR1_WDG_EOA_C_MASK)

#define ADC_STSR1_ST_EOC_MASK                    (0x800000U)
#define ADC_STSR1_ST_EOC_SHIFT                   (23U)
/*! ST_EOC - Self-Test End Of Conversion
 *  0b0..No effect
 *  0b0..Not complete
 *  0b1..Clears flag
 *  0b1..Complete
 */
#define ADC_STSR1_ST_EOC(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_ST_EOC_SHIFT)) & ADC_STSR1_ST_EOC_MASK)

#define ADC_STSR1_OVERWR_MASK                    (0x1000000U)
#define ADC_STSR1_OVERWR_SHIFT                   (24U)
/*! OVERWR - Self-Test Error Status Overwrite
 *  0b0..No effect
 *  0b0..No self-test error status flag overwritten
 *  0b1..Clears flag
 *  0b1..Self-test error status flag overwritten
 */
#define ADC_STSR1_OVERWR(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_OVERWR_SHIFT)) & ADC_STSR1_OVERWR_MASK)

#define ADC_STSR1_WDTERR_MASK                    (0x2000000U)
#define ADC_STSR1_WDTERR_SHIFT                   (25U)
/*! WDTERR - Self-Test Watchdog Timer Error
 *  0b0..Algorithm finished within the safe time period (or safe time period not yet elapsed).
 *  0b0..No effect
 *  0b1..Algorithm did not finish within safe time period.
 *  0b1..Clears flag
 */
#define ADC_STSR1_WDTERR(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_WDTERR_SHIFT)) & ADC_STSR1_WDTERR_MASK)

#define ADC_STSR1_WDSERR_MASK                    (0x8000000U)
#define ADC_STSR1_WDSERR_SHIFT                   (27U)
/*! WDSERR - Self-Test Watchdog Sequence Error
 *  0b0..Algorithm executed in correct sequence
 *  0b0..No effect
 *  0b1..Algorithm did not execute in correct sequence
 *  0b1..Clears flag
 */
#define ADC_STSR1_WDSERR(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STSR1_WDSERR_SHIFT)) & ADC_STSR1_WDSERR_MASK)
/*! @} */

/*! @name STSR2 - Self-Test Status 2 */
/*! @{ */

#define ADC_STSR2_DATA0_MASK                     (0x7FFFU)
#define ADC_STSR2_DATA0_SHIFT                    (0U)
/*! DATA0 - Conversion Data ERR_S1 */
#define ADC_STSR2_DATA0(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STSR2_DATA0_SHIFT)) & ADC_STSR2_DATA0_MASK)
/*! @} */

/*! @name STSR3 - Self-Test Status 3 */
/*! @{ */

#define ADC_STSR3_DATA0_MASK                     (0x7FFFU)
#define ADC_STSR3_DATA0_SHIFT                    (0U)
/*! DATA0 - Conversion Data ERR_S0 */
#define ADC_STSR3_DATA0(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STSR3_DATA0_SHIFT)) & ADC_STSR3_DATA0_MASK)

#define ADC_STSR3_DATA1_MASK                     (0x7FFF0000U)
#define ADC_STSR3_DATA1_SHIFT                    (16U)
/*! DATA1 - Conversion Data ERR_S2 */
#define ADC_STSR3_DATA1(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STSR3_DATA1_SHIFT)) & ADC_STSR3_DATA1_MASK)
/*! @} */

