zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*! @name STSR4 - Self-Test Status 4 */
/*! @{ */

#define ADC_STSR4_DATA1_MASK                     (0x7FFF0000U)
#define ADC_STSR4_DATA1_SHIFT                    (16U)
/*! DATA1 - Conversion Data ERR_C */
#define ADC_STSR4_DATA1(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STSR4_DATA1_SHIFT)) & ADC_STSR4_DATA1_MASK)
/*! @} */

/*! @name STDR1 - Self-Test Conversion Data 1 */
/*! @{ */

#define ADC_STDR1_TCDATA_MASK                    (0x7FFFU)
#define ADC_STDR1_TCDATA_SHIFT                   (0U)
/*! TCDATA - Test Channel Conversion Data */
#define ADC_STDR1_TCDATA(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STDR1_TCDATA_SHIFT)) & ADC_STDR1_TCDATA_MASK)

#define ADC_STDR1_OWERWR_MASK                    (0x40000U)
#define ADC_STDR1_OWERWR_SHIFT                   (18U)
/*! OWERWR - Conversion Data Overwrite Status
 *  0b0..Current conversion data not overwritten
 *  0b1..Current conversion data was overwritten
 */
#define ADC_STDR1_OWERWR(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_STDR1_OWERWR_SHIFT)) & ADC_STDR1_OWERWR_MASK)

#define ADC_STDR1_VALID_MASK                     (0x80000U)
#define ADC_STDR1_VALID_SHIFT                    (19U)
/*! VALID - Valid Conversion Data
 *  0b0..No unread conversion data
 *  0b1..Unread conversion data is available
 */
#define ADC_STDR1_VALID(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STDR1_VALID_SHIFT)) & ADC_STDR1_VALID_MASK)
/*! @} */

/*! @name STAW0R - Self-Test Analog Watchdog S0 */
/*! @{ */

#define ADC_STAW0R_THRL_MASK                     (0x7FFFU)
#define ADC_STAW0R_THRL_SHIFT                    (0U)
/*! THRL - Lower Threshold Value */
#define ADC_STAW0R_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW0R_THRL_SHIFT)) & ADC_STAW0R_THRL_MASK)

#define ADC_STAW0R_THRH_MASK                     (0x3FFF0000U)
#define ADC_STAW0R_THRH_SHIFT                    (16U)
/*! THRH - Higher Threshold Value */
#define ADC_STAW0R_THRH(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW0R_THRH_SHIFT)) & ADC_STAW0R_THRH_MASK)

#define ADC_STAW0R_WDTE_MASK                     (0x40000000U)
#define ADC_STAW0R_WDTE_SHIFT                    (30U)
/*! WDTE - Self-Test Watchdog Timer Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW0R_WDTE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW0R_WDTE_SHIFT)) & ADC_STAW0R_WDTE_MASK)

#define ADC_STAW0R_AWDE_MASK                     (0x80000000U)
#define ADC_STAW0R_AWDE_SHIFT                    (31U)
/*! AWDE - Self-Test Watchdog Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW0R_AWDE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW0R_AWDE_SHIFT)) & ADC_STAW0R_AWDE_MASK)
/*! @} */

/*! @name STAW1R - Self-Test Analog Watchdog S1 */
/*! @{ */

#define ADC_STAW1R_THRL_MASK                     (0x7FFFU)
#define ADC_STAW1R_THRL_SHIFT                    (0U)
/*! THRL - Lower Threshold Value */
#define ADC_STAW1R_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW1R_THRL_SHIFT)) & ADC_STAW1R_THRL_MASK)

#define ADC_STAW1R_AWDE_MASK                     (0x80000000U)
#define ADC_STAW1R_AWDE_SHIFT                    (31U)
/*! AWDE - Self-Test Watchdog Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW1R_AWDE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW1R_AWDE_SHIFT)) & ADC_STAW1R_AWDE_MASK)
/*! @} */

/*! @name STAW2R - Self-Test Analog Watchdog S2 */
/*! @{ */

#define ADC_STAW2R_THRL_MASK                     (0x7FFFU)
#define ADC_STAW2R_THRL_SHIFT                    (0U)
/*! THRL - Lower Threshold Value */
#define ADC_STAW2R_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW2R_THRL_SHIFT)) & ADC_STAW2R_THRL_MASK)

#define ADC_STAW2R_AWDE_MASK                     (0x80000000U)
#define ADC_STAW2R_AWDE_SHIFT                    (31U)
/*! AWDE - Self-Test Watchdog Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW2R_AWDE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW2R_AWDE_SHIFT)) & ADC_STAW2R_AWDE_MASK)
/*! @} */

/*! @name STAW4R - Self-Test Analog Watchdog C0 */
/*! @{ */

#define ADC_STAW4R_THRL_MASK                     (0x7FFFU)
#define ADC_STAW4R_THRL_SHIFT                    (0U)
/*! THRL - Lower Threshold Value */
#define ADC_STAW4R_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW4R_THRL_SHIFT)) & ADC_STAW4R_THRL_MASK)

#define ADC_STAW4R_THRH_MASK                     (0x3FFF0000U)
#define ADC_STAW4R_THRH_SHIFT                    (16U)
/*! THRH - Higher Threshold Value */
#define ADC_STAW4R_THRH(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW4R_THRH_SHIFT)) & ADC_STAW4R_THRH_MASK)

#define ADC_STAW4R_WDTE_MASK                     (0x40000000U)
#define ADC_STAW4R_WDTE_SHIFT                    (30U)
/*! WDTE - Self-Test Watchdog Timer Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW4R_WDTE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW4R_WDTE_SHIFT)) & ADC_STAW4R_WDTE_MASK)

#define ADC_STAW4R_AWDE_MASK                     (0x80000000U)
#define ADC_STAW4R_AWDE_SHIFT                    (31U)
/*! AWDE - Self-Test Watchdog Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_STAW4R_AWDE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW4R_AWDE_SHIFT)) & ADC_STAW4R_AWDE_MASK)
/*! @} */

/*! @name STAW5R - Self-Test Analog Watchdog C */
/*! @{ */

#define ADC_STAW5R_THRL_MASK                     (0x7FFFU)
#define ADC_STAW5R_THRL_SHIFT                    (0U)
/*! THRL - Lower Threshold Value */
#define ADC_STAW5R_THRL(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW5R_THRL_SHIFT)) & ADC_STAW5R_THRL_MASK)

#define ADC_STAW5R_THRH_MASK                     (0x7FFF0000U)
#define ADC_STAW5R_THRH_SHIFT                    (16U)
/*! THRH - Higher Threshold Value */
#define ADC_STAW5R_THRH(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_STAW5R_THRH_SHIFT)) & ADC_STAW5R_THRH_MASK)
/*! @} */

