zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_ADC.h
/*! @name AMSIO - Analog Miscellaneous In/Out register */
/*! @{ */

#define ADC_AMSIO_HSEN_MASK                      (0x60000U)
#define ADC_AMSIO_HSEN_SHIFT                     (17U)
/*! HSEN - High-Speed Enable
 *  0b00..Normal conversion speed
 *  0b11..High-speed conversion
 *  *..reserved
 */
#define ADC_AMSIO_HSEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_AMSIO_HSEN_SHIFT)) & ADC_AMSIO_HSEN_MASK)
/*! @} */

/*! @name CALBISTREG - Control And Calibration Status */
/*! @{ */

#define ADC_CALBISTREG_TEST_EN_MASK              (0x1U)
#define ADC_CALBISTREG_TEST_EN_SHIFT             (0U)
/*! TEST_EN - Calibration Enable
 *  0b0..Wait to start a calibration
 *  0b1..Start calibration
 */
#define ADC_CALBISTREG_TEST_EN(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_TEST_EN_SHIFT)) & ADC_CALBISTREG_TEST_EN_MASK)

#define ADC_CALBISTREG_TEST_FAIL_MASK            (0x8U)
#define ADC_CALBISTREG_TEST_FAIL_SHIFT           (3U)
/*! TEST_FAIL - Calibration Status
 *  0b0..Calibration finished successfully or has not been run since the last reset
 *  0b0..No effect
 *  0b1..Calibration did not finish successfully
 *  0b1..Clears flag
 */
#define ADC_CALBISTREG_TEST_FAIL(x)              (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_TEST_FAIL_SHIFT)) & ADC_CALBISTREG_TEST_FAIL_MASK)

#define ADC_CALBISTREG_AVG_EN_MASK               (0x10U)
#define ADC_CALBISTREG_AVG_EN_SHIFT              (4U)
/*! AVG_EN - Calibration Averaging Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CALBISTREG_AVG_EN(x)                 (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_AVG_EN_SHIFT)) & ADC_CALBISTREG_AVG_EN_MASK)

#define ADC_CALBISTREG_NR_SMPL_MASK              (0x60U)
#define ADC_CALBISTREG_NR_SMPL_SHIFT             (5U)
/*! NR_SMPL - Calibration Averaging Number
 *  0b00..4 samples
 *  0b01..8 samples
 *  0b10..16 samples
 *  0b11..32 samples
 */
#define ADC_CALBISTREG_NR_SMPL(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_NR_SMPL_SHIFT)) & ADC_CALBISTREG_NR_SMPL_MASK)

#define ADC_CALBISTREG_CALSTFUL_MASK             (0x4000U)
#define ADC_CALBISTREG_CALSTFUL_SHIFT            (14U)
/*! CALSTFUL - Calibration And Self-Test Full Range Comparison
 *  0b0..Lowest 11 bits are compared.
 *  0b1..All 15 bits are compared.
 */
#define ADC_CALBISTREG_CALSTFUL(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_CALSTFUL_SHIFT)) & ADC_CALBISTREG_CALSTFUL_MASK)

#define ADC_CALBISTREG_C_T_BUSY_MASK             (0x8000U)
#define ADC_CALBISTREG_C_T_BUSY_SHIFT            (15U)
/*! C_T_BUSY - Calibration Busy
 *  0b0..Calibration can be started
 *  0b1..Calibration is in progress
 */
#define ADC_CALBISTREG_C_T_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_C_T_BUSY_SHIFT)) & ADC_CALBISTREG_C_T_BUSY_MASK)

#define ADC_CALBISTREG_TSAMP_MASK                (0x18000000U)
#define ADC_CALBISTREG_TSAMP_SHIFT               (27U)
/*! TSAMP - Sample Period In Calibration
 *  0b00..22 conversion clock cycles
 *  0b01..8 conversion clock cycles
 *  0b10..16 conversion clock cycles
 *  0b11..32 conversion clock cycles
 */
#define ADC_CALBISTREG_TSAMP(x)                  (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_TSAMP_SHIFT)) & ADC_CALBISTREG_TSAMP_MASK)

#define ADC_CALBISTREG_RESN_MASK                 (0xE0000000U)
#define ADC_CALBISTREG_RESN_SHIFT                (29U)
/*! RESN - Conversion Resolution
 *  0b000..14-bit resolution
 *  0b001..12-bit resolution
 *  0b010..10-bit resolution
 *  0b011..8-bit resolution
 */
#define ADC_CALBISTREG_RESN(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_CALBISTREG_RESN_SHIFT)) & ADC_CALBISTREG_RESN_MASK)
/*! @} */

/*! @name OFSGNUSR - Offset And Gain User */
/*! @{ */

#define ADC_OFSGNUSR_OFFSET_USER_MASK            (0xFFU)
#define ADC_OFSGNUSR_OFFSET_USER_SHIFT           (0U)
/*! OFFSET_USER - Offset User */
#define ADC_OFSGNUSR_OFFSET_USER(x)              (((uint32_t)(((uint32_t)(x)) << ADC_OFSGNUSR_OFFSET_USER_SHIFT)) & ADC_OFSGNUSR_OFFSET_USER_MASK)

#define ADC_OFSGNUSR_GAIN_USER_MASK              (0x3FF0000U)
#define ADC_OFSGNUSR_GAIN_USER_SHIFT             (16U)
/*! GAIN_USER - Gain User */
#define ADC_OFSGNUSR_GAIN_USER(x)                (((uint32_t)(((uint32_t)(x)) << ADC_OFSGNUSR_GAIN_USER_SHIFT)) & ADC_OFSGNUSR_GAIN_USER_MASK)
/*! @} */

/*! @name CAL2 - Calibration Value 2 */
/*! @{ */

#define ADC_CAL2_ENX_MASK                        (0x8000U)
#define ADC_CAL2_ENX_SHIFT                       (15U)
/*! ENX - Enable X
 *  0b0..Disable
 *  0b1..Enable
 */
#define ADC_CAL2_ENX(x)                          (((uint32_t)(((uint32_t)(x)) << ADC_CAL2_ENX_SHIFT)) & ADC_CAL2_ENX_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ADC_Register_Masks */


/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ADC_H_ */

